{"author": {}, "body": "Regarding concern over the coronavirus outbreak/response — Trump called it a hoax created by Democrats and the media.\n\n[**From the transcript of his S. Carolina \"speech\"**](https://www.rev.com/blog/transcripts/donald-trump-charleston-south-carolina-rally-transcript-february-28-2020)**:**\n\n>\t**One of my people came up to me and said, “Mr. President, they tried to beat you on Russia, Russia, Russia.” That didn’t work out too well. They couldn’t do it. They tried the impeachment hoax. That was not a perfect conversation. They tried anything. They tried it over and over. They’d been doing it since you got in. It’s all turning. They lost. It’s all turning. Think of it. Think of it. And this is their new hoax.** \n\n*People are saying!!!!1!!!*\n\n>\tBut we did something that’s been pretty amazing. We have 15 people in this massive country and because of the fact that we went early. We went early, we could have had a lot more than that. We’re doing great. Our country is doing so great. We are so unified. We are so unified. The Republican party has never ever been unified like it is now. There has never been a movement in the history of our country like we have now. Never been a movement. \n\nIn the next breath, he **conflates** the loyalty of his **voters** *and* campaign for **re-election** with the coronavirus outbreak and response. \n\n>\tSo a statistic that we want to talk about, go ahead. Say USA. It’s okay. USA.   \n>\t\n>\tSo a number that nobody heard of, that I heard of recently and I was shocked to hear it, 35,000 people on average die each year from the flu. Did anyone know that? 35,000, that’s a lot of people. It could go to 100,000, it could be 27,000. They say usually a minimum of 27, goes up to 100,000 people a year die. And so far we have lost nobody to coronavirus in the United States. Nobody. \n\nNext, he **conflates** annual **flu data** with the coronavirus outbreak and response. \n\n>\tAnd it doesn’t mean we won’t and we are totally prepared. It doesn’t mean we won’t, but think of it. **You hear 35 and 40,000 people and we’ve lost nobody and you wonder the press is in hysteria mode.** \n\nNow he’s **conflating** the **”new Democratic hoax”** with **”the media”** ***reporting*** about concerns over the coronavirus outbreak/response. \n\n>\t**CNN fake news and the camera just went off,** the camera. The camera just went off. Turn it back on. Hey, by the way, hold it. Look at this, and honestly, all events are like this. It’s about us. It’s all about us. I wish they’d take the camera, show the arena please. They never do. They never do. \n\nFinally, **he calls the media fake**. \n\n>They never do it. They never show the arena. You can hear it because when you hear it, that’s not 200 people. That’s not a hundred people. That’s thousands and thousands of people including people outside. You can hear it.   \n>\t\t>They always show my face. See that face? They show my face. I want them to show the arena, not my face, right? How many have you been to? How many rallies have you gone? ...\n\nThen “falls off the stage” (figuratively) in a narcissistic aside. \n\n... Later, he circles back, ya know, to reiterate: \n\n>**While the extreme left has been wasting America’s time with these vile hoaxes**, we’ve been killing terrorists, creating jobs, raising wages, enacting fair trade deals, securing our border, and lifting up citizens of every race, religion, color, and creed.", "created_utc": 1583129214.0, "distinguished": null, "id": "fj920vv", "is_submitter": false, "link_id": "t3_fc6g9l", "parent_id": "t1_fj90c1z", "score": 7, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fj920vv", "collapsed": false, "permalink": "/r/politics/comments/fc6g9l/video_reporter_shuts_down_bloomberg_after_he/fj920vv/"}