{"author": {"comment_karma": 82923, "created_utc": 1559794359.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_0079D3.png", "id": "3wb6aaqi", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 1087, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#0079D3", "user_is_muted": null, "display_name": "u_StabTheTank", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_0079D3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/StabTheTank", "key_color": "", "name": "t5_12mgj0", "is_default_banner": true, "url": "/user/StabTheTank/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "StabTheTank"}, "body": "He called it a hoax.  At the most generous description of what he did, you could say that he said it was a hoax that Democrats were concerned about Coronavirus.\n\nI've already argued with conservatives about this a dozen times in Coronavirus threads - they're thrilled to link to the snopes article that says \"mixed\" because you could interpret it in a way that he wasn't specifically calling the coronavirus a hoax.\n\nBut he did, in every possible way that he could. \n\n\"15 cases, should be down to zero very soon\"\n\nHe downplayed it for 3 weeks so it wouldn't spook the stock market.\n\nHe didn't use the WHO/South Korean test that gave results in 6 hours, so he could instead bid out a new test to the highest bidder in the private sector, and they had to make it all over from scratch.  Results from the U.S. test take up to 5 days, and the tests themselves are currently woefully rationed (an upgrade from being entirely absent for weeks).\n\nIf anyone tells you that he didn't call it a hoax, show them this:\n\nFebruary 10: Trump says without evidence that the coronavirus “dies with the hotter weather”\n\nFebruary 24: Trump baselessly claims the situation is “under control”\n\nFebruary 25: A senior White House official falsely claims the virus has been “contained”\n\nFebruary 25: Trump falsely claims Ebola mortality was “a virtual 100%”\n\nFebruary 25: Trump falsely claims “nobody had ever even heard of Ebola” in 2014\n\nFebruary 26: Trump wrongly says the coronavirus “is a flu”\n\nFebruary 26: Trump baselessly predicts the number of US cases is “going very substantially down” to “close to zero”\n\nFebruary 26: Trump wrongly says the flu death rate is “much higher” than Dr. Sanjay Gupta said\n\nFebruary 27: Trump baselessly hints at a “miracle”\n\nFebruary 28: Trump baselessly hints at an immigration link to the virus\n\nFebruary 29: Trump exaggerates Tim Cook’s comments about Apple and China\n\nMarch 1: Azar wrongly says 3,600 people have been tested\n\nMarch 2: Trump falsely claims “nobody knew” the number of US flu deaths\n\nMarch 2: Trump says a vaccine is coming “relatively soon”\n\nMarch 4: Trump falsely claims Obama impeded testing\n\nMarch 4: Trump wrongly says as many as 100,000 people died of the flu in 1990\n\nMarch 4: Trump says “the borders are automatically shut down”\n\nMarch 4: Trump says he believes there was a coronavirus death in New York, though there hadn’t been one\n\nMarch 4: Trump falsely claims the Obama administration “didn’t do anything” about H1N1\n\nMarch 5: Trump misleadingly describes a Gallup poll relating to his handling of the virus\n\nMarch 5: Trump wrongly claims the virus only hit the US “three weeks ago”\n\nMarch 6: Azar wrongly claims there is no test shortage\n\nMarch 6: As the number of cases and deaths in Italy rises, Trump says the number is “getting much better”\n\nMarch 6: Trump falsely claims anybody can get tested if they want\n\nMarch 6: Trump exaggerates the number of people on the Grand Princess cruise ship\n\nMarch 6: Trump falsely says US coronavirus numbers “are lower than just about anybody”\n\nMarch 6: Trump baselessly muses that “maybe” the coronavirus improved US jobs numbers\n\nMarch 9: Pence says Trump’s “priority” was getting Americans off the ship\n\nImpeach this motherfucker before he kills 3% of America.", "created_utc": 1584473932.0, "distinguished": null, "id": "fkrqcqs", "is_submitter": false, "link_id": "t3_fka1ke", "parent_id": "t3_fka1ke", "score": 47, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkrqcqs", "collapsed": false, "permalink": "/r/politics/comments/fka1ke/trump_who_has_previously_called_the_coronavirus_a/fkrqcqs/"}