{"author": {"comment_karma": 31080, "created_utc": 1470854712.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "id": "10bqpm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 10192, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_GeorgeWendt1", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/GeorgeWendt1", "key_color": "", "name": "t5_defto", "is_default_banner": true, "url": "/user/GeorgeWendt1/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "GeorgeWendt1"}, "body": "Test was faulty in the beginning.  The travel ban bought us time.  Remember, the mantra was everyone needs a test.  That was never true.  You needed a test if a doctor told you that you needed a test.  Availability of tests was an issue, but it was vastly over inflated by the media and politicians demanding that everyone be tested.  It was/is an impossible condition to be met.\n\nPPE/medical equipment is not a federal responsibility.  Hospitals should have enough for a surge.  Cities/counties should have enough for an emergency.  States should have enough for a disaster.  Only then, should the Feds have backup.  NY and NYC had studies that told them they needed about 24,000 ventilators.  And, I would remind you that no one went without PPE or ventilators.  We had shortages but that was solved very quickly. \n\nRemember, in Feb, everyone was saying that we had more to worry about with the flu.  This includes Fauci, Pelosi, De Blasio, Cuomo...  You can't say Trump should have done this or that without pointing out the people who stepped forward with actual plans.  If you don't have a person who was crying out with a better way, then you have no ground to stand on to find fault with someone else's plan.\n\nLook at Hydroxychloroquine.  Trump mentions it in a briefing and all of the sudden every journalist is a doctor.  There are multiple studies that show it works.  We need large scale double blind studies, but every study with one exception says it works.  Politicians and journalist want to tell doctors what medicines doctors can prescribe.  Why?  The VA study doesn't show dosage/cumulative dosage.  The VA study prescribed it to late stage patients as a last ditch effort to save lives.  The \"Trump has a monetary gain\" from the drug was a lie.  So why all the hate for the drug?  And, would these have the same people fighting for the rights of AIDS patients to choose the drugs they take in the early stages of the AIDS epidemic?\n\nWe are pounded with TRUMP BAD every day.  There are things to find fault with.  He sounds like a moron when he talks.  He makes mistakes.  The levels of outrage over every little thing he does is ridiculous.", "created_utc": 1588693311.0, "distinguished": null, "id": "fpkeo9g", "is_submitter": false, "link_id": "t3_gddv33", "parent_id": "t1_fpjaw9z", "score": 1, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpkeo9g", "collapsed": false, "permalink": "/r/politics/comments/gddv33/trump_admits_he_was_briefed_on_coronavirus_before/fpkeo9g/"}