{"author": {"comment_karma": 58696, "created_utc": 1317774216.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_94E044.png", "id": "5zdd5", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 30175, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_MandingoPants", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/MandingoPants", "key_color": "", "name": "t5_dnala", "is_default_banner": true, "url": "/user/MandingoPants/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "MandingoPants"}, "body": "“Look, the democrats have nothing better to do but blame me for everything. I truly am the most hated president ever. Let me tell you something, they hate me so much that they everything in their power to affect all the great things I’ve done for this country. They don’t want to make America Great. \n\nAmerica has not been great to you all! Look at all the poor farmers here, dealing with liberal policies that help CHINA acquire tremendous power. That’s why I have to impose tariffs on those Chinese. Xi Ping, wonderful gentleman, we talk on the phone and it’s always good and productive. \n\nThe stock market is going up. That’s good. Corona virus affected everybody, but we have done tremendous efforts, our doctors have worked really hard, and we have 96% tested, all very good, very hard, umm, very good work. \n\nBut let me tell you something, all this blame they are putting on me, we did everything we could to stop them.\n\nObamacare, that, let me tell you something, look, I know we need changes here in America, and we have tried to get rid of that abomination. Affecting many Americans, sad, but Hussein Obama and lipstick Hillary, even though they are sore losers, these are smart individuals. Harvard, yale, you know trickster. \n\nNothing came from the investigations, I was vindicated, but sore loser Hillary and Obama are behind the tremendous devastation going on here. \n\nMany people died in Syria under Obama, and here in the US as well. Corona virus was a hoax until it wasn’t and we cannot let that fake news distract us from the harm the democrats have caused. George Bush Junior also, what a guy, let me tell you. He just came in here and took your tax money! Helping Captured McCain. You know, I didn’t go to his funeral. No time, too busy. \n\nBut be careful, I’m working hard, day and night, they tell me, “trump you know”, and the FCC with the fine gentleman Ajit Pai. Good man, went to Yale. And the 5g towers from China causing all of this. We’re looking into tariffs for steels imports. \n\nThat’s all folks. Thank you. \n\nAnd Keep America Great.”", "created_utc": 1588633098.0, "distinguished": null, "id": "fpi3siw", "is_submitter": false, "link_id": "t3_gddv33", "parent_id": "t1_fphqdcc", "score": 2, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpi3siw", "collapsed": false, "permalink": "/r/politics/comments/gddv33/trump_admits_he_was_briefed_on_coronavirus_before/fpi3siw/"}