{"author": {"comment_karma": 12307, "created_utc": 1339009250.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_545452.png", "id": "7x1kf", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 13329, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_TheEternal792", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TheEternal792", "key_color": "", "name": "t5_efm0w", "is_default_banner": true, "url": "/user/TheEternal792/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TheEternal792"}, "body": ">You're not getting it. These are completely different viruses we're dealing with.\n\nRespectfully, I think you're the one not getting it. I'm not making any comparisons about the virulence of the diseases. I'm only making competitions regarding objective facts between the two that were and are known. Fact is, Trump called a national emergency after 1 death, which goes directly against the false narrative that he called it a hoax. \n\n>The time to declare a national emergency was long before the first American death, and that's objectively true regardless of anything Obama ever said or did. \n\nMaybe so, but hindsight is always 20/20. Could things have been handled better? Yeah, probably. We could have also suspended all foreign travel without a 14 day quarantine, but this sub was complaining when Trump wanted to issue travel bans. I have no loyalty to Trump and there are plenty of things that he does and/or doesn't do that I would change. But that's not the reality that we're living in, and I believe he's far better than any of the democratic alternatives. Leftists love to hate anything President Trump does like it was the worst thing in the world, and many of his supporters cheer for everything he does like it's the best thing in the world. The truth is usually somewhere in the middle. Heck, I truly believe that if the President cured cancer, this sub would complain that he's putting researchers out of business. But I digress. \n\nI think it's ridiculous that people are actually repeating the lie (or worse, actually believing) that he called the virus a hoax. That was the point of my comment. I also think it's ridiculous that leftists are trying to blame the virus or consequences of the virus (like the stock market) on him. Sure, maybe things could have been handled better, maybe not. We'll never know, but I don't think any of the above claims would come from any reasonable person. \n\n>Invoking his name when discussing coronavirus is a waste of time.\n\n>>Look at the media's response to H1N1 under Obama compared to COVID-19 under Trump.\n\n>See above. There is literally no purpose to doing this other than to make excuses for Trump that he does not deserve.\n\nDepends on the context. Making comparisons between two respiratory RNA viruses from foreign countries during a pandemic that resulted in the death of Americans sure seems like a valid comparison. In one case, over 1000 died before a national emergency was claimed, in the other, only one. In one instance, the media was barely talking about the pandemic, in the other, chaos because that's all that was talked about, despite worse outcomes in the former *at that time*. Pointing out differences and clear media biases is certainly relevant. No one is making excuses, just stating facts and pointing out hypocrisy and bias.", "created_utc": 1584568387.0, "distinguished": null, "id": "fkvfv4w", "is_submitter": false, "link_id": "t3_fka5wb", "parent_id": "t1_fkughmf", "score": -1, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkvfv4w", "collapsed": false, "permalink": "/r/politics/comments/fka5wb/trump_says_he_knew_coronavirus_was_a_pandemic/fkvfv4w/"}