{"author": {"comment_karma": -100, "created_utc": 1519424783.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_FFD635.png", "id": "yifb2if", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 49, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FFD635", "user_is_muted": null, "display_name": "u_NihilistIconoclast", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_FFD635.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "left", "display_name_prefixed": "u/NihilistIconoclast", "key_color": "", "name": "t5_g5cf1", "is_default_banner": true, "url": "/user/NihilistIconoclast/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": true, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "NihilistIconoclast"}, "body": ">When the President doesn't agree with letting people off a ship to receive treatment because it will \"double the numbers,\" \n\n&#x200B;\n\nThis is one of the most bizarre attacks on Donald Trump so far. What exactly do you mean? He didn't want to let people off the ship because that would increase the numbers. The numbers of coronavirus in America. I.e. he was protecting Americans from getting coronavirus. He didn't wanna increase the numbers. **Are we not doing right now all the things we are doing so we won't \"increase the numbers.\"**  \nIt's his use of the word numbers as if he's just worried about his stats that's being attacked.\n\n**But he wanted to keep the numbers of Americans who died down.** How bizarre for you guys to attack him for that. I'm not even sure what this even means as a criticism. \n\n**Did you want the numbers to go up?**\n\n&#x200B;\n\n>or encourages the notion through his usual vagueness (to avoid responsibility) that people will be fine to keep going to work, or when to declare a national emergency is entirely a political mattey.\n\nThis is another lie you're repeating. But I know how it works. These lies get repeated and you're not even sure where it came from.  \nSo I'm not going to accuse you of lying. But the origin of this is a lie. And if you guys would search back to the origin of all these things you would realize it.\n\nHere's what Donald Trump said about going to work with coronavirus. And no he did not say you can go to work with coronavirus. He absolutely did not say that. **And this is a total lie from the fake news media that you guys listen to.** \n\n([https://www.youtube.com/watch?v=fqjrlKfW93I&t=1801s](https://www.youtube.com/watch?v=fqjrlKfW93I&t=1801s))\n\nStarts at 23:37\n\nNo he did not say they can go to work. He said some people have very mild disease and they may go to work and not even know they have the disease. Listen to the video. The interview with Hannity where he says this is at 23 minutes in.\n\nFake news is implying that it’s OK to go to work if you were diagnosed with coronavirus. It is not. And he clearly here stating that some people go to work in spite of having it because they have subclinical disease. Their symptoms are so mild they don’t realize they have anything bad and so they go to work because of that.", "created_utc": 1584768727.0, "distinguished": null, "id": "fl34ozi", "is_submitter": false, "link_id": "t3_fly2x9", "parent_id": "t1_fl2pkzb", "score": 0, "stickied": false, "subreddit_id": "t5_3cr3o", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fl34ozi", "collapsed": false, "permalink": "/r/AskTrumpSupporters/comments/fly2x9/what_is_your_opinion_of_the_coronavirus_video/fl34ozi/"}