{"author": {"comment_karma": 58114, "created_utc": 1347879080.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_25B79F.png", "id": "91aqx", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 2188, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_riskoooo", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/riskoooo", "key_color": "", "name": "t5_ckkhq", "is_default_banner": true, "url": "/user/riskoooo/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "riskoooo"}, "body": ">If that were all it took then we would have seen the success of other Russian-sponsored shenanigans in Italy and France, to name just two countries with a similar pattern of dodgy right-wing populist parties trying to game the system through social media. They might have some influence but they're certainly not running the show \n\nThese people and their populist parties do not have to be in power to be considered a success: the goal in the Kremlin is to stoke up unrest and sew division across Europe, which they have done with startling success by clandestinely funding the likes of Le Pen and Salvini and running online troll farms and propaganda campaigns on their behalf. Their presence and influence has shifted the Overton Window in those countries further right than it has been for a long time, and they have done the same in the UK, Spain, the Netherlands, Hungary, Germany, Greece...\n\nI never said they were 'running the show': I'm not implying complete control over the thoughts and voting habits of Europe's citizens. They just stoked the fires and let them burn.\n\nAnd their goal has never been to push for EU referenda on mainland Europe - the UK was the goal in that respect. Dugin's [Foundations of Geopolitics](https://en.m.wikipedia.org/wiki/Foundations_of_Geopolitics) outlines the intention of having France still married to Germany while the UK is politically and economically detached.\n\n>No, Brexit is most certainly an accident in that nobody in Westminster circa 2015 except the ERG had any intention of enabling it. \n\nBut that's exactly what I'm saying - the ERG never would've been able to exert enough pressure on Cameron on their own. They needed backing, and got it from the Kremlin and a group of right wing magnates in the US, both of whom have vested interests in seeing the UK out of the EU and, by extension, UK markets opened to foreign money and the EU weakened.\n\n> I still think most Tory MPs privately think it's a terrible idea, but once the die had been cast the only way the Tory party was going to stay in power was by doing exactly what we saw unfold last year\n\nNo doubt. I just don't agree that the British public arrived at the conclusion that Brexit was a good idea of their own volition. Have you seen the barrage of lies AIQ flooded Facebook with? The people of Britain were cultivated by external influences.", "created_utc": 1587230504.0, "distinguished": null, "id": "fnsx73n", "is_submitter": false, "link_id": "t3_g3iinm", "parent_id": "t1_fnsmhfb", "score": 2, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnsx73n", "collapsed": false, "permalink": "/r/unitedkingdom/comments/g3iinm/uk_moves_to_drop_huawei_as_5g_vendor_citing_china/fnsx73n/"}