{"author": {"comment_karma": 165, "created_utc": 1559757661.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_C18D42.png", "id": "3rh9ebnq", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 448, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_Sourpatchmunkey", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Sourpatchmunkey", "key_color": "", "name": "t5_12lgd7", "is_default_banner": true, "url": "/user/Sourpatchmunkey/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Sourpatchmunkey"}, "body": "Well I could do that but science OFTEN makes assumptions as well like educated guesses and hypothesis. Plus stats don’t mean much to me as they can be easily skewed. \n\nAt this stage what does science really know when the data input about 5G and its affects on people is so minimal? \n\nWhen more data is analyzed conclusions/assumptions change. That’s what has always been a constant in Humanity. \n\nIt’s like how the WHO or it might have been the CDC (I forgot) said the amount of pollution output is actually many multitudes worse than they thought and not good for humans so they have to change the regulations worldwide. 🤦🏽‍♂️ No one wants to question it before cuz they will be laughed at/ignored. \nSo all that science is now forgotten. Science only matches the human intellect and data/analysis. \nIt’s not some 8 ball we shake and receive answers from. \n\nHow can something that hasn’t been put out all over the world and used for many years/decades already have a conclusion made that it has no affect? 🤔\nI mean people are starting to see it with GMO foods of which I’ve done my own scientific experiments on myself with. \n\nI done a 30 day test myself on gmo, organic, and even junk food. It makes a big difference, though organic isn’t really organic anymore either, especially if you are highly active/play sports.\n\nI know plenty about GMOs since I was a kid, especially since my older sister has several medical degrees and taught me much growing up and has healed many people from “incurable” diseases. \n\nSimple question, why would you eat anything that doesn’t have proper natural (not FDA natural) nutrients and think you’ll get the same nutrients from that animal/plant?\nI’m curious to know if it does cause infertility after several generations and since so many people are willing to be the lab rats I’m being the actual scientist and taking notes and observing patiently :) \nI don’t know why anyone would even want to risk their genes in such a way unless they are starving. \n\n\n\nAlso science these days isn’t real science anymore. It’s more so been corrupted by politics, money, and agendas so sorry if I don’t fully trust that anymore. \nYou can though. That’s your choice and I won’t look down on you for that. \n\nAlso just because something is scientific or peer reviewed doesn’t make it true. I hated those professors that discount anything unless it was peer reviewed. I don’t know how they get through basic life to be honest. \n\nI may be giving my opinion but don’t fool yourself into thinking all the science and what we deem as factual is the way of the universe. We are just learning what we thought was reality is quite false and many other things so keep an open mind cuz none of us really know. \n\nAnd so what if I gave my opinion? I didn’t realize science was the only accepted form allowed in the world these days? \n\n\n🙏🏽🤙🏽🙏🏽", "created_utc": 1584719750.0, "distinguished": null, "id": "fl10sfp", "is_submitter": false, "link_id": "t3_fl9od5", "parent_id": "t3_fl9od5", "score": 1, "stickied": false, "subreddit_id": "t5_2qhn7", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fl10sfp", "collapsed": false, "permalink": "/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/fl10sfp/"}