{"author": {"comment_karma": 6189, "created_utc": 1406280266.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_7193FF.png", "id": "hkd94", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 161, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7193FF", "user_is_muted": null, "display_name": "u_Gigamon2014", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_7193FF.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Gigamon2014", "key_color": "", "name": "t5_1pwo4o", "is_default_banner": true, "url": "/user/Gigamon2014/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Gigamon2014"}, "body": ">Ok so your objection is on device identification and location? That's fair enough. Sure you can trace the PEI on a 5G baseband implementation reasonably accurately. But really tell me what advantage China will have in that space (yes I am aware of Huawei's directorship relation which with CCP) but how they are going to exfiltrate this from the core networks? The baseband and control plane of the 5G network is NOT directly connected to the public Internet. You'd know that if you knew anything about it. Not only that we have source code escrow with them, verifiable and repeatable builds like you should get with any national infrastructure build out.\n\nAnd now here comes to poor attempts to obfuscate with colourful words and bullshit. This is precisely what I am talking about. Mentioning the control plane and the baseband means what exactly? This is not where security concerns in relation to 5G lie and have little to nothing to do with any of the security concerns I mentioned, so why are you bringing them up? In a shitty attempt to namedrop stuff you know and I dont? I mean the points I mentioned dont even delve into the virtualisation of the network, the backwards compatibility with 4g infrastructure, the software being used on dynamically configurable hardware. Yes, this doesn't lay security issues entirely at the foot of China but that was never my point anyway. My point (as fucking stated) was that 5G present new and signfiicant security concerns which deserve better coverage than what they're currently receiving. Thats something thats been highlighted by plenty of industry experts too but go ahead and continue trying to go over everyone's heads with shit hardly anyone here is aware of, that was entirely the point of my earlier post.\n\n>Also lets go look at the baseband firmware of every damn device connected to every damn device on the planet. How many people have seen that? Not a lot. And some of it on some poorly implemented bits of hardware actually has bus arbitration and DMA capability and can directly access the system RAM of the device it is embedded in. Your Android handset is 10x more dangerous than the core network.\n\nYou're such a fucking clown. Intrusion detection software has been around for decades to monitor malicious activity and policy violation. If anything, software distributors have actually done a fairly decent job in informing the public of the importance of such systems and infrastructure, hence why even joe bloggs understands the necessity of having an adequate fucking anti virus solution, VPN and a firewall. What are you attempting to argue here? An Android handset is immensely fucking dangerous ...have you not seen the sheer amount of pushback against companies like Google and Microsoft for everything from privacy to anti-trust? The only reason your device specifically asks you whether you want certain software to have access to data within your device is due to the very pushback I am talking about. \n\n>So as for end-to-end encryption (with PFS if you must be pedantic), my point is the carrier's side of things even with the above is considerably less awful than the software that runs above that. We need to secure that first as it's quite frankly a shit show where we invite everyone into a party and help themselves to our data. But at the transport layer if you use end to end encryption that is correctly implemented then it makes absolutely no difference the transport layer you use WHICH IS THE ENTIRE POINT OF ENCRYPTION. Always assume Mallory is a dick and shouldn't be allowed to see what goes between Alice and Bob...\n\nWe are *literally,* TODAY just witnessing a controversy in which Zoom, a massively ubiquitous meeting software, has just been revealed to have lied about their so called end-to-end encryption and you're still questioning why its important for more analysis about 5G security concerns. LOL, I grew up in a shitty area and people with your mentality were literally the types to get repeatedly mugged. You have no situational awareness of any kind. You can tout off as many technological specifics, doesn't change a simple fact. Reducing those same concerns to sinophobia is laughable, especially when many of those same people outlining those concerns also point out that the US isnt exactly any better.", "created_utc": 1585918281.0, "distinguished": null, "id": "fmb4qoa", "is_submitter": false, "link_id": "t3_fu4x2o", "parent_id": "t1_fmb2m1q", "score": -8, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": 1585918634.0, "name": "t1_fmb4qoa", "collapsed": true, "permalink": "/r/unitedkingdom/comments/fu4x2o/uk_media_outlets_told_not_to_promote_baseless_5g/fmb4qoa/"}