{"author": {"comment_karma": 31533, "created_utc": 1432574252.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_EA0027.png", "id": "npdek", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 536, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#EA0027", "user_is_muted": null, "display_name": "u_Oilers93", "header_img": null, "title": "Seveneighty", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_EA0027.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Oilers93", "key_color": "", "name": "t5_3kia9", "is_default_banner": true, "url": "/user/Oilers93/", "banner_size": null, "user_is_moderator": null, "public_description": "Just a dude playing a dude disguised as another dude", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Oilers93"}, "body": "that's not how the burden of proof works. It's not up to someone to prove a negative - that's impossible. You can't prove that something doesn't exist. It's up to skeptics to do the research and prove something does exist, ie. higher cancer rates at 5G towers. Our current understanding of physics and cellular biology indicate that the local heating effects are the primary concern for humans, and 5G technology has been proven ad nauseam to not cause local heating nor cancer. That doesn’t prove 5G causes no adverse health effects, but like I said, that’s impossible to do. If I told you “we are certain that cell phones don’t kill us” you’d probably agree. But when some study comes along and says “but cell phones release 0.000003 ppm of neon into the atmosphere, and neon can kill us” then any study we’ve done to “prove” that cell phones can’t kill us become moot. \nNot one reputable, replicable research study has proven that 5G *does* cause health issues. In vitro studies, questionable at that, have shown *effects* on cells by 5G MMR. Thos effects are undetermined to actually be negative. Those studies mostly pertain to cell permeability, in vitro. The problem is, not one study has been able to extrapolate this to demonstrate a negative effect on humans. \nLet’s put it this way; standing near campfire has an *effect* on cells, but standing next to a campfire won’t cause you to explode into flames. Yet these are exactly the types of conclusions being drawn from extremely indeterminate studies. It’s irresponsible to jump to those conclusions, especially seeing as how we’ve got a pretty damn good understanding of science and none of it points to 5G causing harm. That’s not to say we know everything, but jumping to the extreme opposite end and saying “prove it’s safe” is really difficult when researchers release practically irrelevant in vitro studies that conspiracy theorists will latch onto like the holy grail of validation.", "created_utc": 1587092536.0, "distinguished": null, "id": "fnnhkn4", "is_submitter": false, "link_id": "t3_g2d5md", "parent_id": "t1_fnnd26s", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnnhkn4", "collapsed": false, "permalink": "/r/worldnews/comments/g2d5md/british_telecom_boss_reveals_39_engineers/fnnhkn4/"}