{"author": {"comment_karma": 374, "created_utc": 1526396346.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_15_FF66AC.png", "id": "1di27mpq", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 591, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_bazuka9000", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_15_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/bazuka9000", "key_color": "", "name": "t5_j7t0j", "is_default_banner": true, "url": "/user/bazuka9000/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "bazuka9000"}, "body": "Dr. Leif Salford is a neurosurgeon at Lund University Hospital, and Chairman of the Department of Neurosurgery. Since 1988 he has led a team of researchers that have exposed thousands of laboratory rats to microwave radiation from various sources. Since the late 1990s they have used mobile telephones as the source of this radiation.\n\nTheir results have been consistent and alarming: not only does radiation from a cell phone damage the blood-brain barrier, but it does so at even when the exposure level is reduced a thousandfold. Even more disturbingly, and contrary to what was expected, the damage to the blood-brain barrier worsened when the experimenters reduced the exposure level. The implies that SAR ratings for cell phones may be worthless and that it may not be possible to make cell phones safer by reducing their power.\n\nIn laboratory rats, Salford’s team has demonstrated that blood-brain barrier leakage occurs after only two minutes of exposure. Further, a single two-hour exposure to a cell phone, even at reduced power, was shown to damage or destroy up to two percent of an animal’s brain cells.\n\nIn other experiments in Salford’s laboratory, long term exposure of rats to a cell phone caused memory impairment, and a single six-hour exposure at extremely low power levels caused genetic damage. Exposure to a low-frequency magnetic field (low frequencies are also emitted by cell phones) caused disturbances of calcium transport in cells.\n\nSalford has called the use of cell phones by human beings “the largest biological experiment ever,” and he calls the potential implications of his laboratory results “terrifying.” “Those who might normally have got Alzheimer’s dementia in old age could get it much earlier,” he said. “Perhaps putting a mobile phone repeatedly to your head is something that might not be good in the long term.”\n\n---\n\nBLOOD-BRAIN BARRIER PERMEABILITY IN RATS EXPOSED TO ELECTROMAGNETIC FIELDS USED IN WIRELESS COMMUNICATION, 1997 https://ecfsapi.fcc.gov/file/7520941992.pdf\n\nNERVE CELL DAMAGE IN MAMMALIAN BRAIN AFTER EXPOSURE TO MICROWAVES FROM GSM MOBILE PHONES Leif G. Salford, Arne E. Brun, Jacob L. Eberhardt, Lars Malmgren, and Bertil R. R. Persson, 2003 http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1241519/pdf/ehp0111-000881.pdf\n\nNON-THERMAL EFFECTS OF EMF UPON THE MAMMALIAN BRAIN: THE LUND EXPERIENCE Leif G. Salford, Henrietta Nittby, Arne Brun, Gustav Grafström, Lars Malmgren, Jacob Eberhardt, and Bertil R. R. Persson, 2007 www.icems.eu/docs/Salford.pdf\n\nTHE MAMMALIAN BRAIN IN THE ELECTROMAGNETIC FIELDS DESIGNED BY MAN—With special reference to blood-brain barrier function, neuronal damage and possible physical mechanisms, 2008 https://academic.oup.com/ptps/article-pdf/doi/10.1143/PTPS.173.283/5430843/173-283.pdf\n\nCOGNITIVE IMPAIRMENT IN RATS AFTER LONG-TERM EXPOSURE TO GSM‐900 MOBILE PHONE RADIATION, 2008 https://www.researchgate.net/publication/5802630_Cognitive_impairment_in_rats_after_long-term_exposure_to_GSM-900_mobile_phone_radiation\n\nRADIOFREQUENCY AND EXTREMELY LOW-FREQUENCY ELECTROMAGNETIC FIELD EFFECTS ON THE BLOOD-BRAIN BARRIER, 2008 http://weepinitiative.org/LINKEDDOCS/health/nittby.PDF\n\nINCREASED BLOOD-BRAIN BARRIER PERMEABILITY IN MAMMALIAN BRAIN 7 DAYS AFTER EXPOSURE TO THE RADIATION FROM A GSM-900 MOBILE PHONE, 2009 http://ccst.us/projects/smart/documents/082009_Nittby_Increased_Permeability.pdf\n\nCOMPARISON BETWEEN TWO MODELS FOR INTERACTIONS BETWEEN ELECTRIC AND MAGNETIC FIELDS AND PROTEINS IN CELL MEMBRANES, 2009 http://people.eng.unimelb.edu.au/malkah/Publications/2009_Bio_Sweden_Work.pdf", "created_utc": 1585946070.0, "distinguished": null, "id": "fmci1z0", "is_submitter": false, "link_id": "t3_fuczaj", "parent_id": "t1_fmccamw", "score": 16, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmci1z0", "collapsed": false, "permalink": "/r/conspiracy/comments/fuczaj/robert_f_kennedy_jr_posted_this_regarding_5g_and/fmci1z0/"}