{"author": {"comment_karma": 43618, "created_utc": 1429724810.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_25B79F.png", "id": "n2d85", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 30, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_hitstein", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/hitstein", "key_color": "", "name": "t5_1lcqaa", "is_default_banner": true, "url": "/user/hitstein/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "hitstein"}, "body": "It *literally is also a belief and also a viewpoint*. Again, being a belief doesn't mean it's right or wrong, valid or invalid, logical or illogical, correct or incorrect.\n\nIt takes two parties to debate, what do you mean \"successfully created a debate?\" If you don't want to talk to them about it, don't. Nobody can force you into a debate.\n\n>The commonly accepted moral value of respecting other individuals' beliefs suggests that these beliefs are personal, subjective, and can't be concretely proven or dis-proven.\n\nNo, and it's very unfortunate that you feel that is the case. Again, being a belief doesn't mean it's right or wrong, valid or invalid, logical or illogical, correct or incorrect. Again, **a belief can be incorrect. A belief can be illogical. A belief can be wrong.** A belief isn't **inherently** one of those things. Again, accepting the fact that a person believes something is not the same as agreeing with them, or enabling that belief, or allowing them to believe that thing, or anything other than acknowledging that, in their brain, they have reached a conclusion about a thing. It does not mean that what they believe is correct. It does not mean that what they believe cannot be disproved.\n\nThe insistence that 2+2=7 **is a different belief.** It is 100% wrong, and I will 100% ask that person why they **believe** that 2+2=7. Because it doesn't. I will not deny the fact that they believe that 2+2=7, because they literally do, and they have literally told me that they do.\n\nHow would you describe the feeling that someone has earned ridiculed if not as a feeling of hatred? I can't speak for you, but when thinking of people I don't hate, I do not want someone to call them a loser because they believe in something that isn't true. And I can't imagine being okay with calling a person I don't hate a loser because they believe in something that isn't true.\n\nSo that begs the question. Is it okay to hate someone who thinks the Earth is flat? No, I don't think so. Again, I can't speak for you, but I cannot imagine developing a feeling of hatred for someone because they don't believe in NASA or basic physics, or even someone who believes that they've unlocked a different understanding of mathematics. I think it's sad that people can jump from \"worth trying to have a conversation with\" to \"It's okay if I call them a loser\" over not believing in NASA or basic physics.", "created_utc": 1588909668.0, "distinguished": null, "id": "fpucmte", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpu9unj", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpucmte", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpucmte/"}