{"author": {"comment_karma": 8317, "created_utc": 1583524390.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "id": "5v52ejej", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 3, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_TrollopingTrubadeur", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TrollopingTrubadeur", "key_color": "", "name": "t5_2h3vu5", "is_default_banner": true, "url": "/user/TrollopingTrubadeur/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TrollopingTrubadeur"}, "body": "It isn't a liberal vs conservative thing... its an outright bullshit thing vs anything even reasonably linked to facts and reality. thereafter its insane extremist jackasses, idiots and lying pieces of shit vs everyone else on the planet. \n\nAlso, there is absolutely nothing conservative about those people on facebook, public office and elsewhere  who currently march under that banner and the republican party. Far reicht, extremist/fundamentalist religious, ideologically dysfunctionally purist, corrupt if not out right treasonous as fuck yes, but conservative.. no nothing about any of the current batch is in any way conservative. \n\nCNN wise, it is shit too, but the main point is that no one should waste a single iota of time watching cable news.. ever... or any of the same from their \"local\" channels\" owned by Sinclair media or some such.\n \nWhich being said, the automatic \"Ya but CNN\", or \"CNN isn't either\" is exactly just that \"ya buttism\" to try and justify spread of nonsense\" from other venues.(note i did not once mention CNN before. That was you bringing it in at random out of context.) \n\nIts the same type of nonsense Trump cultists get in to when in a corner about the psycho in chief doing something they know is bad... automatic reply \"ya but hillary\", \"Ya but obama birth certificate\", \"ya but benghazi burgers\"... SJW type extremists have their own versions of the same, but the trump cultists are way more visible right now.\n\nMy \"Favorite\" response to calling out someone on continually sharing outright false bullshit and related memes was \"Ok that may be so , but the idea and message behind it is true\" which makes 0 sense what so ever, but is an easy nonsensical excuse to use to keep going at something they find to be emotionally or ideologically pleasant while ignoring all reality around them. \n\nsince we were on the topic of CNN before, Fox on its own end alongside OANN are just so completely full of bullshit they have their own category for it called \"News and opinion\" under the entertainment section where the network holds no responsibility for the idiotic \"opinions\" of their talking head hosts that just happen to fall under specific type of propaganda narratives that benefit the networks owners.  Why are they worse than the others? simple they blend together selective news and those \"opinions\" and the majority of each given broadcast is pure unadulterated bullshit after that. Its like watching a better worded version of some North Korean or Chinese ministry broadcast, Iranian state news, etc. but made with the for profit agenda in mind but with possibly even more outright bullshit mixed in.", "created_utc": 1587097386.0, "distinguished": null, "id": "fnnojzs", "is_submitter": false, "link_id": "t3_g2d5md", "parent_id": "t1_fnn8dun", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587097864.0, "name": "t1_fnnojzs", "collapsed": false, "permalink": "/r/worldnews/comments/g2d5md/british_telecom_boss_reveals_39_engineers/fnnojzs/"}