{"author": {"comment_karma": 70606, "created_utc": 1480261348.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_24A0ED.png", "id": "134ifv", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 9551, "subreddit": {"default_set": false, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#24A0ED", "user_is_muted": null, "display_name": "u_MrSoapbox", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_24A0ED.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/MrSoapbox", "key_color": "", "name": "t5_d9b9t", "is_default_banner": true, "url": "/user/MrSoapbox/", "banner_size": null, "user_is_moderator": null, "public_description": "Messages switched OFF, so don't waste your time. Also, happy to dismiss shills and won't waste time reading their predictable wall of text whatabouting, deflecting", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "MrSoapbox"}, "body": "No? We shouldn't appease America. We're a sovereign nation according to some stupid referendum (apparently we shouldn't be working with the EU either which I disagree with, they were the ones we _should_ of been trying to please). \n\nUnfortunately though, this is a catch 22, because we shouldn't be working with china for 5G anyway, but now is not the time to appease Trump, it's the time to stand up to him. We can start working closely with the US again when he has gone. If you haven't learnt by now, he is the type to ask for an inch, take a mile. He tries to dictate what other countries can and can't do while treating them like shit. As a soverign nation we should be doing what keeps _us_ the British people happy. We should be doing what's best for _our_ country, and since whatever makes the U.S happy fucks every one else over, no. Besides which, having china in the infrastructure is one of the worst things we can do except, having the US in it would be _worse_. At least with china we would be far more cautious and be keeping an eye on them. When it comes to the US though, cisco has already been found to have backdoors in their system around 9 fucking different times. Then there's the fact they're the 5 eyes, and something that doesn't get spoken about much with that is a certain part of it is to spy on _its own citizens_ and because say for example, the UK has laws about how it spies on its own citizens, it exempts the US from doing it who then do what our government isn't allowed to do, while relaying the information back to them (as we do them etc). Or, as Snowden put it better:\n\n>much emphasis placed on monitoring the World Wide Web. The former NSA contractor Edward Snowden described the Five Eyes as a \"supra-national intelligence organisation that does not answer to the known laws of its own countries\".[6] Documents leaked by Snowden in 2013 revealed that the FVEY has been spying on one another's citizens and sharing the collected information with each other in order to circumvent restrictive domestic regulations on surveillance of citizens.\n\nSo no, we don't want Huawei and we don't want Cisco. Working _with_ the US was fine under previous administrations, it is not under trump because he leaks like a sieve, bullies, acts like he runs any nation, and isn't trustworthy to keep his end of the shittiest deals.", "created_utc": 1587201484.0, "distinguished": null, "id": "fnrtz9w", "is_submitter": false, "link_id": "t3_g3iiuz", "parent_id": "t1_fnrs456", "score": 3, "stickied": false, "subreddit_id": "t5_2qhcv", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnrtz9w", "collapsed": false, "permalink": "/r/ukpolitics/comments/g3iiuz/uk_moves_to_drop_huawei_as_5g_vendor_citing_china/fnrtz9w/"}