{"author": {"comment_karma": 3048, "created_utc": 1385957419.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "id": "e5q9b", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 953, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_drumbum424", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/drumbum424", "key_color": "", "name": "t5_bsehs", "is_default_banner": true, "url": "/user/drumbum424/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "drumbum424"}, "body": "Very valid concerns. I think this part is what matters, and what I don't have any experience  personally when it comes to my understanding:\n\n>Are you familiar with the research that shows a significant difference in the effects of localized versus general radiation of particular wavelengths? Even at the same intensity, waves that are directed at specific areas of the body produce effects that aren't observed when the entire body is subject to the waves?\n\nI would be interested in seeing what you're referring to, as this is particularly important with 5G. My understanding is that 5G uses unidirectional antennas (pointed at an object, a point) while 4G uses omnidirectional antennas (it points in all directions). I could be totally wrong though. From what I understand, received field intensity/power is measured in the same fashion and in the same units for both unidirectional antennas and omnidirectional antennas since what you're measuring are the same electromagnetic quantities for either case. You would think that the potential damage to human biology simply has to do with the magnitude and frequency at which the exposure is occurring, but I am not thinking as a biologist since I am not one nor claim to be.\n\nWhat I was trying to point out in my comment and the many subsequent edits is that the argument that \"we've never been exposed to these frequencies before\" is just not true. Another thing to note with my edit about field intensity/strength is that power output does indeed matter. If you look at a lot of 5G transceivers, the ones that are mounted to light poles, for instance, the antennas themselves are small. There is not a lot of ass behind them, and they cannot drive a ton of energy into an EM field even if Verizon Wireless wanted to fry all of our sperm or something. The amount of power output capability is kind of related to the size of the antenna and source, as I understand. You don't see massive power cables running to those base stations either so the potential to drive an assload of power relative to a 4G station isn't really there.\n\n&#x200B;\n\nEdit to my comment about edits: The idea of \"adding up\" field intensity when two waves group together into one spot is called superposition, and is very much real. But here's an interesting point too: This only happens when the peaks and valleys of the signal are perfectly in phase (the peaks and valleys of the sine waves align in space and time). If the peaks from wave A and the valleys from wave B align in space and time, they cancel out, so the intensity at that place and time is zero, assuming everything else is quite. This is also assuming that the entire wave stays fixed at the carrier frequency, which it does not. FM transmission (which is used in WiFi and Bluetooth, I'm pretty sure) involves adding jitter to the carrier frequency to \"spread the energy out\" and encode data as changes in frequency instead of changes in amplitude, like AM. The odds of every unidirectional antenna adding up in space and time at the exact same frequency with all this jitter added and exposing your DNA to enough energy to damage it are, in my opinion, very slim.", "created_utc": 1587256650.0, "distinguished": null, "id": "fnu8ct1", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnu7341", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587257252.0, "name": "t1_fnu8ct1", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnu8ct1/"}