{"author": {"comment_karma": 12009, "created_utc": 1423783812.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_46D160.png", "id": "lbpt6", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 274, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_humbleElitist_", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/humbleElitist_", "key_color": "", "name": "t5_1mu24p", "is_default_banner": true, "url": "/user/humbleElitist_/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "humbleElitist_"}, "body": "Oh, ok, that's more subtle than I was imagining what you meant to be, which is my bad.  \n\nOk, yes, choosing expiramental designs which could falsify a hypothesis does seem substantially better than one that no observation of it could falsify any. Good point.  \n\n> In fact, I would say if one is designing experiments that tries to reinforce their hypothesis, then they are doing terrible science.\n\nI'm somewhat unsure quite what you mean by that, but if you mean \"designing the expirament to try to give the result that you think is true, rather than trying to discriminate between whether a thing is true or not\" then yeah.\n\nI imagine there is some way of defining how informative one should expect an expirament to be through some sort of bayesian definition, but I'm not sure what the way to do that would be.\n\n> A hypothesis that is not falsifiable cannot be taken through a healthy scientific process.\n\nI think I agree, and I think the position I was arguing may have been, an accidental strawman (is it still called a strawman if it is unintentional?) of what you were saying, and for that I apologize.\n\n\nHm, now I'm stuck wondering how we can define some sort of mathematical measure of (given our priors) how good (in terms of \"how informative\") we expect an expirament to be.\n\nI think our initial seeming-disagreement has been resolved (you were right, and either I initially misunderstood you or you at-least-mostly-convinced me), so I'd understand you wanting to end the conversation here, but if you have/know-of any ideas for how to define a number for how informative we expect an expirament to be, I'd be happy to hear them.\n\nAlso, thank you! I appreciate your comments.\n\n_____\n\n\n**the remainder of this comment is somewhat extraneous, the first part is the more important part. Feel extra free (more than for comments in general) to skip the rest of this comment**\n\n\nidea for how to define such a number: Suppose that there are two locations where ravens live, the north and the south, and we are interested in what proportion of ravens are black in each location, and also overall. Suppose we initially have a uniform prior for the proportion of ravens which are black, and I guess maybe our prior also has some correlation between the proportion of ravens in the north which are black and the number of ravens in the south that are black (but we still assign positive probability to, say, \"between 10% and 15% of ravens in the north are black, and between 90% and 100% of ravens in the south are black\").\n\nIt seems like if we've observed many ravens in the north (and found them all to be black), but haven't looked at any in the south, then looking at some of them in the south would be more informative? While seeing more ravens in the north (which, very much seem to be mostly black) would provide evidence (we expect probably a black raven, which would marginally make is more confident that the proportion of ravens in the north are black, and (depending on our prior) might make us very slightly more confident that more in the south are also black, but some small chance of a non-black raven, which would produce more of a change to what we think, in both cases),  \nit seems like starting to look at ravens in the south, where, based on our current estimates, we would have a higher probability of finding a non-black raven, would be an expirament which we should expect to be more informative. Finding a black raven there might not do as much to update our distribution for the proportion in the north which are black as finding a black one in the north would, but it would do substantially more to tell us about the proportion in the south which are?\n\nAlso, we are (subjectively) more likely to find a non-black raven where we are less confident that the proportion of black ravens is high, which would cause us to update more.\n\n\nHow can we express this numerically?\n\nMaybe if we assumed that we had utility based on some prediction scoring function?\n\nLike, suppose there is some scoring function f(pred,truth) which takes in an estimate of the proportions, and also the actual proportions (which we don't know), and returns a score.\n\nIf at a given time, we say that our expected utility is, supremum over pred of Expectation( f(pred,truth) ) (Or something like that? The idea being, \"if we had to make a single prediction, and we make the best one we can with our given understanding, what score would we get?\". Ah, but, I don't think this is quite the right thing, is it? Instead of \"a single prediction\" I guess maybe our score should depend on our distribution and the truth?)\n\nThen, when we consider a given expirament, we have some combined probability distribution of what posterior distribution would be after we perform it, along with what the truth is,  \nand so the \"informativeness\" of an expirament would be, how much we expect it will improve our score?\n\n\nidk, kinda spitballing here", "created_utc": 1588960747.0, "distinguished": null, "id": "fpwbxdt", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpv31tt", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpwbxdt", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpwbxdt/"}