{"author": {"comment_karma": 15870, "created_utc": 1510469382.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_4856A3.png", "id": "duimuh1", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 6735, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#4856A3", "user_is_muted": null, "display_name": "u_AllGodsAreFalseGods", "header_img": null, "title": "Jack Fell Down", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_4856A3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/AllGodsAreFalseGods", "key_color": "", "name": "t5_537u5", "is_default_banner": true, "url": "/user/AllGodsAreFalseGods/", "banner_size": null, "user_is_moderator": null, "public_description": "...", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "AllGodsAreFalseGods"}, "body": "Your concern here exposes how you don't understand surveillance.\n\nRight now at the head-end office of your ISP, where all your internet traffic comes in, there's a black box that sits between your incoming connection and the ISP's router that belongs to certain authorities.\n\nIts job is to crack the encryption on your connections and draw statistics on which wetbsites, TOR servers, etc. you connect to and flag any that appear suspicious.\n\nIt can do this in microseconds. HTTPS and Tor only serve to protect your data against hackers. They are trivial to crack for the authorities.\n\nIf your connections are flagged suspicious, a bit is dropped into a bucket associated with your IP address at your ISP.\n\nIf certain flags are dropped into the bucket (ie connections to known child porn servers with uploads taking place) there is an immediate investigation. If enough of certain other flags are dropped into the bucket (ie a significant amount of connections to TOR servers known for trading in illicit goods) you become a person of interest, with an investigation taking place without your ever being aware of it.\n\nThe investigation will be concluded and a warrant for your data and an arrest warrant will show up at your home attached to one of two entities depending on the severity of the case:\n\nIt will either be a friendly gentleman in a nice pleated suit who will inform you that you're under arrest and will let you get dressed and get your shoes on before quietly escorting you to an unmarked car.\n\nOr it'll be a armored van that parks around the corner with a team smashing in your door, dragging you out of bed in the middle of the night and marching you into the van.\n\nIn either case, the common components are:\n\n* Warrants and sufficient evidence will be gathered before you ever hear anything.\n* The arrest will come in the middle of the night when you are sleeping and vulnerable.\n* Anything in your home that can contain any type of data will be confiscated and held for as evidence for the trial.\n\nI had a friend whose house was raided because he was running a public FTP server (a common thing to do in the 90s/early 2000s) and someone had been uploading illegal content to a hidden folder on his server.\n\nA team broke down the front door, made everyone in the house get on the floor with their face in the carpet, collected every piece of electronic equipment in the house (even the Dish DVR), informed the roommate an investigation was taking place and left.\n\nThe only thing he got back after the investigation concluded was his Palm Pilot, which he got back 12 years later.\n\nThere is an ongoing battle between developers of security technology and authorities. Certain authorities require that any encryption technology either be crackable by them or have an exclusive backdoor they can access. If you're a developer of open source encryption technology, of course when you get that scary looking letter informing you that your product is too secure you're going to laugh and keep doing what you're doing. But that would be unfortunate because all of a sudden there's a bag of cocaine in the trunk of your car, or some illegal content on your computer. Goodness where did that come from. Guess we could let you go if you'd agree to certain concessions.\n\nThat was why the developers of Truecrypt put up [this warning](http://truecrypt.sourceforge.net/). They were forced to put in a backdoor for certain authorities.", "created_utc": 1586281007.0, "distinguished": null, "id": "fmphnno", "is_submitter": false, "link_id": "t3_fwh6tt", "parent_id": "t3_fwh6tt", "score": 3, "stickied": false, "subreddit_id": "t5_2t3lf", "downs": 0, "total_awards_received": 0, "edited": 1586281745.0, "name": "t1_fmphnno", "collapsed": false, "permalink": "/r/conspiracytheories/comments/fwh6tt/please_stop_linking_5g_as_the_cause_for/fmphnno/"}