{"author": {"comment_karma": 276, "created_utc": 1390314536.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_25B79F.png", "id": "ewqmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 62, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_Nolnol7", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Nolnol7", "key_color": "", "name": "t5_e1zkb", "is_default_banner": true, "url": "/user/Nolnol7/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Nolnol7"}, "body": "Sorry but this post is so misleading and borderline dangerous with the bullshit it peddles. \n\nStefan Lanka, for anyone who doesn't know, is a german molecular biologist who is well known for being an antivaxx conspiracy theorist, who claims that viruses do not exist.\n\nIt's true, that a court ruled in his favor, but not because he was right in any shape or form. For the record, Lanka put out a price money of 100k € for anyone, who can prove that the measles virus exists. A doctor sent him 6 publications that did, but Lanka refused to pay the money.\nSo that doctor went to court over this and the court made Lanka pay the money he had promised, since the studies sent by said doctor sufficiently proved the existence of the virus.\n\nNow a year later, they found a little loophole in favor of Lanka, and that is that Lanka asked for ONE study to prove it, and not six publications. The court despite that still said, that the virus existence was proven regardless. \n\nOh boy where do I start with Ryke Geerd Hamer? The reason why he is \"painted\" as a anti-semite is because he was an anti-semite. Literally his entire rhetoric was that jews are evil. But let's get into the fun part, the german new medicine. \n\nHamer is a complete fruitloop that claims, that diseases are a reaction to trauma and bad experiences that we have. One example is, that apparently tooth cavities being a result of kids not being able to bite because they are intimitated by other (foreign) students. You try to make sense of this, especially why the other kids have to be foreigners.  \n\nNow Hamer made international news because people that don't know any better or are as mentally deficient as him went to him, to treat their child's cancer. My personal favorite is when a girl that was treated by him ended up metastasizing and dying of it, while he claimed that the kid was perfectly healthy and that it's plausible that patients dying under his care were microchipped and target killed to make him look bad or some such shit.\n\n\nKaufman is a psychiatrist who is in contact with lunatics like Lanka and tries to make claims about microbiology and virology, he certainly knows more than your average non-medical person, but he is still peddling complete bullshit when it comes to corona virus, explaining where he goes wrong in regards to PCR would require to go incredibly in depth and would require much more than a passing understanding of science.\n\nStay safe and healthy everyone, don't believe everything you read on here.", "created_utc": 1586424400.0, "distinguished": null, "id": "fmvo89g", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t1_fmtht0q", "score": 4, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmvo89g", "collapsed": false, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmvo89g/"}