{"author": {"comment_karma": 12848, "created_utc": 1299614384.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_7E53C1.png", "id": "4xr4y", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 1238, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#7E53C1", "user_is_muted": null, "display_name": "u_Getawhale", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_7E53C1.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Getawhale", "key_color": "", "name": "t5_20c3kl", "is_default_banner": true, "url": "/user/Getawhale/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Getawhale"}, "body": "I really wish I had a definitive answer for that\n\nYou're asking how to defeat this high level of cognitive dissonance, where people essentially bend their reality to fit their pre-existing views, and I think the best answer is that it'll vary from person to person.\n\nThat's the reason I personally seek to understand instead WHY people get to this place and act in these ways. And lots of that research and insight and study is available to read freely online. Concepts like cognitive dissonance and its causes/mechanisms are good to understand, as are concepts like the backfire effect. There's lots of good reading on why, from a psych standpoint, people are most likely to pursue conspiracies or fringe theories. I find it all very interesting.\n\nI also like to look at the structure of social media, and what we know about its addictive nature and appeal - why people get hooked. It's helpful to realize, for example, that a large number of seniors are lonely and find that feeling informed, feeling like part of a community, being noticed and praised, those are all things they can find very effortlessly on a site like Facebook, which in turn seeks to keep people using their site for as long as possible, again using many psychological methods.\n\nTrying to understand the deeper answers and motivations is the most valuable starting point at least, in my book. It's a better starting point, I feel, to see most of these conspiracy people as victims who are confused, who are sad and lonely, who are being manipulated by propagandists without realizing it, who have valid concerns and fears but who are being influenced to blame it on all the wrong people and all the wrong things, rather than to dismiss them all as \"crazy ass kooks\" or whatever. Their hatred, mostly, didn't bubble up out of nowhere for no reason - it was created and grown with the help of the media they consume and the online spaces they inhabit (as well as some of our nastier human traits/instincts, and other factors.) \n\nI am not trying to absolve these folks of responsibility or be apologetic for them - they are still adults who act out of free will, and nobody is forcing them down these roads. But I think it's important to try to understand the inner workings and how we've gotten here - before we try to address the more complex question of \"How do we fix this?\" (Which, make no mistake, is a vitally important question for us all right now. I just think it's important we all address it on the same page, and thoroughly/responsibly.)\n\nSorry for a long answer that doesn't really answer your short question 😀", "created_utc": 1588903909.0, "distinguished": null, "id": "fpu3k9g", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fptq1z1", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpu3k9g", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpu3k9g/"}