{"author": {"comment_karma": 4988, "created_utc": 1434115053.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_7193FF.png", "id": "o2ch9", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 187, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7193FF", "user_is_muted": null, "display_name": "u_RedundantPhilosopher", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_7193FF.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/RedundantPhilosopher", "key_color": "", "name": "t5_1kjllv", "is_default_banner": true, "url": "/user/RedundantPhilosopher/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "RedundantPhilosopher"}, "body": "So for those of you who left your \"***man behind the curtain***\" x-ray glasses at home.\n\n5G was rolled out in America and was strongly implicated in [8 kids getting cancer within a short span of time](https://www.dailymail.co.uk/health/article-6886561/Cell-phone-tower-shut-elementary-school-eight-kids-diagnosed-cancer.html).What is interesting here is that the cell company responsible for the tower insisted that the levels were 100 times lower than the expected levels, but that is not what the Parents Private Investigator discovered.\n\nNow one might look at that isolated incident and think it is nothing serious, but when [180 scientists and doctors from 36 countries warn about the danger of 5G](https://www.jrseco.com/wp-content/uploads/2017-09-13-Scientist-Appeal-5G-Moratorium.pdf) in a petition to the EU parliament.\n\nWith statements like: \"[The EUROPA EM-EMF Guideline 2016 states that ”there is strong evidence that long-term exposure to certain EMFs is a risk factor for diseases such as certain cancers, Alzheimer's disease, and male infertility…Common EHS (electromagnetic hypersensitivity) symptoms include headaches, concentration difficulties, sleep problems, depression, lack of energy, fatigue, and flu-like symptoms.](https://www.jrseco.com/wp-content/uploads/2017-09-13-Scientist-Appeal-5G-Moratorium.pdf)”\n\nWith the guideline stating:  \"[There is strong evidence that long-term exposure to certain EMFs is a risk factor for diseases such as certain cancers, Alzheimer's disease, and male infertility. On the other hand, the emerging electromagnetic hypersensitivity (EHS) is more and more recognized by health authorities, disability administrators and case workers, politicians, as well as courts of law.](https://www.ncbi.nlm.nih.gov/pubmed/27454111)\"\n\nNow, what the heck does this have to do with Covid.\n\nWell you might have heard of the famous viral cycle call Lytic cycle, whereby a virus enters a cell and then multiplies until the cell bursts releasing more virus. What you may not have heard of though, is  te other reproductive cycle of a virus called the Lysogenic cycle.\n\n**Lysogeny** occurs when a virus integrates itself into the DNA of the cell and then when the cell divides, the virus divides. This is problematic because Lysogeny is how HIV and Herpes get such an iron grip on people, as Lysogeny tends to be an effective means of hiding from immune response for long periods. This will come into play later.\n\nLet's discuss other lessor known viral systems:\n\nThere is emerging evidence to suggest that some virus' can [hijack the motile proteins of mitochondria to move about](https://www.princeton.edu/news/2012/05/30/spread-nervous-system-viruses-sabotage-cell-hijack-transportation).\n\nFurther to this, [some virus' also demonstrates a novel behaviour for cell to cell transmission](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3700176/).\n\nWhilst the examples given are from a different family of virus', these examples were used to point out the lack of fundamental understanding of Virus mechanisms, which will move us on to the next point.\n\nRadio Frequency based activation of Lytic cycle within Lysogenic Infected Cells.\n\n***Is there a precident for this?***\n\n**Yes there is, Epstein-Barr.**\n\n[Exposure to a 50 Hz electromagnetic field induces activation of the Epstein-Barr virus genome in latently infected human lymphoid cells.](https://www.ncbi.nlm.nih.gov/pubmed/9276003)The idea is quite simple, engineer a virus to initially cause Lytic activity in first and second stage replication and then enter Lysogenic phase at third stage replication targeting the lung tissue. This leaves the victim with a lung full of infected tissue and 0 symptoms.\n\nShould an individual be selected for termination, the theory is, one need only to turn on the radio antenna to the frequency of the virus tuned responded frequency and they are going to die from Pneumonia.\n\nWell what was the factor for the Epstein Barr change? Resonant frequency of the cell size, and in this case, we're looking at about 70–90 nm, which is the wavelength that 5G covers.\n\nHere's the problem with this... it's an uncontrollable mechanism, as virus' mutate.\n\nIn fact, the Covid-19 has already been documented to have mutated 4 times so far.\n\nSo as far as population control or killing folks, it's not very effective.\n\nThis aside, the notion that 5G has induced cancer in children should be enough to be at least cautious about it.\n\nBut as far as the crackpot theories go, sure it is possible, but it is damn impractical.", "created_utc": 1586177404.0, "distinguished": null, "id": "fml371n", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t3_fvlm8b", "score": -4, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fml371n", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fml371n/"}