{"author": {"comment_karma": 43618, "created_utc": 1429724810.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_25B79F.png", "id": "n2d85", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 30, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_hitstein", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/hitstein", "key_color": "", "name": "t5_1lcqaa", "is_default_banner": true, "url": "/user/hitstein/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "hitstein"}, "body": "And the large amount of cleverly disguised disinformation? What about that?\n\nIn any event, I completely disagree. I think it's far more likely to just make people who are starting to go down that rabbit hole afraid to start a diologue with anyone other than the \"believers\" because they know that instead of people actually responding, they're just going to be ridiculed.\n\nLet's assume that that person has an existence where they perhaps don't have a lot of control over their life, and their life isn't the greatest. Perhaps in order to exercise some amount of control over the world around them, they start to think, \"Man, my life sucks and I'm not a bad person. I can't fathom that this is happening for no reason, so there must be a reason.\" Now they have a seed planted. They start to listen to some less than reputable am radio shows, who spout less than reputable explanations for certain things. That person tries to get another opinion and is called a fucking loser and an idiot, or they see someone else ask similar questions and get called a fucking loser and an idiot. What exactly do you think their next course of action is going to be nine times out of ten?\n\nHell, let's assume we have absolutely no idea why they believe the things they believe, because 99% of the time we have zero clue, and the other 1% of the time we have a poorly constructed, second hand, interpreted clue. Nothing changes. Ridiculing people makes them regress. If you don't care about the effect your actions have on other people, then it shouldn't matter to you that you are a dick (not *you*, people). If you do care about the effect your actions have on other people, then you wouldn't ridicule someone for thinking NASA is phony. If you don't care about the effect your actions have on other people, but you think that these people are dangerous, or even potentially dangerous, then you ridiculing them is only going to make them regress more, and you are now making them *more* dangerous.\n\nAnd this is not going to come off as nice, just know that I'm not *attacking* you as a person: If this stuff gets under your skin and prevents you from having a level discussion, that is 100% your baggage, and you should recognize that you don't really have a firm position from which to be defending people's actions in these situations. Your argument is coming from a place of frustration, and that is going to very heavily affect how you feel about something independent of reason or logic.\n\nAnd this is the second time I've had this response, so I need to address it: Engaging another person doesn't legitimize their belief. That's not how things work, in any way shape or form. Coming from a position of doubt, by definition, lends a measure on *in*validity. Lets break this down into the realm of absurdity: If a young child came up to you and said, \"I learned in school that 4\\*3=16!\" Okay, they probably are learning times tables and got two rows mixed up. Would you ridicule them, or would you start a dialogue with them and ask them how they got 16? Does asking them to show that 4\\*3=16 lend any amount of validity to their belief? Of course not. Unfortunately it's not usually as straightforward as that, otherwise I don't think we'd even be having this discussion, but I think you get the point.", "created_utc": 1588910774.0, "distinguished": null, "id": "fpueaea", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpuam5k", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpueaea", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpueaea/"}