{"author": {"comment_karma": 10069, "created_utc": 1564333905.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_FF66AC.png", "id": "4952947o", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 3071, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_hoesmad_hoesmad_", "header_img": null, "title": "H03SMad", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/hoesmad_hoesmad_", "key_color": "", "name": "t5_225ud3", "is_default_banner": true, "url": "/user/hoesmad_hoesmad_/", "banner_size": null, "user_is_moderator": null, "public_description": "if you take a Reddit profile seriously I have low standards for you in real life", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "hoesmad_hoesmad_"}, "body": "Thanks, I’m a neuroscience student and I’ve been pissed about how much MSM is just touting the COVID is 5g to discredit any arguments against 5g\n\nIt simply does not have enough tests done past surface and subdermal thermal measurements.\n\nThe only solid conclusions we have is “no heat damage” pretty much, which in no way encapsulates the issues that come with 5g\n\nEdit - a couple of studies that even contradict themselves by nature, but think for yourselves.\n\nhttps://pubmed.ncbi.nlm.nih.gov/29402696/\n\nEveryone’s listening to WHO right now about the pandemic, so - \n\n“Although some evidences are still controversial, the WHO IARC classified RF-EMF as \"possible carcinogenic to humans\", and more recent studies suggested reproductive, metabolic and neurologic effects of RF-EMF, which are also able to alter bacterial antibiotic resistance.” \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6765906/\n\nA break down of 94 studies on 5g. Don’t take my word for it or their word for it. Read it and think for yourself.\n\n“In summary, the majority of studies with MMW exposures show biological responses. From this observation, however, no in-depth conclusions can be drawn regarding the biological and health effects of MMW exposures in the 6–100 GHz frequency range. The studies are very different and the total number of studies is surprisingly low. The reactions occur both in vivo and in vitro and affect all biological endpoints studied.”\n\n“Regarding the quality of the presented studies, too few studies fulfill the minimal quality criteria to allow any further conclusions.”\n\nhttps://pubmed.ncbi.nlm.nih.gov/31540320/\n\n“The available studies do not provide adequate and sufficient information for a meaningful safety assessment, or for the question about non-thermal effects. There is a need for research regarding local heat developments on small surfaces, e.g., skin or the eye, and on any environmental impact. Our quality analysis shows that for future studies to be useful for safety assessment, design and implementation need to be significantly improved.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1182327/\n\nA lot of what we consume and use is based off of these standards.\n\n“However, there are several approaches to improve the post-study probability.\n\nBetter powered evidence, e.g., large studies or low-bias meta-analyses, may help, as it comes closer to the unknown “gold” standard. However, large studies may still have biases and these should be acknowledged and avoided”", "created_utc": 1587246540.0, "distinguished": null, "id": "fntpzbh", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fntk19d", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587266508.0, "name": "t1_fntpzbh", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fntpzbh/"}