{"author": {"comment_karma": 49773, "created_utc": 1562772443.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_0079D3.png", "id": "44hlnmb1", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 5178, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#0079D3", "user_is_muted": null, "display_name": "u_professorshillphd", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_0079D3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/professorshillphd", "key_color": "", "name": "t5_1obadz", "is_default_banner": true, "url": "/user/professorshillphd/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "professorshillphd"}, "body": "There's a reason Russia has such a stranglehold on internet conspiracies.\n\nThey stand no chance of competing with the western world in terms of soft or hard power so they've opted for asymmetric warfare and destabilizing the western world.\n\nThere's a bit from Peter Pomerantsev in his book \" nothing is true and everything is possible\" that is relevant:\n\n> The first thing the President had done when he came to power in 2000 was to seize control of television. It was television through which the Kremlin decided which politicians it would “allow” as its puppet-opposition, what the country’s history and fears and consciousness should be. And the new Kremlin won’t make the same mistake the old Soviet Union did: it will never let TV become dull. The task is to synthesize Soviet control with Western entertainment. Twenty-first-century Ostankino mixes show business and propaganda, ratings with authoritarianism. And at the center of the great show is the President himself, created from a no one, a gray fuzz via the power of television, so that he morphs as rapidly as a performance artist among his roles of soldier, lover, bare-chested hunter, businessman, spy, tsar, superman. “The news is the incense by which we bless Putin’s actions, make him the President,” TV producers and political technologists liked to say. Sitting in that smoky room, I had the sense that reality was somehow malleable, that I was with Prosperos who could project any existence they wanted onto post-Soviet Russia. But with every year I worked in Russia, and as the Kremlin became ever more paranoid, Ostankino’s strategies became ever more twisted, the need to incite panic and fear ever more urgent; rationality was tuned out, and Kremlin-friendly cults and hate-mongers were put on prime time to keep the nation entranced, distracted, as ever more foreign hirelings would arrive to help the Kremlin and spread its vision to the world.\n\n> But though my road would eventually lead back to Ostankino, my initial role in the vast scripted reality show of the new Russia was to help make it look and sound and feel Western. The network I initially worked with was TNT, which is housed in a new office center called Byzantium. On the ground floor is a spa done up in faux Roman style with Doric plaster columns and ruins, frequented by languid, leggy girls here to deepen already deep tans and have endless manicures and pedicures. The manicures are elaborate: rainbow-colored, multilayered, glitter-dusted designs of little hearts and flowers, so much brighter than the girls’ bored eyes, as if they pour all their utopias into the tiny spaces of their nails.", "created_utc": 1588905670.0, "distinguished": null, "id": "fpu6erx", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpt7bib", "score": 6, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpu6erx", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpu6erx/"}