{"author": {"comment_karma": 276, "created_utc": 1390314536.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_25B79F.png", "id": "ewqmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 62, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_Nolnol7", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Nolnol7", "key_color": "", "name": "t5_e1zkb", "is_default_banner": true, "url": "/user/Nolnol7/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Nolnol7"}, "body": "At this point I'm giving up, as I said before: no matter what I say, I'm not gonna change your mind.\n\nThe court case was NOT about actually proving whether viruses exist or not (by the way, in regards to this question the court sided with the doctor that the proof was found legitimate), but that it was not presented in the way Lanka wanted, splitting hairs over words to not have to pay out that money. There is nothing in this case suggesting that viruses are verified as hoaxes.\n\nWhat other websites say is completely irrelevant, this is the official document straight out of the horses mouth and its ruling has been misconstrued by anti-vaxx communities as \"look we told you so\" even though it doesn't actually support their claims.\n\nWhat is there to debunk about Hamers, when a big part of his \"laws\" came to him in his dreams? How is anyone supposed to prove that women get breast cancer in response to their child getting injured or sick? \n\nYou know what, believe in whatever you want. If viruses ain't real, feel free to have unprotected sex with whoever you want. If  microbes and bacteria can't cause diseases just jump into the next fetid pool to refresh yourself.\n\nBy the way I'm watching Andrew Kaufman's interview with Dawn Lester and David Parker and am at the point, where they're saying that doctors a hundred years ago said that vaccines are superstition. I'm only 23 minutes in but find this argument incredibly laughable. The reason why is because of surgeon and obstetrician Ignaz Semmelweis who came up with the idea to wash and disinfect hands before delivering babies as a lot of mothers died after birth due to infections. He was mocked for that, but eventually doctors realized that he was right and this is one of the reasons why we have hygienic protocols. What I'm trying to say with this is that the argument \"doctors said back then\" is not very conclusive to todays research and medical dogma. \nAs I mentioned, I'm only 23 minutes in and this is only one of my first impressions, so I'm going to watch the rest of the video and might come back later with thoughts on it. Definitely find it questionable though that both interviewees background is self-admittedly in accountancy and electrical engineering, but oh well let's give this a shot.", "created_utc": 1586442017.0, "distinguished": null, "id": "fmw8xby", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t1_fmw3d5j", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmw8xby", "collapsed": false, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmw8xby/"}