{"author": {"comment_karma": 8317, "created_utc": 1583524390.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "id": "5v52ejej", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 3, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_TrollopingTrubadeur", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TrollopingTrubadeur", "key_color": "", "name": "t5_2h3vu5", "is_default_banner": true, "url": "/user/TrollopingTrubadeur/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TrollopingTrubadeur"}, "body": "> Probably cause all connected to the page are family, friends of colleagues of old that I actually liked before FB but live in very different places. \n\nPretty much the same as mine and some at random would change to start sharing weird as fuck nonsense. \n\n>I make a point of complaining about every news item or advertising FB pops up.\n\ni did that too and much like with the \"google news\" aggregation site it does not and did not work to do much on a ton of fronts. \n\n> Most of the posts in this grouping of mine are text and some funny memes.\n\nThat was part of the problem making the prior one much worse than it needed to be... circle jerk nonsense and all on multiple fronts. Just because something is ideologically pleasant, or primary group related \"funny does not make it real or true and that directly impacts other things in terms of contents you get spammed with by proxy from others. \n\n>Message memes are just about each one dumb shit. Crap on them. On principle.\n\nthat is fine, but can be done via text, email etc like regular shit talking going wayys back. \n\n\n>Part of FB's success is that they hit on a structure that is so easy to use. \n\nsure it is, but that bit is an illusion as i've explained before... easier to text than to get networked in with FB... in fact fuck FB for the abusive data practices and all.(at its root its just a texting and email hybrid platform... with a core common interface for other bullshit that is not worth a damn) \n\n\n>These days one does have to consult a number of trusted outlets. And then research some stories as well. Bring back trusted PRINT newspapers....\n\nI know, but print papers were jsut as bad, if at times not worse... just simpler really and less easily refuted. fuck tabloids and all therein... FB fuck the whole platform for helping to enable the tabloid bullshit thereafter in the modern context. \n\nThat being said, \nI will never signup for another FB account. Anyone requiring me to do so be it an employer or otherwise i am better off walking away and not doing so than getting \"re-integrated\" to it in any way shape or form. \n\nFB, much like fox and other cable news type media sources and othjer similar types on a multitude of fronts is just bad if not outright horrendous for ones long term mental health outcomes. No one should be on it... ever less it is absolutely work and career necessary.(for me its not nor will it be)", "created_utc": 1587119490.0, "distinguished": null, "id": "fnobmbd", "is_submitter": false, "link_id": "t3_g2d5md", "parent_id": "t1_fno9s1a", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnobmbd", "collapsed": false, "permalink": "/r/worldnews/comments/g2d5md/british_telecom_boss_reveals_39_engineers/fnobmbd/"}