{"author": {"comment_karma": 4387, "created_utc": 1563574678.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_A5A4A4.png", "id": "46xej04r", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 776, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_Kelosi", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Kelosi", "key_color": "", "name": "t5_2144wc", "is_default_banner": true, "url": "/user/Kelosi/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Kelosi"}, "body": "> The push for individualism and constant growth, as well as constant accumulation will inevitably reward the most sociopathic people to rise to the top \n\nNo it will not. This is the exact kind of propaganda that communist states rely on. Individualism protects the interests of individuals. Only you can best meet your needs. Nobody else can tell you what they are. Collectivism fundamentally corrupts people's moral values by placing a greater importance on the group than the individual. It creates a culture of mutual expectations that places less value on those that fall away from the norm. Like the elderly, sick, disabled, and those struggling with addiction or mental disorders. There's a reason why Chinese people are stereotypically obnoxious and rude. They have no consideration for people on the individual level. It makes a societies values hollow and superficial. Without valuing the little things in life there's nothing to build up on instead of saving face. \n\nConstant growth is what has driven the technological progress of the 21st century. Yes we have limited resources, but that doesn't make growth bad. It means there are more challenges to be overcome. But growth is still and will always be the goal. \n\n> The thing is, wealthy businessmen/women do continue to accumulate wealth, which they use to buy power, which they use to buy government. This has been happening in the US for 100 years, and its patently obvious today when we look at our government and the policies.\n\nThis is even worse in communist countries. What you're describing is called corruption and no communism doesn't provide a solution to it. In fact, private property IS a solution to this. It distributes the balance of power so that when corruption eventually does occur you don't end up with a totalitarian state. Like once again, we've seen with every communist state. Capitalism is clearly still doing a better job at this, even if its obviously not perfect. \n\nFingerpoint at the US with insinuations and hearsay all you want but Americans are still accountable to the law and they don't have concentration camps. \n\n>  True communism is possible\n\nIt isn't. And multiple attempts to implement it have given us enough reason to know by now. And the inverse applies to capitalism. We know it does work by now. \n\n> it'll happen when we realize we're post scarcity\n\nIt's funny that you mention constant growth and yet fall back on this. We will never eliminate money. Post scarcity is only possible with money. It's a measure of effeciency, as well as relative scarcity. In a \"post scarcity\" economy what stops people from building their homes out of gold or platinum? Nothing does! We will eventually find ourselves right back where we started once our resources are expended again. This is actually a perfect example of ehy pro communist rhetoric is completely imaginary. All you can do is repeat the same appeals that were told to you. These are the sweet sounding words I was referring to earlier, and not only are they completely meaningless, they expose your lack of understanding of anything practical. \n\n> I don't think anyone can rationally say capitalism will last forever.\n\nWhat a stupid statement. Of course nobody did. This is a meaningless non sequiteur designed to direct the reader to you're preferred conclusion. Even if capitalism doesn't last forever, that in no way implies that communism is a comparable alternative. You're merely trying to make it appear valid by default. And that's the wrong way to reason. No wonder you believe in non sense if comments like this are convincing to you.", "created_utc": 1586589882.0, "distinguished": null, "id": "fn2i5uq", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t1_fn1qjh7", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586590108.0, "name": "t1_fn2i5uq", "collapsed": false, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fn2i5uq/"}