{"author": {"comment_karma": -1, "created_utc": 1580392947.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_7E53C1.png", "id": "5jra1zrn", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7E53C1", "user_is_muted": null, "display_name": "u_alosha1", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_7E53C1.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/alosha1", "key_color": "", "name": "t5_2e6nhl", "is_default_banner": true, "url": "/user/alosha1/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "alosha1"}, "body": "CELL PHONES emit radiofrequency radiation (radio waves), a form of non-ionizing radiation, from their antennas. Parts of the body nearest to the antenna can absorb this energy. \n\n\n\nAll typa G’s are dangerous.. \nWhen you’re talking about cell TOWERS (continued exposure). 4G, 3G, 2G, 1G. Cell Phone towers give off more radiation than just a cellphone (duh) and radio frequency radiation is a possible 2B carcinogen.\n\n\n\nNow,\n\n5G uses largely untapped bandwidth of the millimeter wave (MMW), which is between 30GHz and 300GHz, while lover scale non-ionizing radiation( below 60GHz) argued safe there hasn’t been any research done with frequency able to reach that high..\n\n5G will support AT LEAST 100 billion (unimaginable number) devices and will be 10 to 100 times faster than current 4G technology.(4G was already about 10 times faster than 3G). \n\nMillimeter waves (MMWs) do not travel well through buildings and they tend to be absorbed by rain and plants...\n\nThese 5G towers will probably be about 4 feet tall as opposed to the usual 90 feet towers currently erected around us\n\nmost 5G studies are misleading because they do not pulse the waves. This is important because research on microwaves already tells us how pulsed waves have more profound biological effects on our body compared to non-pulsed waves. \n\nIt might sound difficult to believe but the 5G frequencies which will soon be blanketing our neighborhoods have been under development for a number of years by defense agencies, including the U.S., Russian and Chinese, as a means of crowd control. The US army uses Millimeter waves in crowd dispersal guns called “Active Denial Systems”\n\nThe International Commission on Non-Ionizing Radiation Protection (ICNIRP) guidelines remain essentially unchanged since 1998, not allowing for the recognition of radio frequency microwave radiation and MMWs as harmful unless there is a heating effect. But a few experts are speaking out, seeing as none of you are experts and are claiming “non-ionizing radiation is harmless” you are citing information from 1998 which is even before  3G was a thing.. \n\n5G is here, this could mean wireless antennas on every lamp post, utility pole, home and business throughout entire neighborhoods, towns and cities.", "created_utc": 1586201104.0, "distinguished": null, "id": "fmm96bt", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t3_fvlm8b", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmm96bt", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmm96bt/"}