{"author": {"comment_karma": 2412, "created_utc": 1375980622.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_auezx/styles/profileIcon_2ackrig6d7y41.jpg?width=256&height=256&crop=256:256,smart&s=a5b03f8ef44d28b3445ccca0a1b4b37834fcad76", "id": "cog9n", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 2653, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_megaboymatt", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_auezx/styles/profileIcon_2ackrig6d7y41.jpg?width=256&height=256&crop=256:256,smart&s=a5b03f8ef44d28b3445ccca0a1b4b37834fcad76", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/megaboymatt", "key_color": "", "name": "t5_auezx", "is_default_banner": true, "url": "/user/megaboymatt/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "megaboymatt"}, "body": "That's quite funny because I feel UK teaching / schools have gone the other way. And I say that as a teacher. Sure parents seem to side much more with their children these days than supporting teachers, and often management can seem to support parents over the staff but the actual exams have gotten tougher than when I sat mine at the end of the 1990s or from when I started teaching around 2010. \n\nThe content we are now expecting our 16 year olds to know was A-level (exams usually at 18) when I did mine, and there is more of it. Likewise our 18 year olds exams now contain degree level content. Further more our government are set in keeping a normal distribution so only expect 40-50% of the population to get good passing grades. Then if that wasn't shitty enough, as a teacher you better make sure your school is in that top 40-50% or your school is not doing a good enough job... So half of all schools also have to be via the very nature of the distribution have to be labelled as failing schools, which results in grade boundaries constantly being pushed higher and higher (our grading system is even set up to allow new higher grades to be brought in) and more and more pressure on teachers and pupils.\n\nI think the problem is not the young but actually my generation and up to and including my grandparents generation where individualism, personal wealth and exceptionalism were promoted. Everyone was allowed a voice and that voice was just as valid as every other even when facts prove it wrong. I know well educated people that genuinely buy into 5G bollocks and other stuff that because of the psuedo scientific way it is presented.\n\nThis then creates the next problem, with the poorer educated - the presentation of these crazy ass flat earth documentaries look good. They are presented as science in a believable fashion. They present 'logical' arguments. And if you don't have a basic grasp of the real science this can become a new truth.\n\nThen we come back to the young. They hear opinions and views at home, then at school - their echo chamber- they repeat views, with their parents as Ultimate authority, hear them repeated back confirming them. But a teacher is not legally allowed to correct any political viewed beliefs etc. As it is an apolitical job, so when we see vaccines and climate changed politicised or factually bad economic and societal policy being repeated we cannot correct without risking disciplinary action.", "created_utc": 1589017184.0, "distinguished": null, "id": "fpzedor", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpyofxf", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpzedor", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpzedor/"}