{"author": {"comment_karma": -66, "created_utc": 1479173910.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FF66AC.png", "id": "12tkew", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": false, "link_karma": 4, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_MyUniqueFlavour", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/MyUniqueFlavour", "key_color": "", "name": "t5_1a0khw", "is_default_banner": true, "url": "/user/MyUniqueFlavour/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "MyUniqueFlavour"}, "body": "How about instead of waving your supposed credentials around you show us some actual studies that demonstrate the safety of 5G in the manner the industry intends to use it. How about we start there?\n\n> In this role I've sat in meetings with FCC engineers and lawyers discussing these very issues, as it is literally their job to deal with RF signal and any impact on public health and regulate it... \n\nMaybe you guys need to be more transparent about your meetings and what you actually discuss so that the public and the scientific community can build some trust in your processes and how you arrive at decisions. Because frankly, i dont think most people trust you in that regard. Especially with such a massive profit motive driving the whole venture.\n\nMoreover, I'm doubtful your job or theirs is to ensure public safety. More likely it's to serve the telco industry's interests. Isn't that the way these things work? I'm sure you've read about Ajit Pai and his efforts to destroy net neutrality. Maybe you need to do some homework on the people who you work with on this issues. Find out whether they're actually interested in public health or if they're just serving corporate big money interests. What do you have to say about that?\n\n> You still have not answered the most basic question I've asked you. \n\nYeah and I'm still waiting for you to answer the simple question about where are the studies on 5G that vet it as being safe at exposure and density levels that the industry intends to use it at?\n\n> If millimeter waves do not contain enough energy to penetrate below the top layers of your skin, which not only RF engineers know, but is experimentally confirmed by the NIH, how is it physically possible for them to alter the chemistry of cells well below those layers (which are mostly dead skin by the way) in any meaningful way? \n\nGreat question. Why don't we get you on Joe Rogan with a couple of other scientists who disagree with you and let you guys debate it for everyone to see? Total transparency. Isn't that what you stand for? If you're serious about public health, then you should take peoples concerns more seriously and not try to down play their concerns but challenge them head-on in a direct/live debate. Are you up for it?", "created_utc": 1587096307.0, "distinguished": null, "id": "fnnn2gc", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fnkxpnc", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnnn2gc", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fnnn2gc/"}