{"author": {"comment_karma": 85056, "created_utc": 1398234969.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_46D160.png", "id": "g9fp8", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 141166, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_tipodecinta", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/tipodecinta", "key_color": "", "name": "t5_ayxkv", "is_default_banner": true, "url": "/user/tipodecinta/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "tipodecinta"}, "body": "> At around 9.30pm on Easter Monday, in the small Dutch town of Almere near Amsterdam, the fire brigade was called to put out a blaze at a large telecoms mast — the second fire of its kind that night in the area.\n> \n> Though neither of the Almere towers were equipped with any of the latest 5G telecoms equipment — in fact one was designed only for use by the emergency services — authorities soon concluded that the fires were perpetrated by vandals acting in the name of an unusual theory: that 5G networks have contributed to the coronavirus pandemic.\n> \n> The Dutch mast fires are just the latest escalation in a series of similar attacks that have swept across the UK and Europe in recent weeks. Having first gained momentum online in early January, the 5G conspiracy theory — which alleges, among other things, that Covid-19 has either been caused by the frequencies used for the new wireless technology, or that those signals impair the human immune system — has spilled rapidly into the offline world.\n> \n> In the UK, where the attacks began, almost 60 masts have been set ablaze to date, while this week two towers were vandalised in Co Donegal in Ireland, and another in Limassol in Cyprus was attacked by 18 people. In the Netherlands, there have so far been 11 recorded attempts — one of which was accompanied by a scrawled piece of graffiti that read “Fuck 5G”.\n> \n> The improbable escalation of the theory — which in the UK has even begun to gain some traction in the mainstream television media — has alarmed European authorities, who are racing to track down the perpetrators of the mast fires and prevent further attacks. Meanwhile it has also raised questions over the origins of the conspiracy and the source of its momentum.\n> \n> “It is a very dangerous situation,” said Rob Bongenaar, a director of Dutch telecoms industry body Monet. “These people are attacking vital infrastructure.”\n> \n> Theories linking telecoms networks to health issues such as cancer and infertility have existed since the 3G era — though few expected they would ever gain mainstream attention.\n> \n> According to Hanna Linderstål, chief executive of the Swedish data company Earhart Business Protection Agency, which tracks online disinformation, the first video directly linking coronavirus to 5G appeared online in early January in the form of a lecture that discussed the influence of electromagnetic radiation on pandemics. “It was really scary to look at,” she said. “You start thinking — should I move to the countryside?”\n> \n> Soon dozens of videos started appearing showing dead birds, dead fish and people fainting in the street — all, according to the videos, the result of 5G. Ms Linderstål tracked 35 of the most popular videos that appeared in January and found that, within weeks, they’d been viewed 12.8m times.\n> \n> Since then, the theory has rapidly gained traction in the offline world. In the UK this week, the head of Vodafone UK issued a statement arguing that lives were being endangered by a “dangerous lie” around 5G, after a mast near Birmingham’s NHS Nightingale coronavirus hospital was vandalised over the Easter weekend.\n> \n> In Holland, meanwhile, authorities have characterised the perpetrators of mast attacks as hooligans engaging in a “European Championship of Mast Burnings”.\n> \n> “This is not just a nuisance, it is much more serious than that,” said Mats Granryd, chief executive of the GSMA trade body. “We cannot let crackpots damage what we have built up.”\n> \n> In an effort to curb the effects of the conspiracy, authorities have been forced to step in to publicly discredit it. The World Health Organisation this month denied any link between the spread of the coronavirus and 5G, while the International Commission on Non-Ionizing Radiation Protection said that 5G signals posed no risk to human health.\n> \n> Piers Corbyn, the brother of former Labour party leader Jeremy Corbyn and a high-profile campaigner against 5G in the UK, dismissed the WHO’s points, arguing that the use of high frequencies could be damaging particles in people’s lungs. “I understand why people are getting angry,” he said of the mast attacks.\n> \n> In the UK, the theories have even seeped onto mainstream television, alarming broadcasters and the regulator Ofcom. During a segment about “fake news” on ITV’s popular daytime show This Morning on Monday, replacement host Eamonn Holmes defended those who did not believe the “state-run narrative” about 5G and coronavirus. The incident prompted Ofcom to immediately announce an inquiry into the programme.\n> \n> ‘People want answers’\n> \n> In response to the 5G conspiracy, social media platforms have reshaped their policies to take action against misinformation on the subject. Earlier this month, YouTube updated its policies to ban all videos that suggest that coronavirus symptoms are caused by 5G. Facebook, too, has decided to remove “false claims linking coronavirus to 5G”.\n> \n> Nevertheless, the measures have not eliminated all conspiracy-related content from these platforms — nor prevented it from springing up elsewhere. On TikTok, which Ms Linderstål said is emerging as a “very powerful tool” for conspiracy theorists targeting younger people, videos can still be found using the search terms “5G” and “coronavirus”.\n> \n> One popular video, which has since been removed by the platform, showed a woman berating a construction worker over how the technology was going to “kill everyone”, while characterising the emergency London coronavirus hospital as a “concentration camp”.\n> \n> When a collection of these videos were shown to TikTok by the FT, the company said it did “not allow misinformation that could harm the community, but added, “we are removing any harmful material of this nature, and we will continue to further strengthen our protective measures in this area”.\n> \n> Meanwhile researchers are racing to assess whether and to what extent efforts to spread the conspiracy theories are co-ordinated. Jonathan Morgan, chief executive of misinformation tracking group Yonder, said that there had been a “concerted effort by the anti-vaccination community” to spread 5G conspiracy theories.\n> \n> But some experts have also pointed to overt propaganda efforts by Russian state media to push such narratives. A recent YouTube video published by RT suggested that children playing near 5G cell towers could suffer cancer, nose bleeds and learning disabilities. Other researchers have raised the possibility of covert state-backed campaigns — though to date, none of the social media platforms have announced concrete evidence of clandestine foreign operations focused on the topic.\n> \n> The theory has also been pushed by so-called “QAnon” conspiracy theorists, who believe there is a secret anti-Trump plot under way by the “deep state”.\n> \n> “It conveniently touches on a deep state, UN-level paranoia because [the rollout of 5G] requires global collaboration,” said Ed Bice, chief executive of non-profit Meedan, which builds digital media verification software.\n> \n> In addition to questions over the source of the conspiracy, another big unknown remains: why it has taken such a dramatic hold in Europe in particular.\n> \n> Ms Linderstål argued that the strict lockdown is likely to be playing a part. “People are really scared but they are also really engaged,” she said. “At a time of crisis, people want answers — and [5G] is a really simple answer.”", "created_utc": 1587020815.0, "distinguished": null, "id": "fnkba2n", "is_submitter": true, "link_id": "t3_g2a2kh", "parent_id": "t3_g2a2kh", "score": 5, "stickied": false, "subreddit_id": "t5_2qhcv", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnkba2n", "collapsed": false, "permalink": "/r/ukpolitics/comments/g2a2kh/how_a_5g_coronavirus_conspiracy_spread_across/fnkba2n/"}