{"author": {"comment_karma": 75800, "created_utc": 1414516359.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_DB0064.png", "id": "j39fv", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 350, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DB0064", "user_is_muted": null, "display_name": "u_AzarinIsard", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_DB0064.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/AzarinIsard", "key_color": "", "name": "t5_ckg2e", "is_default_banner": true, "url": "/user/AzarinIsard/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "AzarinIsard"}, "body": "I guess I'm blessed in that I haven't seen these conspiracy theories in the wild. I don't understand how you'd link a *virus* to *mobile masts*. Is it because Covid-19 started in China and Huawei is controversial because of China...? At least when people blamed it for things like cancer there's a bit of mystery about the illness. This is just fucking stupid.\n\n> “You know when they turn this on, it’s going to kill everyone, and that’s why they’re building the hospitals,” she tells the baffled engineers on a London street. “Do you have children, do you have parents? When they turn that switch on, bye bye momma. Are they paying you well enough to kill people?”\n\n1) If it killed everyone you wouldn't need hospitals. You can't cure death.  \n2) If it was going to kill everyone, wouldn't the Government stop the building of the masts rather than build a hospital?  \n3) Why would they want to use such a novel way of killing everyone when they've got many simpler ways at their disposal? Why would they want to kill everyone? \n\n> Social media posts from celebrities such as singer Anne Marie have helped spread the theory, while Holden, a judge on Britain’s Got Talent, shared a link to a popular Change.org petition promoting the rumour that the symptoms of coronavirus are in reality due to residing near a 5G mast. The petition was subsequently removed following inquiries from the Guardian.\n\n> International radiation experts have repeatedly made clear that the new high-speed telephone system does not pose a risk to humans, while pointing out that the coronavirus has spread widely in many countries without any 5G coverage, such as Iran.\n\nNot only that, but if it was spread by mobile masts you wouldn't get it spreading like wildfire on fucking cruise ships either. It's so nonsensical this is the non-religious equivalent of saying this is God's vengeance for gay marriage. You've just crammed two things you don't like together and people believe it without thinking.\n\nCoincidentally, we all know Covid-19 is actually spread by people playing their shitty music loudly on their phone speakers in public. They're the real problem. If we could institute a death penalty for those then Covid-19 would go away over night.", "created_utc": 1585996443.0, "distinguished": null, "id": "fmeakgi", "is_submitter": false, "link_id": "t3_fulctt", "parent_id": "t3_fulctt", "score": 3, "stickied": false, "subreddit_id": "t5_2qhcv", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmeakgi", "collapsed": false, "permalink": "/r/ukpolitics/comments/fulctt/broadband_engineers_threatened_due_to_5g/fmeakgi/"}