{"author": {"comment_karma": 19, "created_utc": 1443560819.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_DB0064.png", "id": "qtkq7", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 40, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DB0064", "user_is_muted": null, "display_name": "u_stumpdII", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_DB0064.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/stumpdII", "key_color": "", "name": "t5_1if71p", "is_default_banner": true, "url": "/user/stumpdII/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "stumpdII"}, "body": "decline of the western world by political choice.. china is rising  capitalism is self destructing.  usa should release 5g tech from (exclusive military use) so like some past darpa projects it benefits the nation and the world instead of the military niche..   china or America can lead.. it's nuts to hand the future to china in the race to the future.  capitalists tend to be happy if they are making a pile of profits with little expense.. so motivation for change is not there till the financial incentive is there.. by then it will be too late.. china will be DOMINATING market share.. America really lost out when it let those who lead our future to be influenced by profits instead of wisdom.  china is almost a cashless credit card less society.. everything paid for by phone.  they even have a flying car.. their high speed rail put America to shame.. i hate that 'm to witness the decline of my country due to greed and corruption.  Also the magic rise of S Korea from poorest nation on the planet to an economic superpower was govt propping things up.. like china is doing now..  our govt does not move or react unless some politician gets bribed.  there are no national goals such as the Apollo program. .there is no vision for the future and govt objectives.. cus it would cut into some private profits somewhere.. or upset the apple cart.  American corporations who could take 5g tech and run with it are so burdened with debt from buying each other out they can't afford to deploy 5g.. and since collectively they are a monopoly  they really don't give a crap.  all they have to do to bar competition is ban china..   that's not going to work out well in the future.. my god my govt is lacking leaders and visionarys!  USA govt is so tightly controlled by corporations there will be no more apollo programs, hoover dams, internet's  or anything as epic as them because moving beyond current profit methods would be unacceptable to those raking in the profits at the expense of us all.", "created_utc": 1586526437.0, "distinguished": null, "id": "fmzp2nw", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t3_fyaf2j", "score": 4, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586527007.0, "name": "t1_fmzp2nw", "collapsed": false, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fmzp2nw/"}