{"author": {"comment_karma": 1987, "created_utc": 1585428900.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_A06A42.png", "id": "625ccidh", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 37, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_howtooc", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/howtooc", "key_color": "", "name": "t5_2j0032", "is_default_banner": true, "url": "/user/howtooc/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "howtooc"}, "body": "I agree that people are morons.  And they're easily misled.\n\nIf you want proof, look at Libya with Gadaffi.  America literally overthrew a country with nothing more than money, and a few dozen special forces to help direct the \"morons\" to overthrow their own country's government(ironically because Gadaffi was trying to put his citizens' interests before US interests).  \n\nAmerica, Russia, and China all try to weaken the other country with propaganda.  And in specialized cases, they try to create specific movements that are against the enemy country's interests(or domestically create movements that are helpful to their own interests).\n\nYou have to see it like China/Russia/USA sees it.  What are the odds that China, Russia, or USA get invaded, and overthrown?  Near 0.  It would cause nuclear holocaust.  The ONLY way one of these nations will ever fall is from within.  The best example of this is the Soviet Union.  The biggest threat to a modern empire like Russia, USA, China is civil war, or a lack of cohesiveness.  All sides know this.  That's why Russia and China are trying to near completely disconnect from western internet.  They don't do it for fun.  They do it because they fear American Propaganda more than American nuclear warheads(something the Soviets didn't realize until it was too late).  Same with Gadaffi... he was so scared of American weapons that he didn't realize it wasn't the weapons he should fear... it was the CIA and propaganda that was his undoing.  It's honestly even similar with Saddam Hussein.  While that is a case where US weapons were his downfall... the American CIA had basically defeated his country before the first shots were fired... getting much of the military and government to defect right as the invasion started.\n\nPeople are morons, I agree.  And I can certainly understand why you think the way you do...  but, it's because you don't realize that guns and bombs have been replaced by propaganda and ideas as the most important weapons in the global theater.  \n\nPeople may be morons, but they have a whole hell of a lot of power.  What defeated America in Vietnam?  Was it bombs?  Was it bullets?  Was it soldiers?  No.  It was massive protests at home which caused America to need to retreat.  I think many people underestimate the significance of the power of citizenry, just because the citizenry themselves aren't intelligent/knowledgeable.  Think of \"the people\" as a bunch of idiots with blank slates, just WAITING for someone smart enough to tell them what to think.  China, Russia, America fear these idiots with blank slates in their own countries(their own citizens) more than they do armed forces of enemy nations.  Citizens' democratic power is small, even in a psuedo democracy like America.  Their real power(which exists in all nations) is the ability to violently rise up and destroy society/overthrow the government.  For a nation like China... this is by far their biggest fear, and the only real way they can imagine losing control of the country.  And, it's the same case for most nuclear powers, and even powerful non-nuclear powers like Saudi Arabia.", "created_utc": 1587310743.0, "distinguished": null, "id": "fnw3lcn", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnvg6bu", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587312551.0, "name": "t1_fnw3lcn", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnw3lcn/"}