{"author": {"comment_karma": 19287, "created_utc": 1346721346.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "id": "8w7cb", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1357, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_The_ChosenOne", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/The_ChosenOne", "key_color": "", "name": "t5_dqjtg", "is_default_banner": true, "url": "/user/The_ChosenOne/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "The_ChosenOne"}, "body": "Technically the Manhattan project, MK ultra, early forms of eugenics in America were all conspiracy theories proved right. While the vast majority of mainstream conspiracy is absurdly anti-science, any form of conspiratorial thinking is a conspiracy theory and many throughout history have been proven right. \n\nConspiratorial thinking kept many rulers alive, we wouldn’t have had royal wine tasters or assassinations without conspiracies. \n\nThe modern idea of a conspiracy theory is more similar to the whole “fake news” bullshit we have going around now\n\nIt became a tactic for the government to call things conspiracy theories to make light of the issue some time ago, and since then fake news has also come around as a new version of this.\n\n If you ask a trump supporter they’d say global warming is a conspiracy theory. The truth of the matter is the modern mainstream conspiracy theories are the exact cover that politicians rely on when trying to misdirect.\n\nTake Epstein’s suicide, saying his death was anything other than a classic imprisoned person hanging themself is technically a conspiracy theory. Yes, flat earth, a fake moon landing, vaccines causing autism etc are also conspiracy theories but they are all wacky and anti science. Notice how lumping something in with those notions might discredit it? I wrote a thesis on the biases, fallacies and psychology that leads to conspiratorial thinking and it’s actually not as dissimilar from thinking that leads to real revelations as you might think. Sadly most people now think only wacky crazy ideas are conspiracy theories which is exactly the point of branding things conspiracies in the first place. \n\nThe reason people think there are aliens in Area 51 started in Roswell New Mexico when the Air Force announced they’d acquired a flying saucer rather than admitting to project MOGUL which was an ongoing operation at the time. Now back then it would be a conspiracy theory to believe that the government would lie to hide their own project but... here we are with that information all public now. \n\nMy point is not to believe bullshit without scientific backing like vaccines causing autism, or lizard people or moon landing being faked. My point is that don’t dismiss something by virtue of conspiratorial thinking, be smart, look for sources, scientific papers and studies then form an opinion. Fact check everything", "created_utc": 1586141873.0, "distinguished": null, "id": "fmk0upi", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmih2n1", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmk0upi", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmk0upi/"}