{"author": {"comment_karma": 276, "created_utc": 1390314536.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_25B79F.png", "id": "ewqmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 62, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_Nolnol7", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Nolnol7", "key_color": "", "name": "t5_e1zkb", "is_default_banner": true, "url": "/user/Nolnol7/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Nolnol7"}, "body": "I can't actually believe that I've spent my entire day gathering sources to prove how full of shit these people are but here you go!\n\nSo [here](https://openjur.de/u/892340.html) we have the actual court document on this case, unfortunately this is in german, but luckily enough I'm fluent in German so I try to translate the important parts as well as I can!\n\nLet's look at paragraphs 10-13: The entire premise of this ruling is whether Lanka had to pay the bounty he set out or not. Specifically look at paragraph at 12 which translates to\n\n>The price money will be paid out, if a scientific publication is presented, in which the existence of the measle virus is not only claimed, but also proven and it's diameter is determined amongst others.\n\nNow let's look at what else matters, which is paragraph 28 and 29, which specifies that the proof has to come from the Robert-Koch-Institut (in paragraph 28) AND that the proof of the virus' existence and its diameter is given in ONE single publication and not as a combination of several publications.\n\nHe is furthermore asking for photograph proofs of the virus and wouldn't accept models and what not. This is why the court did rule in his favor to NOT PAY OUT THE MONEY because  what Lanka had asked for was technically not provided by the doctor that took him to court into first place. Furthermore the court specifies in paragraph 84 that Lanka's price money was part of his anti-vaxx campaign, as he is not actually interested in being proven wrong on the nonexistence of the measles virus. \n\nThere ya go, that's Lanka for you.\n\nLet's continue with Hamer and let's start with his anti-semitism. You don't need any Wikipedia or MSM articles to find his open letters, statements and so on. The key point of it all is only one thing: the new german medicine is the only truth, jews know and use it, but are using it only on their jewish patients and use regular school medicine to genocide all non-jews. The entire premise of him critizing jews is only presenting them as this evil organisation. If it were true that jews were using this absolutely stunning practice that cures everybody of cancer, I wonder why statistics in Israel in regards to cancer deaths and cancer recoveries are not supporting any of his claims.\n\n There is zero, and I repeat, zero evidence that anybody used his perverted practices besides him and the cult that built itself around him, made up of primarily altright anti-semites that still exist to this day.\n\nI can't find anything relating to this amazing 92% recovery rates and sounds like the typical alternative snakeoil bogus claims that they'll have on their websites and forums without, yet again, verifiable proof. So much of his stuff doesn't even remotely make sense from any point of view, or do you actually think it's agreeable that the best course of action to treat cancer is essentially doing nothing since it is \"part of the process to resolve your trauma and healing\". \n\nThe reason why I said that it is complex is because PCR can be simplified, but to understand fully still would need to dive deeper and I didn't feel like writing a PCR lecture here for people that won't have their minds changed no matter what. \n\nThat's it from me, make what you will from what I've posted here. Lanka and Hamer are/were lunatics spreading potentially dangerous misinformation, Andrew Kaufman is in my opinion a vulture that is trying to capitalize on this conspiracy business.", "created_utc": 1586434369.0, "distinguished": null, "id": "fmvxq71", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t1_fmvpuqc", "score": -1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmvxq71", "collapsed": false, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmvxq71/"}