{"author": {"comment_karma": 23011, "created_utc": 1308752714.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_0079D3.png", "id": "5etm1", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 296, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#0079D3", "user_is_muted": null, "display_name": "u_x3r0h0ur", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_0079D3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/x3r0h0ur", "key_color": "", "name": "t5_baz8p", "is_default_banner": true, "url": "/user/x3r0h0ur/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "x3r0h0ur"}, "body": ">No it will not. This is the exact kind of propaganda that communist states rely on....\n\nThis whole diatribe is based on an all or nothing mentality and assumes a literal binary choice, and relies on using only examples happening now.  Historically humans are collective animals, all of our greatest achievements came from collaboration.  The idea isn't full hivemind like Asian cultures tend towards, but also not \"fuck you, got mine\" that permeates the US since the 80s is destructive to individuals because rights mean nothing if you don't have access to use them.\n\n>Constant growth is what has driven the technological progress of the 21st century. Yes we have limited resources, but that doesn't make growth bad. It means there are more challenges to be overcome. But growth is still and will always be the goal. \nYou build this in like it's a known factor, and again, an absolute.  That which provides the best outcome should always be the most important thing.  At some point we WILL need to stop looking at what produces the most and start looking at how to provide better outcomes.  It just happens that through industrialization and past it's end producing vast amounts of things was the best way to get the quality of life to go up for everyone.  Now we put in tons of effort and resources and the vast amount of it goes to the very few, while a large part of the population doesn't see much improvement.  This will eventually tip a different way.\n\n>It isn't. And multiple attempts to implement it have given us enough reason to know by now. And the inverse applies to capitalism. We know it does work by now. \n\nI'm not saying it will look like anything we've tried before, nor anything the historical writers have proposed.  My point is it will grow out of capitalism's final step, and it probably won't even be called communism.  That's a limit of vocabulary and language....it's just what is currently available to describe whatever is next.  If you don't want to call it communism because the USSR fucked that up for you, fine.  If we attain the ability to farm other planets resources without expanding our population to a whole other planets worth of people, the abundance should push us past scarcity so far that money becomes unecessary.  I never meant to say this will happen soon, but the problems of neoliberalism continue to show up every couple of years.\n\n>What a stupid statement. Of course nobody did. This is a meaningless non sequiteur designed to direct the reader to you're preferred conclusion. Even if capitalism doesn't last forever, that in no way implies that communism is a comparable alternative. You're merely trying to make it appear valid by default. And that's the wrong way to reason. No wonder you believe in non sense if comments like this are convincing to you.\n\nThis shows that you're only assuming that what I mean is USSR style society, I'm just speaking about what's next but you're not engaging honestly with me, you just want to assume that I'm pushing for totalitarianism or state capitalism", "created_utc": 1586617901.0, "distinguished": null, "id": "fn3ck3n", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t1_fn2i5uq", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fn3ck3n", "collapsed": false, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fn3ck3n/"}