{"author": {"comment_karma": 1185, "created_utc": 1502440220.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_DDBD37.png", "id": "85gufm0", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 1407, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_LizVSLiz", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/LizVSLiz", "key_color": "", "name": "t5_7m2sh", "is_default_banner": true, "url": "/user/LizVSLiz/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "LizVSLiz"}, "body": "Right, I know.  If you want to take the time to explain things to them right now, I completely respect that.  They have to be answered or they'll be the only voices.  We have serious problems right now caused by our current levels of radiation.  We just don't understand this, we're not trying to understand it and people who could do something about it are mocking anyone who brings it up.  \n\nNot to be to depressing but take for example the suicide rates among teenagers and younger kids, I remember seeing a statistic like a 400% rise in suicide rates among young girls.  That's why I picked this but suicide rates are high across the board.\n\nhttps://www.forbes.com/sites/robertglatter/2019/05/20/suicide-rates-sharply-increase-among-young-girls-study-finds/#227d648e6b20\n\nNow see this peer reviewed research on some of the effects of microwave radiation, it's a trove of knowledge\n\nhttps://www.sciencedirect.com/science/article/pii/S1383574218300991\n\nExerpt: The number of studies showing adverse effects on living organisms induced by different types of man-made Electromagnetic Fields (EMFs) has increased tremendously. Hundreds of peer reviewed published studies show a variety of effects, the most important being DNA damage which is linked to cancer, neurodegenerative diseases, reproductive declines etc. Those studies that are far more effective in showing effects employ real-life Mobile Telephony (MT) exposures emitted by commercially available mobile phones. **\n\nneurodegenerative diseases: https://www.sciencedirect.com/topics/pharmacology-toxicology-and-pharmaceutical-science/degenerative-disease\n\nExerpt: Recommendations for management of the psychosocial symptoms associated with neurodegenerative diseases, such as mood disorders, a desire to hasten death, and desire-to-die statements, include the following:\n\nRoutinely screen for mood disorders and treat accordingly.\nScreening for depression and anxiety is not an adequate screen for a desire for hastened death.\nExplicit conversations regarding a desire to hasten death are necessary.\nTeam members must be prepared to respond to a desire-to-die statement.\nBe aware that a desire-to-die statement may not represent a desire to hasten death.\nRemember that desire for hastened death may fluctuate over time and may often not extend to an actual desire for suicide or euthanasia.  **\n\nThis may seem like a random connection, but they're all over.  Many many people suffer from chronic diseases or conditions, and they don't know what's going on.  You can look in that second science direct article just to get a glimpse of what we don't even know, but it's easily prevented if this is the cause.  Anyway, it's important to me, many people including children live in hopelessness and chronic pain because of these effects.  I might not be able to prove it myself, but I think I should be permitted to raise the question.  Some people will never learn this, and refuse to learn it, that can't be helped. Anyway I'm sorry to write a book I tried to make it skim-able.  It would be to depressing to look at if it were hopeless, but it's possible - not saying for sure, but it might be possible that the cure could be the flip of a switch.  Anyway, good luck to you, have a good one", "created_utc": 1587159813.0, "distinguished": null, "id": "fnq8o5q", "is_submitter": false, "link_id": "t3_g2vsuj", "parent_id": "t1_fnq0ibe", "score": 2, "stickied": false, "subreddit_id": "t5_3neie", "downs": 0, "total_awards_received": 0, "edited": 1587160591.0, "name": "t1_fnq8o5q", "collapsed": false, "permalink": "/r/conspiracyundone/comments/g2vsuj/over_50_cell_towers_vandalized_in_uk_due_to_5g/fnq8o5q/"}