{"author": {"comment_karma": 11430, "created_utc": 1339192940.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_545452.png", "id": "7xui1", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 6027, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_MrMac94", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/MrMac94", "key_color": "", "name": "t5_d1nq0", "is_default_banner": true, "url": "/user/MrMac94/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "MrMac94"}, "body": "Holy shit that \"article\" and site are absolute trash. \n\n&#x200B;\n\nIt claims that no level of electromagnetic fields are safe, referencing its own site as a source, while then going on to make a point that the earth has its own and that one is ok, that 'natural' emf is ok but artificial ones are ok without citing sources. \n\n&#x200B;\n\nIt claims that because we dont have evidence that is isn't unsafe that therefore its dangerous. Disproving a negative isn't how science or logical though works. I could say that there are cows on mars, and that because we haven't 100% disproved that statement, which is impossible, that I may be right and therefore there are cows on mars. \n\n&#x200B;\n\nIt states that EMF is a Class 2B carcinogen; while citing a source that states that there is no evidence for the claim that EMF is dangerous. But the site goes a step further by either misleading or not understanding that Class 2B is \" agents for which there is limited evidence of carcinogenicity in humans and less than sufficient evidence of carcinogenicity in experimental animals \". That quote is literally from the same document the site is sourcing from.\n\n&#x200B;\n\nThen the site claims that EMF is a genotoxin, stating it can destroy your DNA. The source it \"cites\" is an article saying that although 5G isn't ionizing, that it could heat your skin a small amount. The article then shows a picture of someones face in IR to show heat before and after a 30min phone call and blames EMF for the heating that is observed, without acknowledging that simply holding something up to your face that would prevent heat from leaving would heat up your skin, or the natural heat the phone makes when it operates. Its trying to say that because it could heat your skin its dangerous and that if you increase the energy to insanely high levels, that it could damage cells by cooking them. Like yea no shit. Visible light is safe but if I stand directly in front of a 50,000 lumen spot light of course its going to burn me. The 'article' then goes on to say that because there isn't enough evidence to disprove that it isn't safe that therefore its dangerous. So that same logical fallacy comes up again. \n\n&#x200B;\n\nThe site then claims that there is clear evidence that \" exposure to cell phone radiation increased the incidence of cancer and genetic damage in mice\" linking to a paper that actually did show evidence of of that claim. But with an important Caveat, that all the mice reviving radiation doses were given so much it was physically heating them. The paper repeatedly references the heating. The paper also references other papers stating \" genotoxicity of various frequencies and modulations of RFR, covering experimental systems ranging broadly from cell-free DNA preparations to cells of exposed animals and humans, have concluded that evidence for cell phone RFR-associated genotoxicity is inconsistent and weak \". After scouring the paper for about 30 minutes I could not find where they state the dosage of radiation, which by inclusion of the heating, leads me to believe they were using extremely high doses. So like of course, if you stick a mouse in what is essentially a lower power microwave but with a frequency of 900mhz for 10 hours a day of course its going to mess with the body of the animal. The number 900mhz, which is the frequency used, is also ridiculous because thats no where near the frequency range used. 5G uses between 24GHz and 100Ghz. 900mhz is over 1000 times lower 100Ghz. 1000 times. That study has absolutely no bearing on 5g and its inclusion as evidence is misleading. \n\n&#x200B;\n\nThe site then goes on to say \" human sweat ducts act as an array of tiny, helix-shaped antennas when exposed to millimeter waves\" and links to an actually very interesting paper on the topic. The paper does say that the skin is more conductive to EMF in when you sweat, which is actually really neat. Now what its not saying is that the skin absorbs more EMF, its saying its reflecting back more EMF. Which has some pretty neat medical applications. The site then claims  \"The findings suggest that human skin not only absorbs but actually amplifies the radiation from millimeter wave networks.\" which is absolutely not at all what the paper says, and in fact would say the opposite. That skin actually reflects a lot of EMF. The claim that skin amplify EMF isn't in the paper and doesn't have a source. \n\n&#x200B;\n\nThe site then links to itself for an \"article\" that claims that EMF can cause infertility. The article repeatedly sources itself or other sites that do not reference papers. The only few links that were actually referencing papers were about what Testosterone is. The \"article\" then tries to sell you EMF blocking products while several of the links that reference back it its own site try to sell you testosterone and erectile dysfunction products. So with this claim they listed no sources, contradicted a previous study they referenced before about the mice where they did not find any change in the fertility rates of mice, and then tried to sell you things. Really hitting it out of the fucking park with that one.\n\n&#x200B;\n\nThe site then references an \"article\" by a Dr. Cindy Russel in a magazine which is kind of meh. It makes a lot of claims about past studies that claim to show the possibility of there being dangers. It has a link that I could go to where I could go through every study and look at how it was presented in the article. But honestly that would just take way too much time and effort. Plus by this point we know what the answer to that will be. \n\n&#x200B;\n\nThe site then states that there are \" eight pathophysiological effects caused by exposure to non-thermal levels of EMF radiation \". The document, I wont even give it the respect of calling it a study or paper, is a rambling opinion piece disguised as a research paper. Its just poorly referencing other papers, often times subtracting from the point its trying to make. While littering in government conspiracies and blatant misrepresentations of what other studies were getting at. \n\n&#x200B;\n\nIm going to skip down a bit\n\n&#x200B;\n\nThe site then makes the conspiracy theory that because the military made what essentially equates to a very very bight flashlight that can heat skin, that 5G is dangerous. We see this heat thing again and again in different forms don't we. If you didn't know, all EMF is light that we cant see. You go to a frequency lower than 5G by a lot you get radio, you go up by a shit ton you get visible light. Like if people are afraid of 90Ghz because its higher than 40Ghz, then people should be loosing their fucking minds over 770THz, which is over 8000 times higher, and is also the upper end of visible light. People are afraid of cellphones but not the color Red like come the fuck on. Mini rant over. Something to note, in the photo they use to explain the military application, the photo states it only penetrates 1/64 of an inch into the skin. So how are the claims made that 5G can some how enter the body and damage organs?\n\n&#x200B;\n\nI'm only half way though this absolute abortion of this web page and I can't go on. But let me conclude by asking a question. Can you guess the final thing the web page talks about? Right at the very bottom. Did you guess it was trying to sell you ways to reduce exposure to EMF? This whole fucking thing is one giant attempt to sell you FUCKING EMF BLOCKERS FOR YOUR PHONE THAT THEY MAKE. Like holy hell. This is the most refined Alex Jones style marketing I have ever seen. Its a giant farce. \n\n&#x200B;\n\nTLDR; Site is a thinly veiled attempt to sell you phone cases using deliberately misleading the results of some scientific studies, a lot of opinion pieces, and repeated self referencing.  ShieldYourBody is a brand akin to Alex Jones and every other scam that invents a problem to sell you their fix for. The site is littered with garbage products and is first and foremost a store.", "created_utc": 1587232338.0, "distinguished": null, "id": "fnt0llt", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnspa60", "score": 27, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnt0llt", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnt0llt/"}