{"author": {"comment_karma": 462, "created_utc": 1301785927.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_545452.png", "id": "51t4t", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 715, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_ewade", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ewade", "key_color": "", "name": "t5_btaas", "is_default_banner": true, "url": "/user/ewade/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ewade"}, "body": "Haha fine, disregard the Sun example.\n\nNow do you want to address the Oxygen example? All we need is one example where a strong concentration of something will damage you and a weaker concentration won't and your argument doesn't stand anymore. I know that you are smart enough to think of other examples than the sun yourself, I know you are smart enough to know that attacking what I said about the Sun is not the same as addressing the Oxygen argument which makes the same point and is correct. \n\nI think maybe you attacked what I said about the Sun because you couldn't say anything about the Oxygen example, and with the Oxygen example being correct your argument that something that can cause damage at high concentration must therefore be dangerous at a low concentration too.\n\nBecause I think you might come back and spout some bullshit like 'well actually Oxygen does damage your cells in some way so breathing really is damaging'' because I think you're intellectually dishonest and instead of challenging the strongest argument against your point you are choosing to argue against something I said that, even if it is false, doesn't matter as I have a stronger argument that isn't false with my Oxygen example. Anyway just to try and stop you weaselling out again here are a few more examples:\n\nWater - drink too much in one go and die, drink it every day in low doses and you're fine, it's actually sort of a necessity you consume this thing in low doses every day even though a high dose in one sitting can cause death\n\nFood - Same as above, high concentrations of some food can cause health issues, low-normal concentrations of food can be eaten daily without negative affect\n\n3 story buildings - go from top to bottom in one big step? Splat. Take it in small increments over a longer time (stairs), you're fine.\n\nThat took me all of 3 minutes to think of several examples, I could keep going. I know you could have thought of those yourself so why didn't you address those instead of continuing to talk about the Sun?\n\nOh and finally, I think you are actually still wrong about the Sun to be honest. Here is a list of cities by UV index\nhttps://www.who.int/uv/intersunprogramme/activities/uv_index/en/index3.html\nand here is a list of how different UV numbers affect different populations (white/brown/black) \nhttps://www.weatheronline.co.uk/weather/maps/forecastmaps?LANG=en&UP=0&R=0&MORE=1&CONT=aris&MAPS=uvin&LAND=AC&LOOP=0&TEXT=uvindex&R=0\n\nSo we can see that St Peters-burg in Russia stays at a UV rating of 5 or lower throughout the year, we can see from the second link that a score of 5 is 'low risk' for naturally Brown people and it is 'No risk' for naturally Black people. St Peters-burg is roughly the same latitude as London by the way, it is only about 5-10 degrees further north. So it seems that everything that is about 55-60 degrees north and higher or 55-60 degrees south and lower. Therefore there are countries where people can stay outside the entire year and not be damaged by the UV rays.\n\nSo yeah even attacking the weakest argument you could didn't really work because my point still stands, just cause a high dose of UV/Sun in one go CAN be damaging, it doesn't mean that lower levels of it throughout the year MUST also be damaging, as there are people that could be in the sun all year in St Peters-burg and not face any risk...\n\nSo I guess I will ask you; Why DO people offer their opinion when they know absolutely nothing about a subject? I suppose that is, like the rest of this argument, beyond you\n\nEDIT: I literally cannot wait to see your reply to this (if you even respond). Maybe show some humility, I wasn't offensive to you at all in my first post and you hit back with calling me stupid and it turns out you are still wrong!!! Now you have to either admit that, be a big man and apologise for resorting to insults and getting your facts wrong, or double down somehow. Looking forward to your decision. Based on your last post I expect you to come back at me this time by saying something like 'Actually you can jump from a three story building and land without injuries if you roll correctly' as if that somehow invalidates my argument", "created_utc": 1586162702.0, "distinguished": null, "id": "fmkorvz", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmkmj9q", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586163128.0, "name": "t1_fmkorvz", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmkorvz/"}