{"author": {"comment_karma": 3586, "created_utc": 1561661798.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_46D160.png", "id": "410sis17", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 368, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_DoYouTasteMetal", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/DoYouTasteMetal", "key_color": "", "name": "t5_17caxq", "is_default_banner": true, "url": "/user/DoYouTasteMetal/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "DoYouTasteMetal"}, "body": "It goes deeper than stupidity, into dishonesty.\n\nWhen we aren't sufficiently taught the value of self honesty, we don't base our values on our reasoned understanding of reality, we base them on our feelings. Our feelings are like drug effects we give to our selves, and so by using our feelings in place of conscience we can self validate any stupid idea or belief we want, and feel better for it rather than worse. At least, this is the common perception of people who use this method to cheat themselves into what we're calling ignorance and stupidity.\n\nThat false feeling of intellectual superiority such people crave from choosing to believe they have special knowledge is an endogenous drug addiction, and they use this addiction to enable the dishonesty involved in creating and adhering to such obviously false worldviews. It's usually accompanied by depression, which in this case would readily be explained by the conflict with one's own conscience while in the thrall of such an addiction. Resolving the false beliefs by learning to accept whatever aspects of existence they played surrogate for would alleviate the depression.\n\nThis is an extreme example of something we all suffer. We use denial in trying to cope with most aspects of our lives. We dehumanize ourselves and each other, we refuse to think about real ongoing suffering of people and animal life because we don't find the scales of that suffering appealing.\n\nWe created our climate crisis through several generations of dishonestly telling ourselves and each other that our individual actions don't matter, and that our collective ventures couldn't harm the planet as a whole.\n\nIt all relates. It all traces back and down to a core capacity for dishonesty that we abuse because we simply do not want to accept the responsibility of being sapient enough to choose to think or act out in any way we can imagine, any time. Rather than accept it, own it, and grow beyond it, we most commonly choose to act out even more dishonestly, seeking more extreme forms of denial, like flat Earthers, or antivaxxers, or incels, for that matter. Weird sexual repression and denial with them, but it's certainly extreme enough for inclusion. The pressures of our climate crisis exacerbate these issues for everybody, as there is a gradually growing acceptance of how poor our species prognosis has become.\n\nThe fraction of us who can see these things, and readily recognize them for what they are, we're the slim minority who will be slaughtered by the ignorant masses as soon as the food runs out. It makes it all seem rather pointless, but it's vanity to think there must be a point.", "created_utc": 1588901041.0, "distinguished": null, "id": "fptyta9", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpte3bo", "score": 7, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fptyta9", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fptyta9/"}