{"author": {"comment_karma": 263, "created_utc": 1534902742.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_FFB000.png", "id": "1v30b3bt", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 232, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FFB000", "user_is_muted": null, "display_name": "u_7sevenheaven", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_FFB000.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/7sevenheaven", "key_color": "", "name": "t5_nj6uv", "is_default_banner": true, "url": "/user/7sevenheaven/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "7sevenheaven"}, "body": "Okay so where do I start with this, warning, long post.  \nFirst of all I feel sorry for your mom, because my dad is much the same way where he believes everyone on the internet is telling the truth and knows what they are talking about just because they have similar world views.  \n\n\nhard facts argument approach:   \nso first of all, if a frequency of electromagnetic radiation, which was bombarding all of your cells, at once could cause the symptoms of coronavirus, some country would have used it as a warefare tactic by now.   \nArgument to be put up: but our lungs are different cell types from other parts of our body thats why stuff like our skin eyes or stomach doesn't get disesased too!   \nwell alveoli are composed of simple squamous epithelium, where else can these cell types be found? in ever single capillary of your body, in the glomeruli of your kidneys, so why dont we see circulatory and renal failure with coronavirus too?  This is where it doesn't seem to make sense. Now thats as if 5g is causing it on its own without the aluminum part  \nWith the aluminum part, while aluminum dust has been shown to rarely cause lung disease, aluminum particulate in atmosphere, which is what your mom is talking about, is too small to cause deposition in the lungs and this where the toxicological pathway of aluminum takes place in the kidneys and brain, causing damage. Again, coronavirus doesn't cause these issues. Aluminum particulate toxicity happen as much today with modern environmental pollution protocols, and is only seen with high risk areas Locally.   \nThirdly, as far as I am aware, there are no room tempurature vapor forms of aluminum compounds. For 5G to knock something out of the air, that suggests that 5G's energy causes an atmospheric vapour compound to break apart into its constituent parts. or to excite another compound to steal atoms that the aluminum might be paired with so that particulate aluminum could fall out of the sky, but considering what we know about ozone and chlorofluoro carbons, this theoretical concept would have discovered and talked about by now too, at the implication of upgrading to 5g.  \nFourthly the pathogenicity, or, how covid-19 causes disease has been proved by koch's postulates by mice in lab. So therefore, the disease can be nothing but.   \noverall what the guy was saying in the vid your mom watched on surface level to the average consumer should be nonsense, but its even worse if you look at it with a careful eye, abhorrent info.   \n\n\nsoft facts argument approach: when the analytical fails we need to get a little more emotional.   \n5g requires less energy than 4g, so we would have seen issues with 4g by now.  \npeople fear mongered 4g when we went from 3g, nothing bad happened, life goes on.  \n5g issues would not have started in China, but the issue would have been seen parallel in countries across the world. And would have been tracked in every country independently.  \nDont believe everything you read on the internet, you should cross reference the claims others make with other sources and redditors too, and even the claims I am making right now, just because I support your beliefs, you shouldn't take them at face value either, because there is stuff I could have gotten wrong too, should you show this to your mom, but I like to think I have a general approximation of what I am talking about at the very least. But combing through sources on these claims with your mom might help her see that what the guy saying isn't exactly reputable.  \nFinally, when all else fails, dont get frustrated, because if she hasn't changed her mind by now after all the contributors of this thread, then I dont think she will, which others have said.", "created_utc": 1584711514.0, "distinguished": null, "id": "fl0norr", "is_submitter": false, "link_id": "t3_fl9od5", "parent_id": "t3_fl9od5", "score": 1, "stickied": false, "subreddit_id": "t5_2qhn7", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fl0norr", "collapsed": false, "permalink": "/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/fl0norr/"}