{"author": {"comment_karma": 6073, "created_utc": 1517325436.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_FF4500.png", "id": "ul1hv88", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 3684, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_FlickAndSnorty", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/FlickAndSnorty", "key_color": "", "name": "t5_f7ec6", "is_default_banner": true, "url": "/user/FlickAndSnorty/", "banner_size": null, "user_is_moderator": null, "public_description": "If you're reading this, you're probably going through my post and comment history to see if I'm a dick. I'll save you the time, yes I am.", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "FlickAndSnorty"}, "body": "I want to play Devil's advocate here as popular conspiracies tend to spiral out of hand and I'd like to do my part here and offer the counter argument as all conspiracies should have. If anyone has any quesitons, ask away, I'm happy to respond to PM's if you'd prefer!\n\n&#x200B;\n\nTL;DR: harm can be caused by essentially any frequency on the electromagnetic spectrum provided the waves are given sufficient energy. Visible light for instance has a higher frequency than microwaves, but lower than Ultra Violet and yet we aren't harmed by visible light. Ultra Violet light *is* ionizing and is the first ionizing wave on the electromagnetic spectrum. 5G sits below the ionizing frequency by about 6 orders of magnitude.\n\n [https://image.freepik.com/free-vector/electromagnetic-spectrum-infographic-diagram\\_1995-70.jpg](https://image.freepik.com/free-vector/electromagnetic-spectrum-infographic-diagram_1995-70.jpg)\n\n&#x200B;\n\nOkay, so we all know for *certain* that 5G is a new technology that doesn't come close to the relatively lower frequency of 4G or Wifi. home wifi (typically dual band now) sits between 2.4gHz - 5gHz. Mobile phones emit signals around that of 100mHz (0.1gHz). 5G now maxes out at 86gHz. Sounds scary - right? Microwaves follow shortly after at around 100gHz.\n\n&#x200B;\n\nWhere the misinformation now follows is that frequency **does not** **= dangerous.**  If you don't believe me, then believe that infra-red light has a frequency around 100,000gHz. upthe frquency to the next part of the spectrum and you have visible light which ranges between  430–770 tHz (Terra hertz. That's 430,000gHz - 770,000gHz).Visible light radiation doesn't harm you as it's still too low to be ionising.\n\n&#x200B;\n\nFinally, we have a harmful frequency by moving up to Ultra Violet. This is the radiation emitted by the sun which causes skin cancer and actually poses a real threat of being carcinogenic.\n\nAn argument to everything I've just said is that Microwaves can cook food and it's a lower frequency than 5G, so what makes anything above that safe? Well if you had any wave fired at you at a high enough wattage, then yes. You'll literally cook alive. a Typical microwave runs on about 800-1000W.\n\n&#x200B;\n\nTo explain the above better, I'm going off at a tangent:\n\n>Heat isn't a product of frequency, but is instead a product of energy, or more that energy can be transferred into heat. The more energy you give to a bunch of particles, the hotter they will be. That's why burning fossil fuels such as gas is able to heat up water. It is a process of transferring energy. Now, if you filled two identical pots with the same amount of water and put one pot onto a hob at high heat and the other onto a hob at low heat, the high heat pot will (obviously) boil first. That's because you're burning more gas and therefore transferring energy to the water at a higher rate.\n\n&#x200B;\n\nUsing the above example, it's easier to now explain how microwaves being energized by 800W-1000W of power can cook food, but 5G will most likely not cause you any significant harm in the long run as the publicly deployed 5G antennas emit millimeter wave radiation at 250mW (250 milliwatts = 0.25 Watts).\n\n&#x200B;\n\nNow, why have scientists said that millmeter wave raditation can cause harm, given that the above proves that's not case in a practical sense? Well that's because W.H.O have said on their site here:  [https://www.who.int/news-room/q-a-detail/5g-mobile-networks-and-health](https://www.who.int/news-room/q-a-detail/5g-mobile-networks-and-health)\n\nthat:\n\n>To date, and after much research performed, no adverse health effect has been causally linked with exposure to wireless technologies. Health-related conclusions are drawn from studies performed across the entire radio spectrum but, so far, only a few studies have been carried out at the frequencies to be used by 5G.  \n>  \n>Tissue heating is the main mechanism of interaction between radiofrequency fields and the human body. Radiofrequency exposure levels from current technologies result in negligible temperature rise in the human body.  \n>  \n>As the frequency increases, there is less penetration into the body tissues and absorption of the energy becomes more confined to the surface of the body (skin and eye). Provided that the overall exposure remains below international guidelines, no consequences for public health are anticipated.\n\nThis is them saying \"We cannot say with 100% certainty that it is harmless, but provided people aren't stupid with this technology and guidelines are followed, no harm will come to anyone as the waves simply will not penetrate your skin.\"\n\n&#x200B;\n\nThe above is also why the 5G antennas need to be so close to one another (we're talking 2-3 antenna array's every block). They're essentially high frequency wifi routers. most people spend their days sat next a router and feel no worse off for this very reason.\n\n&#x200B;\n\nTo wrap things up, 5G will not expose us to anything more harmful that we already are exposed to with regards to technology. We hold our phones next to our head and stand less than a meter from a metal box that cooks food with Microwaves. If you haven't been harmed yet by such technologies, then you're not going to be harmed by 5G.\n\n&#x200B;\n\nI hope I was clear on this and was able to shed light onto *why* 5G won't be harmful to consumers. Now, I'm not saying that this technology won't be used for other purposes from governments. I'm a firm believer that we are watched too much already and 5G will only further the governments abilities to do so. What I am saying, however, is that you migraines and other ailments are either direct CoVid-19 symptoms and you need to be hosptialised, or you're just not getting any fresh air, not doing as much exercise, not drinking as much water and not eating as much healthy foods as your body is used to. You're experiencing withdrawal from normality, you're not being attacked by ionizing waves (which 5G is not!).\n\n&#x200B;\n\nI don't want any of my examples to be taken as patronizing. If they are, it's not intentional. In a world where almost all mainstream media hides facts behind a haze of misdirection, I'm taking it upon myself to remove any room for confusion.\n\nSources:\n\n[https://www.who.int/news-room/q-a-detail/5g-mobile-networks-and-health](https://www.who.int/news-room/q-a-detail/5g-mobile-networks-and-health) \\- 5G health risks explained by the World Health Organisation\n\n[https://www.youtube.com/watch?v=I8xyUz8UUs4&ab\\_channel=TheInfographicsShow](https://www.youtube.com/watch?v=I8xyUz8UUs4&ab_channel=TheInfographicsShow) \\- 5G explained by a reliable educational channel\n\n[https://www.youtube.com/watch?v=lvhaVjpYm\\_M&ab\\_channel=Techquickie](https://www.youtube.com/watch?v=lvhaVjpYm_M&ab_channel=Techquickie) \\- 5G explained by a technology professional\n\n[https://image.freepik.com/free-vector/electromagnetic-spectrum-infographic-diagram\\_1995-70.jpg](https://image.freepik.com/free-vector/electromagnetic-spectrum-infographic-diagram_1995-70.jpg) \\- Example of the Electromagnetic spectrum (displays wavelength)\n\n[https://anritsu.typepad.com/.a/6a0163040dc8ca970d01bb099ac503970d-popup](https://anritsu.typepad.com/.a/6a0163040dc8ca970d01bb099ac503970d-popup) \\- Example of the Electromagnetic spectrum (displays frequency in Hertz) - To convert the 10^(x) numbers into actual numbers, just type out 10, and then add as many zeros as displayed by the superscript e.g. 10^(8) = 1,000,000,000\n\n[http://www.onlineconversion.com/frequency.htm](http://www.onlineconversion.com/frequency.htm) \\- A tool to convert frequencies from Hertz", "created_utc": 1585959080.0, "distinguished": null, "id": "fmd4ekp", "is_submitter": false, "link_id": "t3_fuczaj", "parent_id": "t3_fuczaj", "score": 17, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": 1585959623.0, "name": "t1_fmd4ekp", "collapsed": false, "permalink": "/r/conspiracy/comments/fuczaj/robert_f_kennedy_jr_posted_this_regarding_5g_and/fmd4ekp/"}