{"author": {"comment_karma": 66172, "created_utc": 1532374112.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_25B79F.png", "id": "1u83dajv", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 5417, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_Roofofcar", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Roofofcar", "key_color": "", "name": "t5_m7jpq", "is_default_banner": true, "url": "/user/Roofofcar/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Roofofcar"}, "body": "No, I’m saying that science hasn’t proven that there is a detrimental effect to human beings with intact skin.  \n\nProving no effect is impossible, and any such proof would be immediately invalidated the moment the most minute thing was added to the equation.  “Well, we know cell phones 100% do NOT kill us.  Ok sorry, we just got an increase of 0.00003ppm of neon in the atmosphere.  We now must prove that it is still safe now that conditions have changed.”\n\nYou can’t prove a negative as the adage goes.  Your position seems dependent on a great number of stakeholders in the largest industries on earth all unknowingly plunging us into ruin.  \n\nI’ve been part of plenty of projects to assess risk for dozens of products.  I’m usually there as the EE sanity check.\n\nIf there is a risk, it will be a liability for a company.  Citizen science is at an all time high.  If there are negative effects, the truth will come out, and the companies who installed it will be liable.  \n\nIf nothing else, trust the inherently litigious American soul to ensure things are all ok.  \n\nOr, learn more about how this works and understand that nearly none of the studies referenced included even an analog of human skin.  Skin is the reason Alpha radiation doesn’t cause nasty genetic mayhem.  If we inhale a dust that is alpha radioactive, the effects are nasty, but it won’t pass through our skin.  \n\nNevertheless, I can point you at hundreds of papers on how Alpha radiation triggers genetic mutation.  In a Petrie dish.  (Or when inhaled, but we don’t inhale 5G masts) The papers are telling the truth, but count on the reader to be able to understand the conditions of the experiment and not irresponsibly draw conclusions that ignore reality.\n\nEdit:\n\nI want to make one term very clear. [Citizen science](https://en.wikipedia.org/wiki/Citizen_science?wprov=sfti1) doesn’t mean “Joe on the internet with a background in accounting reading a blog post about 5G,” but rather means “an increasingly well and cheaply outfitted person with the technical ability to understand the process of science, and can contribute meaningfully to a fact based process.”", "created_utc": 1586146849.0, "distinguished": null, "id": "fmk7war", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t1_fmjqv7e", "score": 7, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586152503.0, "name": "t1_fmk7war", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmk7war/"}