{"author": {"comment_karma": 462, "created_utc": 1301785927.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_545452.png", "id": "51t4t", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 715, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_ewade", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ewade", "key_color": "", "name": "t5_btaas", "is_default_banner": true, "url": "/user/ewade/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ewade"}, "body": "Haha you're a fucking loony. I'm done with this discussion, the fact that you can't understand why the argument you originally made was proven wrong with my analogies is too basic a concept for me to even begin explaining if you can't understand it, I can't teach you all of this from the ground up man! I can't explain the literal concepts of how an argument works, how logic and deduction work etc.\n\n'A smart vaccine will be developed that uses RFID chips, this RFID chip will sit inside you just under the skin.\n\n5G uses sweat ducts like an Arial to receive these signals and is actually able to communicate back and forth with this RFID chip. I can't wait to hear your reaction to this.'\n\nThat is off the wall crazy. Also that isn't what any of the scientists (or at least vast majority) who say 5G is dangerous are claiming, but you are using their claims about it being potentially dangerous because it might potentially, very mildly increase the chances of cancer etc as evidence, but none of them are claiming that 5G is going to be used to communicate back and forth with smart chips implanted in us with a vaccine. So the evidence you gave isn't evidence for your argument, it's evidence for a completely different argument, you are claiming something else.\n\nAlso you linked some studies saying it might be dangerous as evidence for your argument, but there are so many more studies saying it is safe, why do you ignore those scientists? The vast majority of scientists in fact?\n\nI honestly can't believe I am being talked down to by someone that thinks the government is going to smart chip us with vaccines lmao\n\nThere were people like you when radio came out, people like you when TV came out, people like you when Mobile phones came out, people like you when wifi came out, people like you when 2G,3G and 4G came out, there will always be some loony's in the world I guess\n\n\nAlso love that you stopped reading my replies fully because you can't respond to them competently. \nYOU ' IF I DON'T READ IT THEN IT CAN'T BE TRUE!'\n\nAnyway there is a pretty simple way for us to see who is right isn't there?\n\nRemindME! [August 25, 2020, at 4pm] “[Gloat over Moron]”\n\nEDIT: Also, you really should read my whole post above, as if you are trying to do a public service and warn people about 5G it would be helpful if you knew how an analogy worked and didn't try to make your argument with claims that can easily be shown to be not universally true. Like you claimed a high concentrated dose of something was damaging therefore a low continuous dose of that same thing must be damaging. You claimed that as it if were a rule. I gave you several analogies to show that the rule doesn't universally apply. Therefore you can't claim that something that is damaging in a high concentrated dose must be damaging in a low continuous dose because there are plenty of situations where that is not the case, such as the analogies I provided you. There I laid that out as simply as I could step-by-step for you, I believe in you buddy! You can get your head around this if you really try! Don't give up champ!", "created_utc": 1586187081.0, "distinguished": null, "id": "fmlihqk", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmkuc8z", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586187809.0, "name": "t1_fmlihqk", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmlihqk/"}