{"author": {"comment_karma": 628, "created_utc": 1501541685.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_46D160.png", "id": "6e6k8qa", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 61, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_dommina", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/dommina", "key_color": "", "name": "t5_8lza4", "is_default_banner": true, "url": "/user/dommina/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "dommina"}, "body": "the only reasonable explanation that i've come across so far is that the corona tests are really not testing for coronavirus, and they're detecting RNA from our own cells (which we secrete via exosomes). These PCR tests are not the most reliable thing in the world, apparently even the person who invented them backs that up. \n\nThis has been a troubling issue for me as well - people clearly are getting sick...but like you said, even if Wuhan had 5G that was making people ill, how does that explain cases in the rest of the world? \n\nWell, someone could be very sick with respiratory illness or the flu, but the coronavirus tests (which at some point were giving 80% false positives), are saying that it's coronavirus. I watched a presentation on youtube recently of an MD claiming that this virus was never succesfully purified and isolated. \n\nThere are a lot of holes in the theory, but I think we can all agree that there's something off about this whole thing. Who's ever heard of a virus that can be asymptomatic in 20% of people (Fauci is now saying it might be 50%) - and jump from bats, to pangolins, to humans, to TIGERS in a matter of a few months? And for a virus to either not affect someone at all, affect them mildly, severely, or kill them...what are we dealing with here? \n\nIt doesn't add up. I know that what I'm really getting at here is that there is no virus, which sounds insane, but if the tests can't distinguish viral RNA from our own RNA, in exosomes which bind to the same receptor as the virus, look the same (same size), or from another coronavirus, a common thing in humans (we probably all have some corona virus RNA floating around), then that's the only explanation.\n\nTo say 5G causes coronavirus is ridiculous. It could cause illness. There's still a lot that needs to be researched and it is hard to find reliable sources. From the start we were told this was a pneumonia, but most doctors at this point will confirm that patients presenting with corona are not suffering pneumonia, but something that more closely resembles altitude sickness. \n\nWe do need to stop saying \"5G causes coronaVIRUS\" - unless we are willing to say that there is absolutely no virus, and the tests are wrong. A stretch, but who knows. I don't really trust anything I read or hear anymore. I honestly have no idea what coronavirus is or where it came from, all I can say is I don't think it was an accident.", "created_utc": 1586363066.0, "distinguished": null, "id": "fmswg5i", "is_submitter": false, "link_id": "t3_fwvf0s", "parent_id": "t3_fwvf0s", "score": 2, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmswg5i", "collapsed": false, "permalink": "/r/conspiracy/comments/fwvf0s/if_184_countries_have_coronavirus_and_only_five/fmswg5i/"}