{"author": {"comment_karma": 9816, "created_utc": 1378772551.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_7193FF.png", "id": "d2yos", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 12182, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7193FF", "user_is_muted": null, "display_name": "u_iconat20", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_7193FF.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/iconat20", "key_color": "", "name": "t5_end4l", "is_default_banner": true, "url": "/user/iconat20/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "iconat20"}, "body": "You're misunderstanding the concept of proving a negative. From Wikipedia:\n\n>A negative claim is a colloquialism for an affirmative claim that asserts the non-existence or exclusion of something. **Claiming that it is impossible to prove a negative is a pseudologic, because there are many proofs that substantiate negative claims in mathematics, science**, and economics, including Arrow's impossibility theorem. There can be multiple claims within a debate. Nevertheless, whoever makes a claim carries the burden of proof regardless of positive or negative content in the claim. \n\nSo the scientists in Nature have provided proof that local thermal effects are not the only effects of MMW EMF. The burden of proof that these effects are not detrimental should now lie with those who made the regulations of MMW EMF exposure with only those effects in mind.\n\n>your position is hinged on \"we just haven't done enough research yet\" which is a grossly inaccurate misrepresentation of our current knowledge of physics and biology.\n\nIt is not a misrepresentation of our current knowledge. We well understand the effects of most EMF exposure and the risks, however MMW EMF on this large a scale is *not* well understood. The scientific articles I linked clearly said \"... studies are very different and the total number of studies is surprisingly low.\"... \"There is an urgent need for research in the areas of dosimetry, in vivo dose-response studies and the question of non-thermal effects.\"\n\n>If there is a risk, it will be a liability for a company. Citizen science is at an all time high. If there are negative effects, the truth will come out, and the companies who installed it will be liable. \n>\n>If nothing else, trust the inherently litigious American soul to ensure things are all ok.\n\nFor one, the effects may not be immediately known. It may be years before chronic health effects are seen. At which point, the waters will be very muddy. It would be a very long and arduous process to prove the liability of these companies. I don't want to wait until after being exposed for years before things are changed. I want to know before. \n\nSecondly, companies often ignore potential health effects, weighing price of litigation against profits. Prime example of this is cigarettes and cancer, vehicle safety recalls, and certain opiates. They argued for years that cigarettes didn't cause cancer before finally admitting it. They weigh potential cost of lawsuits from car crashes vs cost of recalls when deciding on if they should issue recalls. They argued for years that opiates didn't cause addiction. \n\nI see it as a completely likely scenario that telecom companies saw that studies showed that MMW EMF only caused local heating effects, said no big deal, and went forward with it, investing large amounts of money into the technology and equipment. Now that potentially adverse effects are being shown, and the safety is being questioned, they are afraid of losing money in their investment, and therefore are running a PR campaign to say how safe it is and how great it will be. \n\n>nearly none of the studies referenced included even an analog of human skin. \n\nThis is absolutely false. The article in Nature used human keratinocytes for their testing. From Wikipedia:\n\n>Keratinocytes constitute 90% of the cells of the epidermis, the outermost layer of the skin. \n\nYou go on to use alpha particles as an example of how the skin blocks alpha particle radiation, and how this example applies to MMW EMF. \n\nThis is true. Both are typically blocked by the skin, however they are not directly comparable. The difference is the depth of penetration.\n\nFrom Wikipedia: \"[Alpha particles]... typically penetrate skin about 40 micrometres, equivalent to a few cells deep.\" \n\nFrom the Nature Article: \"MMW are known for their shallow penetration of human tissues (between a few tenth of millimeter to a millimeter)\" aka 100s of micrometers to 1000 micrometers. \n\nThis difference is very relevant, as the outer layer of skin cells is dead and therefore won't be subject to cancer, making alpha radiation relatively safe compared to other types of radiation. However the outer layer of dead skin isn't that thick. From Wikipedia: \"The stratum corneum has a thickness between 10 and 40 μm.\"\n\nTherefore living skin cells can be assumed to be subject to MMW EMF, and your example using alpha particles is not applicable. This also does not address the cornea, which does not have a protective dead skin layer. \n\nThe fact that these are living cells and the penetration is deep enough is cause for concern. From the nature article:\n\n>some general effects of MMW may be initiated by the release of skin-secreted factors into the blood stream or through the stimulation of superficial free nerve endings\n\nMy point still stands. Until further testing on living subjects can be performed, there should be a moratorium on wide scale implementation of 5G technology.", "created_utc": 1586283454.0, "distinguished": null, "id": "fmpmh1b", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t1_fmpdpcw", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmpmh1b", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmpmh1b/"}