{"author": {"comment_karma": 80862, "created_utc": 1542762570.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_4856A3.png", "id": "2mzx2pos", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 399, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#4856A3", "user_is_muted": null, "display_name": "u___my_man__", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_4856A3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/__my_man__", "key_color": "", "name": "t5_rmoc3", "is_default_banner": true, "url": "/user/__my_man__/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "__my_man__"}, "body": "My mom is light conspiracy theorist. She takes a lot a pride in my academic achievements and up to this point I've never been put off by any conspiracy she brings about. \n\nI mean as a healthy skeptic you ought to accept that some shit is a conspiracy. She might come around because she has a lot of respect for my opinion. But I'm over it now lol.\n\nBut everything else you said. It described my bfs childhood best friend to a T. Like this guy goes down these rabbit holes on hyperpartisan networks and acts like everyone else is a moron and uninformed.\n\nI'm at my prospectus stage of my PhD in political science and this dude refuses to have a conversation with me because I am tainted by my liberal education. I'm at a top 20 university and frankly motherfuckers aren't as liberal as you think in this field. Honestly I would never try to change his mind but I would love to have a conversation with him because what a fascinating way to think.\n\nAnother friend of my bf, much smarter, libertarian type could not wait to talk to me. He thought he was gonna have GOTCHA moment by presenting me with data about feminism and police brutality and shit but imo as a budding scholar I am supposed to be dispassionate and interested. By the end of our conversation this guy says hes _surprised_ by how well the conversation went (the only part that offended .e tbh). Anyway that's just to make the point that despite peoples expectations, I dont really go into a conversation with an agenda.\n\nConspiracy dude recently went on a bent about covid19 being a conspiracy _look up event 201!!!!_ Like bro, maybe I'm the nerd equivalent of a boot licker but Bill Gates had been worried about pandemics for years and years. You think because he ran a simulation with global parameters to simulste the outcome of a coronavirus means he has set up the economy to fall? You think you'd fucking know about it if he did?\n\nSometimes these people actually convince me I'm the rube.", "created_utc": 1586145598.0, "distinguished": null, "id": "fmk68l6", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t1_fmk4l15", "score": 19, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmk68l6", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmk68l6/"}