{"author": {"comment_karma": 321, "created_utc": 1462340612.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_DB0064.png", "id": "xoc7q", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 263, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DB0064", "user_is_muted": null, "display_name": "u_StrangeCanadian64", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_DB0064.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/StrangeCanadian64", "key_color": "", "name": "t5_b4fmy", "is_default_banner": true, "url": "/user/StrangeCanadian64/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "StrangeCanadian64"}, "body": ">Being from canada you may have never been to the beach\n\nDamn I think got burned without going to the beach.\n\nMy point was that the general feeling people have about 5G is that \"higher frequency = more bad\". That's true once you get past visible light and enter ionizing radiation. But it's important to remember that as far as non-ionizing radiation goes (and even some ionizing radiation), we've been exposed to everything from microwaves to \"5G waves\" for a long long time from lots of black-body emitters including:\n\n\\- The sun\n\n\\- Campfires\n\n\\- Traditional ovens\n\n>Luckily - light waves don't penetrate the skin very well because of the frequency. So the worst damage you get is on the outer shell\n\nNot necessarily. X-rays are even high frequency than visible light and have an even harder time penetrating the skin, but they're still more than capable of getting all the way through your skin and hitting your bones. All ionizing radiation is higher frequency than light and has a hard time penetrating the skin, but it can still cause damage everywhere given the right dose.\n\n>Now since we know that \\*(4g) 1-5 ghz can pass thru walls pretty well - we also know it passes thru the human body pretty well\n\nAgain, you're sort-of correct. The human body is made of mostly water, your walls are not. 2.5GHz actually has a pretty hard time getting through the human body because it's [absorbed so well by water](https://www.4gon.co.uk/solutions/introduction_to_5ghz.php). One of the reasons wifi moved to 5G was so you wouldn't diminish your wifi signal by standing between your phone and your router (or wrapping your phone in the wet meat sacks that we call hands). 2.5GHz is still very common, and our bodies are absorbing it all the time. It just gets absorbed as a tiny amount of heat though, like a very very very very very faint microwave oven heating you up by such a small amount that you'll never notice.\n\nThe only testing that needs to be done (and has already been done, but it never hurts to do more) is the correct power limitation. More power = more range, so the cell companies are gonna want to push that as much as possible. But thats mostly so 5G signals don't interfere with other electronics (since any radio frequency can induce a current in any wire). That's the main reason why smartphone wireless charging is still limited to just a few mm, so it doesn't go over the set radiation power limits.\n\nOther electronics are far more sensitive to radiation than we are. If you watched HBO's Chernobyl, you'll remember they had to use humans to clear the super radioactive roof because none of their robots could stand the radiation. Obviously that level is also harmful to humans, but it shows that we can withstand a lot more than most electronics. 5G would *probably* start causing your PC to crash before it did any harm to a human", "created_utc": 1586324891.0, "distinguished": null, "id": "fmrj9dh", "is_submitter": false, "link_id": "t3_fwvf0s", "parent_id": "t1_fmrh9hd", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": 1586325328.0, "name": "t1_fmrj9dh", "collapsed": false, "permalink": "/r/conspiracy/comments/fwvf0s/if_184_countries_have_coronavirus_and_only_five/fmrj9dh/"}