{"author": {"comment_karma": 3832, "created_utc": 1573347279.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_FF585B.png", "id": "4zga7wkm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 113, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_MentallyCockeyed", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/MentallyCockeyed", "key_color": "", "name": "t5_2853pe", "is_default_banner": true, "url": "/user/MentallyCockeyed/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "MentallyCockeyed"}, "body": "Lost? How can I lose when all you've said are 5G conspiracy theories and \"your name is dumb\"\n\n\n\n\nSince it's your last reply, I'll happily inform you\n\n\n\n>After many decades of research, it is well established that exposure to radio waves at very high power levels can cause excessive heating of the human body. This can lead to a variety of serious health effects.\n\n\n>In order to protect people from the harmful effects of high power radio waves, ARPANSA has developed a [safety standard](https://www.arpansa.gov.au/regulation-and-licensing/regulatory-publications/radiation-protection-series/codes-and-standards/rps3) that sets limits for exposure to radio waves for the public and workers. These limits are set well below the level at which harm may occur.\n\n>The operating frequencies of the 5G network are included within the limits set by the ARPANSA safety standard. 5G infrastructure and devices emitting radio waves are regulated by the Australian Communications and Media Authority (ACMA), and emissions must comply with the ARPANSA safety standard.\n\n>With the novel coronavirus (COVID-19) pandemic, some members of the public are concerned about the human immune system and whether it can be compromised by wireless telecommunications sources such as 5G.\n\n>The immune system is a complex network of cells, tissues, organs, and the substances they make that helps the human body fight infectious disease caused by invading microorganisms such as viruses and bacteria.\n\n>A number of studies have investigated whether exposure to radio waves can affect the immune system. Some studies have shown that exposure to high power radio waves, much greater than the limits of the ARPANSA safety standard, increases the core body temperature, which can cause temporary effects on the immune system.\n\n>Studies have also investigated whether low level radio wave exposure from telecommunications sources like 5G can impact the immune system. Such studies, including those that have investigated effects on antigens, antibodies and oxidative stress, have not provided evidence of changes in immune function.\n\n>There is no established evidence that low level radio wave exposure from 5G and other wireless telecommunications can affect the immune system or cause any other long term or short term health effects\n\n\nThat's just my country, maybe your country cranked it up differently 😂\n\nDon't fall into conspiracy fear mongering over actual expert opinon, as if the experts don't care if 5G fries peoples immune system.\n\nMaybe toss out your introductionary science certificates and get into civil egineering and/or telecommunications. Because, although my name is mentallycockeyed, and I'm deeply ashamed you pointed it out, people like yourself are the ones pushing dangerous and \"dumb\" nonsense while telling other's they are dumb... It's just pointless. Get an education on the subject.", "created_utc": 1586139033.0, "distinguished": null, "id": "fmjwauu", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmjucvl", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmjwauu", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmjwauu/"}