{"author": {"comment_karma": 744, "created_utc": 1471490222.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_D4E815.png", "id": "10me2x", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 5466, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#D4E815", "user_is_muted": null, "display_name": "u_AndyTheAlphaWizard", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_D4E815.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/AndyTheAlphaWizard", "key_color": "", "name": "t5_e9145", "is_default_banner": true, "url": "/user/AndyTheAlphaWizard/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "AndyTheAlphaWizard"}, "body": "No you aren't miscommunicating the term education. Rather you are looking in the wrong perspective.\n\nInstead of focusing on education, focus on observation.\n\nWhat we really need is people to stop being distracted, and people to observe what is really happening.\n\nA shepard is seen in a field with sheep, but all the sheep knows is to follow the shepard. What if the sheep strays away from the pack? Then the sheep dog will hunt them down and start barking which would create fear in the sheep to go back with the pack. \n\nDo the sheep need to educate themselves on how to behave well in a pack? No we're looking at the wrong perspective, the sheep need to OBSERVE to the very core of themselves, which is that each sheep is a unique, individual life being, with its own experience in life. \n\nIf all the sheep realize this, and the sheperd says, \"you must follow me\" then the power of control that the sheperd once had is now gone because the sheep no longer perceive themselves as an acquired object, but now perceive themselves as unique, individual sheep. What happens if they try running? What is ONE sheep dog going to do to a herd of sheep. It will just bark, there is nothing to fear.\n\nOnce FEAR is eliminated, CONTROL is eliminated. People need to start focusing on WHO is controlling their lives, and HOW we can change this. And we can change this by celebrating our own uniqueness. Be happy for who you are, who cares what another person is doing, if you care about who somebody else is, what is that benefiting you? You are not that person, you are you. Celebrate you, you are having a unique experience in life that nobody else is experiencing but yourself. Make it a great one that you can enjoy not with just yourself, but share to the world that we can still be unique, whilst living together in the same society", "created_utc": 1586315152.0, "distinguished": null, "id": "fmr6p1w", "is_submitter": false, "link_id": "t3_fwkcwo", "parent_id": "t1_fmp2yr4", "score": 1, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmr6p1w", "collapsed": false, "permalink": "/r/Coronavirus/comments/fwkcwo/youtube_tightens_rules_after_david_icke_5g/fmr6p1w/"}