{"author": {"comment_karma": 10307, "created_utc": 1393471113.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_DDBD37.png", "id": "fgyeq", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 91, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_ChiefKickAss2", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ChiefKickAss2", "key_color": "", "name": "t5_1roiti", "is_default_banner": true, "url": "/user/ChiefKickAss2/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ChiefKickAss2"}, "body": ">Is it naive enough for me to think that we can simply censor stuff that  is objectively not real? If there is a pandemic going on where people  can kill people just by being next to them out in public and if someone  is shouting that is not the case because of an inane conspiracy, then  perhaps they don't get to.\n\nMaybe a little bit naive. There's always going to be a side effect or consequence. Yes, the virus is serious, and I personally won't object to what we're all doing to slow it down, but we have essentially put the entire world on hold and turned the global economy on its head.\n\nThe issue is how do you view what's true and what's not true? The situation is serious, but looking at it from a different point of view, countries are talking about fining or arresting people who break isolation because they *might* have a virus that *might* get transferred to someone that *might* kill them, but probably won't over 95% of the time. How does that level of response square with putting millions of people out of work and basically suspending a lot of basic rights? If we stopped doing everything that slightly increased someone else's risk of death, I'd have to stop driving to work everyday.\n\nOn the other hand, if even half the people in just the U.S. get this virus, statistically, that's millions dead. I don't know how to balance the significance of that with the seemingly small impact a single individual has.\n\nBy this kind of reasoning, interpreting the truth, you have censorship in China that worked in the opposite direction, suppressing the knowledge of the virus entirely and lead to more deaths. They wanted people working, not panicking because that's what they thought of as the greater good. Though it wasn't necessarily intended as the greater good of the people. That's the potentially naive part, is assuming the people censoring things will see a somewhat subjective truth from the point of view that benefits you.\n\n>(Although I'm not sure if I'm comfortable calling it censorship as  youtube is a private company. It's more like Walmart deciding not to  carry bestiality porn. But that is a whole other conversation -- whether  if Youtube is essentially public speech on some level.)\n\nThat's true enough. It's something that bothers me greatly about youtube. They are and they aren't. They are indeed a private company, but they are extremely far reaching. Their censorship (or skewing of search results, which they do if I recall correctly) can have a significant impact on the public at large, and there's no legal ramifications one way or another for them, nor can I justify there being any for a private company.\n\nSure, you could start your own website, and stream whatever videos you wanted so long as it's legal, but the exposure you'll get from that is so extremely limited compared to if you were posting on one of these established platforms. Google as a whole has become so prolific that it's like a mini dictatorship on knowledge in some ways.\n\nEDIT: sorry if that got a little jumbled in the middle. There's a lot of different thoughts there to organize.", "created_utc": 1586261476.0, "distinguished": null, "id": "fmok3it", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t1_fmnse6d", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586261789.0, "name": "t1_fmok3it", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmok3it/"}