{"author": {"comment_karma": 1475, "created_utc": 1584367850.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_94E044.png", "id": "5y241ffa", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_dr3wie", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/dr3wie", "key_color": "", "name": "t5_2hv1rg", "is_default_banner": true, "url": "/user/dr3wie/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "dr3wie"}, "body": "1. Scientific papers do not automatically get more accurate as they age. In fact a vast majority get superseded by what follows as new data gets acquired through ever improving instruments, new phenomena gets discovered and new improvements to existing theories are found.\n2. If you don't consider yourself an expert then either leave the thing to experts or start studying to become one. If you choose the first option, then look for what majority of mainstream experts are saying, not just a few people on the fringes. Whatever is your specialty I'm sure that you're pretty good at it and should have noticed that not everyone in the same business have the same integrity, intelligence, skills, experience. Maybe you even know someone that may pass as a good X (whatever your profession/passion is), but who you consider quite poor and wouldn't listen to his/her opinion. Well, it is the same in all different subjects, science included. Unfortunately it may be very hard for us laypeople to understand which people are real experts and which just have the titles. But there are a number of proxies we can use. A previous research published on topic at hand is a good one. It means the person not just is interested about the topic or have studied some time ago, but that they are actually following to all recent developments and are able to contribute something new. Then there is citation index. That shows how impactful are the papers published by this person. Even better is to look specifically on papers published at topic at hand and find out how many other papers have used it. Since this all may sound as a lots of work, somewhat easier option is just to trust established associations, commission, governmental bodies. And then there is an option to try learning on the topic at hand yourself. You can't just read titles and abstracts or even someone else's regurgitation. It won't give you whole picture and often might be completely misleading. When reading papers make sure to follow how exactly the got the data they are citing. If it was an experiment, try to follow its methodology, if they are citing some other paper you have to find it in order to understand what where the limitations, etc.\n3. Specifically about your claims. Some sort of research done in fifties. I have no idea what are you talking about. How was it done, which frequencies it explored at which energies. Which animal models where used, for how long where they exposed to the radio waves and what was the result? Is there any other research either replicating these results or invalidating them?\n4. Summary from Scientific American. First, it's not a summary. Summaries in science are generally called \"literature reviews\". That's when you go through all previous papers written on a topic, look at what each of them found, examine limitations of each study and summarize your findings. What you linked doesn't go through all available literature, it just cites a few cherry picked publications that according to an article prove their point. Second, it wasn't published by Scientific American. It's a blog post. It's a also not a peer reviewed paper so it doesn't really matter at all where it was published.\n5. About the claims made in the blog post. They are sooo misleading. I would probably need several posts to go through all of them, but well this one is getting to long already. Note that there are a couple of mistakes(?) in the post itself. The main issue is conflating so many potential concerns into a single pot. What exactly are they protesting against? E.g. most studies that are cited there have been checking health effects of radiation coming from the mobile phone itself. That is they put animal model right next to the phone and make a phone call. But that's something that is under control of the people - you can just choose phones that don't support frequencies you're worried about or disable evil 5g entirely in your phone. So it seems that most concerns listed actually are about passive exposure to the radiation from cell towers. E.g. they are listing concerns about use of mm waves (>30GHz). But while 5g standard allows use of these frequencies this is an option not a requirement. Moreover, none of the countries as far as I know haven't yet licensed these frequencies, the highest bands reserved for 5g are in 28GHz. It also says that this is the first time people would be exposed to such frequencies which isn't true. They have been used in many contexts, the most obvious - military. It also claims that 5g would be the first to use beam-forming and MIMO which isn't true. 4g has the same tech (obviously with different parameters like a number of antennas) and even WiFi since like WiFi 802.11n supports both MIMO and beamforming so plenty people with reasonably newish routers have been exposed to this tech. Both actually are legit awesome inventions that allow lowering power/radiation needed to reach your target so it doesn't even make sense to consider them much of a risk. Another fun thing is that for next five to six years there won't be any real 5g around so most of the points are moot anyway. What we'll get is one-directional freak that is using some of the 5g features when getting data from cell tower yet sending data in the other direction (which is the most dangerous part) through oldie goodie 4g. That's just cause there isn't a tech to send 5g from the phone yet and it won't be cheap any time soon. Moreover even when something is called \"5g\" (either phone or cell tower equipment) it does not mean it supports full spec. Incidently same goes for WiFi, e.g. WiFi 6 (previously branded ax) devices you can get right now are utter crap. The thing is that manufacturers are doing absolutely least they can in order to device technically to support absolutely the minimum requirements to get the certification (5g or WiFi 6). Which usually means running basically in the compatibility mode that isn't meaningfully better than the previous tech and is intended just to headstart adoption (there isn't much point to include capability in phones before at least some support gets announced by cell networks or wifi routers and vice versa).\n6. Synergistic effects between 5g and 4g does not make any sense. If 5g is running in a compatibility mode it will use the same frequency and basically be just the same 4g maybe with more antennas for beamforming (which reduces energy sent from the cell tower and does not affect what's send to cell tower from the phone). If they will be using different frequencies, it shouldn't matter as phone will only use one at a time. But you see what is happening here. By intermingling multiple potential worries what gets achieved is that there isn't a clear way to contradict it as whatever you say opponent can claim that right now they are particularly worried specifically about the other concern. While providing studies that are completely irrelevant to stated risk.\n7. Finally, about the signatories. It is not uncommon for these people to not even realize what they have been signing. People would send them such request all the time. It might very well be that someone is concerned about potential use of some particular frequency (that hasn't been licensed yet but they want to preventively raise awareness) while someone else has specific reasons to ask for say lowering of allowed energy by 5% to be in accordance with some other country. But we don't know these individual reasons and are presented with an incorrect view that all of them are asking for the same as the most vocal group - to ban 5g altogether until \"we get enough information\".\n8. About that vocal group. If you hear people saying this it is safe to ignore them. As I said 5g is an extremely broad specification intended to accompany very conflicting needs. It should work in very crowded places, in very large distances, in very short distances, in a low energy situations. Most things that will actually get implemented in foreseeable future won't be much more than rebranding of current tech using same power and frequency. Not all places will get all of the theoretically possible options (even if the frequency has been licensed it may be used only in few places like stadiums and concert halls) and not all devices will support all of them. The previous standards will be kept for backwards compatibility and you'll definitely have an option of disabling all of this suspicious shit on your personal devices. Taking all this into account it just does not make any sense to oppose all of this at once, it is clear that if a person can't articulate what exactly are they afraid of - they are simply afraid of that which they don't know and understand.", "created_utc": 1586123707.0, "distinguished": null, "id": "fmj5ykw", "is_submitter": false, "link_id": "t3_fvf99x", "parent_id": "t1_fmikjyf", "score": 3, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmj5ykw", "collapsed": false, "permalink": "/r/Coronavirus/comments/fvf99x/youtube_to_suppress_content_spreading_coronavirus/fmj5ykw/"}