{"author": {"comment_karma": 19442, "created_utc": 1405082679.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_cn7e7/styles/profileIcon_75u6zsnkflt41.png?width=256&height=256&crop=256:256,smart&s=b5768b3c3e395b6c80b48c8c61be78f7050706cb", "id": "hcs02", "is_employee": false, "is_mod": true, "is_gold": true, "has_subscribed": true, "link_karma": 216648, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_cn7e7/styles/profileBanner_sews3bqhedo41.jpg?width=1280&height=384&crop=1280:384,smart&s=14632587feb8f121b1a0b5e44227171be44739eb", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_johnruby", "header_img": null, "title": "johnruby", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_cn7e7/styles/profileIcon_75u6zsnkflt41.png?width=256&height=256&crop=256:256,smart&s=b5768b3c3e395b6c80b48c8c61be78f7050706cb", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/johnruby", "key_color": "", "name": "t5_cn7e7", "is_default_banner": false, "url": "/user/johnruby/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "If you have any question about me, please PM me and I'll be glad to answer. \n\nStay healthy and stay safe.", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "johnruby"}, "body": "Part.2\n\n## Vulnerable Companies\n\nEuropean governments have become more wary of China over the past two years as Xi’s Belt and Road Initiative on trade and infrastructure expanded across the continent, snapping up strategic assets including ports, power utilities and robotics firms from the Mediterranean to the Baltic Sea. While some nations including Italy and Portugal have been enthusiastic backers of Belt and Road, another program known as Made in China 2025, whereby Beijing seeks to become the world leader in key technologies, is seen in many quarters as a further threat to European industry.\n\nWith stock prices tumbling on the coronavirus crisis, countries including Germany that have investment screening regulations [have tightened them](https://www.bloomberg.com/news/articles/2020-04-08/merkel-s-government-approves-tighter-rules-on-foreign-takeovers) and extended their scope in response to concerns that China, among others, could take controlling stakes in companies suddenly made vulnerable. EU Competition Commissioner Margrethe Vestager suggested in a Financial Times interview that governments go further and buy stakes in companies themselves to stave off the threat of Chinese takeovers.\n\nMore far-reaching still are proposals to curb dependence on China, not just for [medical supplies](https://www.bloomberg.com/news/articles/2020-04-06/virus-spurs-global-free-for-all-over-597-billion-medical-trade) but in areas such as battery technology for electric vehicles. EU Trade Commissioner Phil Hogan [said last week](https://ec.europa.eu/commission/commissioners/2019-2024/hogan/announcements/introductory-statement-commissioner-phil-hogan-informal-meeting-eu-trade-ministers_en) there’s a need for a discussion “on what it means to be strategically autonomous,” including building “resilient supply chains, based on diversification, acknowledging the simple fact that we will not be able to manufacture everything locally.” Japan already earmarked $2.2 billion from its $1 trillion stimulus package to help its manufacturers [shift production away from China](https://www.bloomberg.com/news/articles/2020-04-08/japan-to-fund-firms-to-shift-production-out-of-china).\n\nWithout mentioning China, EU trade ministers agreed in an April 16 call on the importance of diversifying to “reduce the reliance on individual countries of supply.” As a first step, Berlin plans state funds and purchase guarantees to start industrial production of millions of surgical and face masks by late summer. China currently exports 25% of the world’s face masks.\n\nWuttke of the EU trade chambers said the discussion on supply chains began when Beijing shut its ports earlier this year, prompting fears that pharmaceutical ingredients produced in China would not reach Europe, and causing policymakers to realize that strategic products had to be secured. According to another European official, even official suppliers were breaking contracts for items such as ventilators and scamming people, burning bridges along the way. “People want to have their eggs in more baskets,” said Wuttke.\n\n## Burning bridges\n\nCertainly, the tenor of the political debate in Europe has shifted since. German Foreign Minister Heiko Maas told Bild newspaper that China’s revising up of the death toll last week was “alarming,” while French President Emmanuel Macron said in an FT interview there were “clearly things that have happened that we don’t know about.” U.K. Foreign Secretary Dominic Raab said it can’t be “business as usual” with China once the pandemic is over.\n\nAs a result of the Covid-19 crisis, [pressure is growing](https://www.bloomberg.com/news/articles/2020-04-16/johnson-s-huawei-plan-at-risk-as-u-k-set-to-rethink-china-ties) on the U.K. to reverse its decision to allow [Huawei Technologies](https://www.bloomberg.com/quote/0287771D:MK) a limited role in its fifth-generation mobile networks, while France may be less inclined to give Huawei a chunk of its 5G contracts after the embassy spat. Germany must make a decision by around midyear on Chinese involvement in its 5G networks.\n\nIn the battle of narratives, Germany is key, according to [Janka Oertel](https://www.ecfr.eu/%20profile/category/oertel_janka), director of the Asia program at the European Council on Foreign Relations in Berlin. As well as Europe’s dominant economy, its trade ties to China dwarf those of its neighbors: German exports to China in 2019 were higher than the U.K., France, Italy, Spain and the Netherlands combined. It will assume the EU’s rotating presidency on July 1, giving it the chance to turn the debate in Europe.\n\nChina could still win back favor and help secure a greater global role by acceding to demands to open up its markets and introduce a more level playing field for international business, said Oertel. “That would be something that the Europeans would very much appreciate,” she said. All the same, she added: “I don’t think it’s very likely.”\n\n*— With assistance by Patrick Donahue*", "created_utc": 1587517643.0, "distinguished": null, "id": "fo550t8", "is_submitter": true, "link_id": "t3_g5rrya", "parent_id": "t1_fo55087", "score": 67, "stickied": false, "subreddit_id": "t5_2dar36", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fo550t8", "collapsed": false, "permalink": "/r/China_Flu/comments/g5rrya/chinas_coronavirus_diplomacy_has_finally_pushed/fo550t8/"}