{"author": {"comment_karma": 6189, "created_utc": 1406280266.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_7193FF.png", "id": "hkd94", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 161, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7193FF", "user_is_muted": null, "display_name": "u_Gigamon2014", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_7193FF.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Gigamon2014", "key_color": "", "name": "t5_1pwo4o", "is_default_banner": true, "url": "/user/Gigamon2014/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Gigamon2014"}, "body": "It is fucking incoherent. It does little to explain how bandwidths work or the fact that 300GHz is pretty far beyond the wavelength emitted by any local emitters (20-90GHz). It does little to really break it down for laymans who aren't already well informed. \n\nEDIT: Jesus, its actually really fucking awful.\n\nOne gem from one of the links which asks what research has been undertaken...\n\n>HSE’s policy on phone masts in particular, and radio wave safety in general, is guided by organisations such as the World Health Organisation, the International Commission on Non-Ionizing Radiation Protection and the Health Protection Agency. It is important that we understand and monitor any potential public health impact from radio waves. A great deal of research has been, and continues to be undertaken. The weight of international evidence reviewed by these expert organisations indicates that there is no evidence of a direct link of harm or ill health from working or living close to phone masts.  \n>  \n>In 2000 the UK Government commissioned the Independent Expert Group on Mobile Phones (IEGMP) chaired by Professor Sir William Stewart, to conduct a review of the possible health effects from the use of mobile phones, base stations and transmitters. It concluded that:  \n>  \n>“The balance of evidence indicates that there is no general risk to the health of people living near to base stations on the basis that exposures are expected to be small fractions of international guidelines.”  \n>  \n>Research continues to be undertaken ([Mobile Telecommunications and Health Research](http://www.mthr.org.uk/)). More information can be found from [Public Health England](https://www.gov.uk/government/organisations/public-health-england).\n\nThis actually means fuck all. Both of the links here simply take to the main page of public health england. What the fuck is that??\n\nI am starting to get the impression that many of the professional classes kinda get off on keeping the public uninformed, in order to justify their salaries. And keep in mind, this is coming from someone who doesn't believe 5G presents dangers to the general public.\n\nHave a look at this laughable exchange that took place at a congressional hearing:\n\n[https://www.youtube.com/watch?v=ekNC0J3xx1w](https://www.youtube.com/watch?v=ekNC0J3xx1w)\n\nI mean we're seriously wondering why people are distrustful???\n\nI think 5G is an amazing technology and will truly usher in a technological revolution like nothing ever seen. But I think what people really aren't worrying about is the fact that it gives those in power a near unparalleled access to information and control like nothing ever seen before. Communication times with no latency and enabling of IoT and possible AI revolutions like self driving cars and connected appliances? Sounds great until you learn that it also means you're giving corporations and governments unlimited access to just about every piece of technology that you own.", "created_utc": 1585912521.0, "distinguished": null, "id": "fmay9vk", "is_submitter": false, "link_id": "t3_fu4x2o", "parent_id": "t1_fmaxc3z", "score": -21, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": 1585912897.0, "name": "t1_fmay9vk", "collapsed": true, "permalink": "/r/unitedkingdom/comments/fu4x2o/uk_media_outlets_told_not_to_promote_baseless_5g/fmay9vk/"}