{"author": {"comment_karma": 43618, "created_utc": 1429724810.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_25B79F.png", "id": "n2d85", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 30, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#25B79F", "user_is_muted": null, "display_name": "u_hitstein", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_25B79F.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/hitstein", "key_color": "", "name": "t5_1lcqaa", "is_default_banner": true, "url": "/user/hitstein/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "hitstein"}, "body": "The word belief avoids validity. Beliefs can be valid or invalid, they're not inherently one or the other. The word belief also says nothing about logic. Beliefs can be founded in logic or not, but again they're not inherently one or the other. These literally are other beliefs or different viewpoints. They're not founded in logic. They're irrational. That does not mean they don't believe what they believe. \n\nYou make the claim that these \"are people who are refusing to play by the basic rules of reality and intelligence.\" Are you not painting them in a light that makes them an aggressor in order to make it easier to attack them, and not what they are saying? Are there not people who many would consider to be highly intelligent that hold irrational beliefs? Does that not mean that it has nothing to do with how intelligent that person is?\n\nI agree that believing in something illogical and dangerous can do real damage. Such as being a member of the KKK and believing that a certain category of humans are subhuman, therefore [murdering them for interacting with the wrong person is justified](https://en.wikipedia.org/wiki/Emmett_Till). I'm sure Daryl Davis understands that as well, but he chose not to be deliberately hateful to those who held such beliefs. Is it your opinion that he wasted his time and was unsuccessful? Because that belief would not be based on reality, and based on his own words I'm sure he'd disagree with what you're saying.\n\nAs I've alluded to elsewhere, and as I'll say again right here: There aren't two sole choices when dealing with these people. It's not, \"Either I choose to enable their delusions or I call them names.\" Choosing not to be hateful is not the same as enabling. Acknowledging the fact that someone believes something is not the same as accepting that belief, or humoring that belief, or coddling them, or enabling them, or anything other than noticing that something exists. Sure, we can view them as choosing to ignore reality, if we want to needlessly simplify the situation, but that doesn't mean it's permissible for us to choose to be hateful.", "created_utc": 1588906325.0, "distinguished": null, "id": "fpu7ggs", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpu16bi", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpu7ggs", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpu7ggs/"}