{"author": {"comment_karma": 84, "created_utc": 1552505491.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_A06A42.png", "id": "3ejavgvs", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 7, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_maybemarfan", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/maybemarfan", "key_color": "", "name": "t5_y34z8", "is_default_banner": true, "url": "/user/maybemarfan/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "maybemarfan"}, "body": "My N=1 anecdote and opinion.\n\nMy dad has an engineering background, arguably a better kind of intelligence at understanding statistics and data which should partly inoculate against conspiracy theories. As far back as I remember, he's been a bit of a nut when it comes to health foods, eg. drinking liters of carrot juice a day to the point of having an orange glow, taking 50+ different supplements. I'm guessing over time he delved into using and ingesting more dangerous stuff, eg. colloidal silver, topical and oral use of DMSO, oral use of borax, and more that most people probably never heard of. He fed me a lot of this crazy stuff when I was young and forced to stay with him.\n\nAt some point in primary school I was supposed to get a Hep B vaccine which he seemed to be on the fence about. One of the teachers convinced him it was fine, but he said he had regrets about it later. In high school I was supposed to get the meningitis vaccine which he interfered with. I think around that time I became more aware of the conspiracy theories he believed in, they probably got worse, it's hard to know for sure for a primary school aged kid to know just how crazy their parent is.\n\nThe theories got worse and more consuming, chemtrails, Sandy Hook, EMF, 5G, teleportation to Mars, alien time travellers, etc. I could probably use up the character limit listing them all out in detail. He reads stuff from Mercola, Natural News, Dr. Axe etc. forwards me insanely formatted emails with random bolding/highlighting of words used to emphasize just how evil some government/person is. He thinks doctors purposely ignore natural cures to make money from big pharma and whatnot. He tries to self treat and avoid medical attention, even with some pretty alarming stuff.\n\nHe's been like this for 20+ years at least, but doesn't show any severe cognitive decline otherwise. His father had Alzheimer's later in life, but he was a dentist working with mercury fillings so it's hard to know just how strong of a genetic component there might be. His mother also had dementia quite late in life.\n\nMy best theory to explain his situation is that his father was physically and verbally abusive and he grew up in Eastern Europe under Russian communist influence. I think at least part of this caused serious trust issues with governments and authorities.\n\nMy parents divorced early and he was always verbally abusive with me, so I never really liked him and avoided him as much as possible. The conspiracy theories are so consuming that it's impossible to have a conversation without him talking about at least a few of them in great detail. He sounds like he wants my opinions on things, but he's extremely dismissive any time someone brings up an argument. I just let him talk at me and ignore him as much as possible, see him maybe once or twice a year at this point. Not sure how much success you'd have talking your dad out of these things, but with mine I'm almost certain it's not possible and not worth the stress. My dad is toxic for many reasons so it's much simpler to just cut him out as much as possible.", "created_utc": 1587509492.0, "distinguished": null, "id": "fo4qx5w", "is_submitter": false, "link_id": "t3_g5fyvm", "parent_id": "t3_g5fyvm", "score": 3, "stickied": false, "subreddit_id": "t5_2xtuc", "downs": 0, "total_awards_received": 0, "edited": 1587510153.0, "name": "t1_fo4qx5w", "collapsed": false, "permalink": "/r/AskDocs/comments/g5fyvm/my_very_smart_dad_has_recently_started_reading/fo4qx5w/"}