{"author": {"comment_karma": 74625, "created_utc": 1243525823.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_FF66AC.png", "id": "3htmb", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 7787, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_skiman13579", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/skiman13579", "key_color": "", "name": "t5_ctifc", "is_default_banner": true, "url": "/user/skiman13579/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "skiman13579"}, "body": "The best conspiracies are built on partial truths.  Some truth, I have several vials of coronavirus medication (NOT a vaccine) sitting in my kitchen 15 feet away from me as I type this.  I bought it black market from China.  Multiple Chinese companies produce the drug, called GS441524.  \n\nNow the drug isn't Chinese, it's American. It's just made in China because there was pre-COVID demand for the drug and the patent holder would not permit its approval for my use.  \n\nWhat is my use? My cat was dying from a 100% fatal mutation of the Feline Coronavirus, the mutated form is called FIP.  This drug has an over 90% success rate in a previously uncurable fatal disease.  \n\nThe company? Gilead Science. You may have heard of them recently, for their COVID treatment just approved called Remdesivir.  The only difference between  GS441524 and Remdesivir is Remdesivir is slightly more complex drug to make absorption into cells easier, then gets metabolized into GS441524, and the GS is what actually fights coronaviruses.  They just haven't allowed feline veterinary approval because problems in approval may have caused delays in human trials, Remdesivir/GS441524 was developed originally for Ebola and saw early human trials.\n\nHere is an article about the black market for GS for cats from The Atlantic.  https://www.theatlantic.com/science/archive/2020/05/remdesivir-cats/611341/\n\nThe woman in the article, Robin Kintz is a hero to me, it was from her direct I got my GS and saved my kitten's life.  His last shot is Thursday after 3 months of daily shots!\n\nSo if you are still with me, this drug has existed, so it feeds into COVID being \"designed\" by someone. Prior to the recent Remdesivir approval, China has been producing a lot of this drug.  In the article it mentions some bad shipments (vials filled with no GS). Mixed in how many shipments also never got shipped with China's lockdowns, its a lot of medicine that went \"missing\" when the factories were just shutdown and not making any.\n\nIts easy fuel for conspiracy theories.", "created_utc": 1589897148.0, "distinguished": null, "id": "fr4ujqn", "is_submitter": false, "link_id": "t3_gmhezr", "parent_id": "t1_fr4ej3z", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fr4ujqn", "collapsed": false, "permalink": "/r/worldnews/comments/gmhezr/australian_poll_finds_1_in_8_blame_bill_gates_and/fr4ujqn/"}