{"author": {"comment_karma": 59781, "created_utc": 1542832922.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_FF4500.png", "id": "2lydeyeh", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 10035, "subreddit": {"default_set": false, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_FloatingSpaceTrash", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/FloatingSpaceTrash", "key_color": "", "name": "t5_ro18q", "is_default_banner": true, "url": "/user/FloatingSpaceTrash/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "FloatingSpaceTrash"}, "body": "Lol I don't even know where in addressing all that stupid just spouted.\n\n>There are waaaaaaaaaay more people making memes and publishing articles about how stupid these people are than there are actually those people. That's when you know you're experiencing a targeted campaign.\n\nTo keep the dumbasses from setting shit on fire.\n\n\n>I wonder what the government would have to do for you to actually realise they are fucking with us? You're literally under house arrest because of some mild diease that I've probabaly already had and didn't even notice because I take care of myself. \n\nPlenty of people are symptomatic despite taking care of themselves. That's such a stupid statement you just made😂 And no it's not about how badly the disease might affect you it's reducing spread so hospitals aren't overwhelmed for the people who actually need them. You fucking idiot🤦🏽‍♂️\n\n\n>Fuck man I can't wait to go back into a world with less people in it who don't know how to maintain basic health.\n\nThat's just how it works maintaining basic health will not stop you from getting it if you're exposed to it. \n\n\n>Other than that, at risk people could be responsible for isolating themselves. Why isn't that a solution genius? You just eat it all up don't you?\n\nBc if you get it and are asymptomatic you can bring it to them without knowing. And even with no risk factors still get. That's why dipshit. God damn you must've been dropped a lot as a baby.\n\n>Here's another thing for you to think about. If your government really cared about you, they would probably make sure there are enough ICUs and ventilators in case of a mild virus outbreak which top scientists have been warning will definitely happen for years. Yeah they don't care, they are using this crisis to make their next moves. 5g being just one of them. \n\nSee this is just plain stupidity. They had enough for normal operating conditions. You can't just a make a bunch of shit that you're not going to use bc someone has to pay for that. This why we want to keep the hospitals from being overwhelmed. And it doesn't matter if you build more ICUs if there isn't enough Drs. to work them. You're an idiot.\n\n>They are so scared about us questioning the rapid roll out of 5g that they created this idea. I know for you this seems far fetched. Just keep your eye out for these things for years like I have and it slowly becomes undeniable. Thanks for your time.\n\nYeah I prefer the government without wearing tinfoil hat. You should give it a shot.", "created_utc": 1586360709.0, "distinguished": null, "id": "fmsr836", "is_submitter": false, "link_id": "t3_fwvf0s", "parent_id": "t1_fmsp9m3", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmsr836", "collapsed": false, "permalink": "/r/conspiracy/comments/fwvf0s/if_184_countries_have_coronavirus_and_only_five/fmsr836/"}