{"author": {"comment_karma": 9229, "created_utc": 1504085567.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_008985.png", "id": "c70237o", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 571, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_CreativeAnalytics", "header_img": null, "title": "Don't Panic... Okay Panic!", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/CreativeAnalytics", "key_color": "", "name": "t5_7glc0", "is_default_banner": true, "url": "/user/CreativeAnalytics/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "CreativeAnalytics"}, "body": "If you're in a bunker with 99 other people and one of them starts losing their shit and panicking, what do you do? Try to temper it? Let them affect others around them and cause more panic? Leave them to their own devices because of free speech?\n\nWhat if they start to convince others that the air supply is dwindling, even though there's no evidence, and common sense tells you there's plenty of air supplied to the bunker?\n\nWhat if you prove the air supply from outside is fine, but they then turn to the air supply being tainted? That it's going to poison them? But this is still free speech, right?\n\nAt some point in that room, under those circumstances, you draw a line between what is acceptable and controllable behaviour, and what is a threat. You need to temper that behaviour BEFORE it presents a threat. So where do you draw the line? \n\nWhere do you draw the line for society, during normal times, and during a pandemic?\n\nThere is a line that needs to be drawn to prevent this bullshit from spreading. It's not just this idea about 5g, but the other common conspiracy theories that spread like cancer with it, that big pharma is spreading it to make money, that fake and infected testing kits are being spread by the Chinese.\n\nThese can be very harmful, especially to types of people who are prone to panic or susceptible to having ideas pushed on them. These are not just conspiracy theorists towing the line, but those who are afraid and looking for a cure or a way out. They are easy to prey on.\n\nMy mum isn't stupid but she can be too trusting; at the moment I am needing to make sure she understands a lot of the bullshit being spread on Facebook is not true. Sure, we should each be responsible for making that decision for ourselves, and perhaps our family, but at some point the governing body, and society as a whole, must draw the line to prevent panic and misinformation causing harm.\n\nDo you agree the government, under the direction of the people, has the authority to decide whether we go for herd immunity or isolation and further economic shutdown?", "created_utc": 1586267394.0, "distinguished": null, "id": "fmos962", "is_submitter": false, "link_id": "t3_fwkcwo", "parent_id": "t1_fmoqb6e", "score": 7, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmos962", "collapsed": false, "permalink": "/r/Coronavirus/comments/fwkcwo/youtube_tightens_rules_after_david_icke_5g/fmos962/"}