{"author": {"comment_karma": 32608, "created_utc": 1513039891.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_FFD635.png", "id": "nyjzwqi", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 20122, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FFD635", "user_is_muted": null, "display_name": "u_rdar1999", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_FFD635.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/rdar1999", "key_color": "", "name": "t5_7qrpm", "is_default_banner": true, "url": "/user/rdar1999/", "banner_size": null, "user_is_moderator": null, "public_description": "I express my opinions through humor, if you can't handle it fuck off. :)", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "rdar1999"}, "body": "Your post is altogether naive. I doubt anyone but you will read all of this, but let me explain.\n\nYes the US did a lot of shit just to shun the soviets, but take a look at what you get with \"communism\": ethnic cleanse, mass executions, dictatorship, state-sponsored rape of minorities, ideology that only works vertically (oligarchs on the top always get filthy rich and don't \"share\"), poverty, suppression of individual liberties such as: suppression of free speech, suppression of right to movement, suppression of private initiative, suppression of marriage rights, the list only grows.\n\nAlso, the most important part, the world should NOT have the amount of countries with nuclear weapons it has. You forgot this important \"detail\", that the cold war was a lot about proliferation of nuclear weapons prevention. It is not a matter of virus, ethnic cleanse, mass murder, it is game over *forever* problem.\n\nShould the US be the world leader? *This is a whole different question,* and in many respects the US is failing to providing a decent world for ALL of us to live, but they are NOT failing at providing balances and checks to dystopias like the CCP, NK, and so on. Even tho they surely do this in a liar and corrupt way to make extra bucks and harming the wold's environment and economical balance further, we are still here, alive, without nuclear war.\n\nBut please, you say \"we want another global power be it China\", lol, fuck you, either you are a functional idiot, or brainwashed \"communist\".\n\n> a more unified EU could restrain the US\n\nNo, it cannot. Have you ever got a book in your life? The only thing preventing Putin from grabbing Ukraine and turning off 40% of the heat in the EU next winter is US military and allied-to-US military.\n\nI don't think Russia is nearly as evil as americans think, Russian people can be very nice, warming and even fun, but I also know the mentality there is imperialist, they are just another face of the same coin. Russia, China, US, EU, imperialists. They are constantly fed up with propaganda against each other. The difference is that in the US you have (almost) all the ethnicity and diversity, mentality of free initiative, free speech (although they are slowly, but surely, losing those). All those good points you forget when you want to just take a dump on the bad things. As bad as systems there are, you can't even begin to compare this to chinese mentality. China is VERY racist and murderous backwards country.\n\nAnd why do you think the EU should \"rule all\"? Europe is one of the places where there should NOT be a centralized power, geographically speaking. Europe cannot control borders well, Europe has proximity to a lot of fanatic religious countries, it is dependent on resources coming from everywhere and \"lock borders\" because it is cynical and egotistical. Europe would derail into the 18th century without south american, asian and middle eastern resources and markets. Plus, every single major conflict in recent history involves the continental Europe. Europe is not even *free of xenophobia against each other, let alone the rest of the world*. Historically, Europeans have been leeches and careless about the places they set dominion over. The bad things about American consumerism and \"capitalism\" is also present in the EU.\n\nBut I get part of your point, many styles of living found in European countries are the best ones (I'd actually look to Scandinavia). The welfare state (which the US mocks and opposes), the well planed small cities, the culturally-driven society, the transportation systems (although I believe Japan does that better), the right to privacy, and so on. But it is a culturally-biased mentality to think that Europeans should *rule* anything, you are probably [descendant of] european. I am, and I say fuck them. If anything, they have good examples about the aforementioned points, but awful examples of leadership.\n\nActually, it would be detrimental to the EU itself to do this role given what I said, especially given geographic placement. It should be as international effort as it gets. It would actually be a *relief* to the ~~EU~~ European citizen if the power-axis shifted away from them.\n\nAnd probably the best place to amass power (meaning mass destruction weapons and decision making political entities) is in the north-south extremes of the World, Canada, Australia and Argentina (**territoriality speaking** - also maybe south Chile and South Brazil + Uruguay). Resources are plentiful in Argentina/Brazil. Australia has somewhat an advantage in isolation and proximity to South Asia. Canada has a very good political system. If I could hit the reset button, that's what I'd do, I'd glue them together in a single international body/country/federation. Sadly, the powers are concentrated in a west-east axis and Europe in the middle, what causes basically every single problem we have in the world right now.\n\nNuclear weapons should be by now all defused by an international effort with transparency and full jurisdiction power. The same goes for chemicals and biological weapons. It is a waste of time for humanity as a whole to get through all the politics and propaganda to get this done. You love China and Iran, go live there, eat a dog, beat a woman because she didn't clean after you. Give your down vote now.", "created_utc": 1586558435.0, "distinguished": null, "id": "fn1b73j", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t1_fmzpd3v", "score": -7, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fn1b73j", "collapsed": true, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fn1b73j/"}