{"author": {"comment_karma": 2911, "created_utc": 1521115752.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "id": "11n75jmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 65, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_remus213", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/remus213", "key_color": "", "name": "t5_gvsyd", "is_default_banner": true, "url": "/user/remus213/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "remus213"}, "body": "his explanation of why covid-19 is fake proves how ignorant this man is.. he doesnt even understand the basic biology of what a virus is/ understand what genetic material is/ doesnt understand basic laws of probability? A virus is simply a string of genetic material that is literally all a virus is - its a string of genetic material in some parts of the viral life cycle its a string of genetic material surrounded by a coat of proteins - however the essense of a virus is simply its genetic material as this is how it functions - the genetic material tends to code for a bunch of proteins and these tend to be proteins that cause the replication of the virus and proteins that play other roles in the viral life cycle... ie such as the proteins in the protein coat that surrounds the virus in its extracellular form.\n\nA virus is simply a piece of genetic material which codes for the production of more viruses - a virus has no cellular machinery of its own however so it has to invade host cells and make use of the host cells DNA transcription and translation machinery to be able to actually make copies of itself. Basically once the Viral DNA is in the host cell the host cell treats the DNA as if its its own DNA and therefore transcripts and translates the viral DNA into the viral proteins which then utilise the cellular machinery to make a vast number of copies of itself (ie many strings of viral genetic material packaged in their seperate protein coats ready to be released and invade new host cells) - A virus is simply a piece of DNA that when placed inside a host cell, essentially hijacks that host cell and turns its own machinery against it making the cell into a virus producing factory - that cell eventually fills up with more and more viruses until all its resources are exhausted it willl then burst and release all the millions of viruses inside - each of these new viruses then seeks a new host cell and the cycle continues.\n\nWhat Icke seems to not understand is that Viruses ARE genetic material so this is how we test ppl for viruses all the time - we test for the viruses specific genome using something like PCR - polymerase chain reaction - wikipedia this for an explanation. So of course all the tests will be for genetic material.. this is how we test for ALL viruses before we can create antibodies which will instead test for the proteins that coat the virus - these kind of tests give a faster result but are often far less accurate than DNA testing which will give an accurate result.. IF you have a sequence of DNA in your body that exactly matches the sequence of covid 19 .. you HAVE covid 19 inside you no doubt about it.. unless of course you just happen to have the exact genome sequence of covid 19 in your body anyway just down to chance... the chances of this happening are RIDICULOUSLY small like so ridulously small its impossible to even fathom - there are more possible combinations of that long a sequence of bases than there are atoms in the universe. Sooo yeh its basically impossible with even a basic understanding of the laws of probability u can disprove everything hes saying. He just SOUNDS clever to ppl who are dumb as he floats around clever sounding words ie mentioning the exact PCR test.. to make it seem like he knows what hes talking about but anyone with actual knowledge of what hes saying can clearly hear how he has no understanding of even the basic concepts around the thing hes talking about - its a classic charlatan trick to waft around long words and vaguely scientific sounding jargon to give the impression of knowledge where there is simply nothing.", "created_utc": 1586393253.0, "distinguished": null, "id": "fmukm18", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t3_fxaxsf", "score": -6, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": 1586393439.0, "name": "t1_fmukm18", "collapsed": true, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmukm18/"}