{"author": {"comment_karma": 48, "created_utc": 1489490509.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_C18D42.png", "id": "166ghu", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_dygmm", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/dygmm", "key_color": "", "name": "t5_17870k", "is_default_banner": true, "url": "/user/dygmm/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "dygmm"}, "body": "Hi, I am not a doctor but am a telecoms engineer, currently planning and deploying 5G stations. I may offer some perspective on 5G, so that you can fact check. I apologize beforehand if this answer does not meet the rules of this sub.\n\nI have read many, many theories and watched countless wasted hours of videos on youtube, who censor themselves when they talk about vaccines or Bill Gates or coronavirus, just in order to understand what makes people think 5g is going to kill us.\n\nSo far, the most reasonable thing I heard is that 5g, operating at 60GHz, causes oxygen electrons to spin faster, and when this oxygen is inhaled, it cannot be properly absorbed. I am directly going to assume this as a fact, although this idea only has 1 (one) reference which is an article from 2001. Anyway, lets say that is the case. Today, in ENTIRE world, there are NO 5G stations that operate at 60 GHz. Yes, in theory they can work at those frequencies, but they have not been deployed yet. In all world, 5G ranges from 600 MHz to 58 GHz, theoretically can go up to 300 GHz (called milimiter waves, MMw). Today, South Korea has the densest deployment of 5G stations, have been doing it for the past 3 years, and are one of the best countries at battling with coronavirus. \n\nThat being said, one of the theories says that coronavirus is artificially created in order to drive opportunity for a new vaccine, which includes dead animal/fetus tissues that can mutate with 5g and make us infertile. Assuming that true, which I find brilliant by way if thats the case, unless your dad wants to have some more kids, he should be fine. \n\nAs for the chips that follow us everywhere, we already have entities like Facebook and Google today that are already following us everywhere, so nothing to worry about it either.\n\nBesides, even if all theories are true, even if we have to get vaccinated before we return back to our normal life and these vaccines contain government implanted spy  chips, what else are we gonna do? We need to get out go to work earn money in order to stay alive. Unless we collectively commit suicide and collapse world economy, it wont matter. The only issue with this whole idea is that we are not knowing the real deal, but even if we did, we would not have the chance to opt out anyway. We are going to exist for a few decades and then die anyway, its better to try and make the most of it.", "created_utc": 1587514167.0, "distinguished": null, "id": "fo4z8z5", "is_submitter": false, "link_id": "t3_g5fyvm", "parent_id": "t3_g5fyvm", "score": 4, "stickied": false, "subreddit_id": "t5_2xtuc", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fo4z8z5", "collapsed": false, "permalink": "/r/AskDocs/comments/g5fyvm/my_very_smart_dad_has_recently_started_reading/fo4z8z5/"}