{"author": {"comment_karma": 7601, "created_utc": 1556918831.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_FF8717.png", "id": "3dewjx0s", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1991, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF8717", "user_is_muted": null, "display_name": "u_Kali_Kopta", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_FF8717.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Kali_Kopta", "key_color": "", "name": "t5_10tpnd", "is_default_banner": true, "url": "/user/Kali_Kopta/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Kali_Kopta"}, "body": "No, people are entitled to hold whatever opinion they like. Opinions aren't the problem. The problem starts when people are unable to discern between their opinions, and facts.  Despite all the evidence that Earth is round, some people are still of the opinion that the Earth is flat. They absolutely are entitled to think that. Even though they're wrong, and they've been told that they're wrong, and even shown how they're wrong, they are STILL entitled to have whatever the fuck they like opinions. It doesn't change anything. So there's a bunch of Luddites running round saying that the Earth is flat. So what? It doesn't matter. If they manage to convince a bunch of other people to believe the Earth is flat, so what? If they manage to convince, idk, 80% of the population that the Earth is flat, so what? Just because they're wrong isn't a good enough reason to deny people their opinions. We're allowed to be wrong. Even if everyone in the World believed the Earth was flat, it would still be a globe. And everyone would be wrong. Except you. You're entitled to be right. Your opinion is 100% correct. But its still just your opinion. It may well be fully supported by factual data and evidence, and you can empirically prove it, that doesn't matter. \n\nAre you entitled to have the only correct opinion in the World? Yes. Yes you are. Because its only opinion. It only matters to YOU. By removing people's entitlement to opinions, you are removing their right to become better informed. You can only try to get them to change their opinions with facts. If they still refuse, they're stupid. If they persuede you to change your informed opinion, then you're stupid. People are stupid. The Earth is still a globe. But you know what? It's flat enough to live comfortably on, and we don't all have to walk up and down bloody hills all day long.  We need flat earth down here to live on. We need globe Earth when we're in Space. Both models are there, people will just use whatever they like to believe. But hey, that's just my opinion.", "created_utc": 1587241901.0, "distinguished": null, "id": "fnthqxe", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnt5edx", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnthqxe", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnthqxe/"}