{"author": {"comment_karma": 7123, "created_utc": 1476731526.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_1ai5um/styles/profileIcon_nydouhu2so841.jpeg?width=256&height=256&crop=256:256,smart&s=60cb5a312067a909f514bb671de71fc9632f1162", "id": "1270kk", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 151, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_1ai5um/styles/profileBanner_8x3xxc75to841.jpeg?width=1280&height=384&crop=1280:384,smart&s=9ba27564be414757f19ecb712221c7b16b65b3ed", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_Tschoz", "header_img": null, "title": "your wive‘s boyfriend", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_1ai5um/styles/profileIcon_nydouhu2so841.jpeg?width=256&height=256&crop=256:256,smart&s=60cb5a312067a909f514bb671de71fc9632f1162", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/Tschoz", "key_color": "", "name": "t5_1ai5um", "is_default_banner": false, "url": "/user/Tschoz/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "neo-absolutist turbo-syndicalist hegelian transhumanist lolbertarian and anarcho-capitalist anti-interventionist ultra-isolationist accelerationist technocrat. groypers, /pol/tards and /x/shizos gtfo.", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Tschoz"}, "body": "Well, without dwelling in on local ISPs, regional ISPs, NSP and NAP, the basic gist is that your computer connects to a router via HTTP-requests (and TCP-sockets under the hood) and DNS. A bunch of dedicated (or virtual machines) receive an internal IP within a network. To delegate specific requests from the router which serves as the access point to the internet, to the corresponding machine, you configure which request is supposed to made to which machine with the specific IP-adress and port. Your router has an IP adress as well (ignoring gateway and subnet) which serves as an external public IP adress on the internet. What I described are basically what websites are made of (leaving out things like persistence through databases and filesystems, webserver-software, backend, frontend, etc.).\n\nIf someone wants to visit your website, he doesn't wants to type in the external IP of your router, he wants to type in [iamadouche.com](https://iamadouche.com), but how does your PC know which IP is connected to the hostname [iamadouche.com](https://iamadouche.com)? Via DNS. DNS is a complex topic in itself, but let's just say that DNS (short for Domain Name Systen) allows your PC to know that [iamdouche.com](https://iamdouche.com) points to the public IP adress 84.89.133.050. Your PC or router doesn't actualy has to stem this task by itself, (although your router typically does have a DNS cache) there are ISP nodes all around the globe that cache these connections of all the domains, but it's not just ISPs that utilize DNS servers. Google for example also has a one (8.8.8.8). If you do not pay for a static public IPv4-adress (since free ones are scarce) and you don't use the abundantl available IPv6-adresses, you have keep the DNS updated, many webservers use Dynamic DNS for this purpose, to regurlarly update the name server with the correct IP adress (since these are subject to change, from anywhere from 2 to 14 days by your ISP).\n\nThere is a lot of information left out in between these steps (networks might also have switches or you might use a reverse proxy (which you typically use if you have multiple machines (for load balancing purposes for example))), but this is the basic gist of it.\n\nEDIT: Removed my insults at the beginning, as to not upset your delicate pride", "created_utc": 1586987123.0, "distinguished": null, "id": "fnivkj8", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fniqzn3", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586987683.0, "name": "t1_fnivkj8", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fnivkj8/"}