{"author": {"comment_karma": 2083, "created_utc": 1584736156.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_7E53C1.png", "id": "5zfymqn4", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 9, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#7E53C1", "user_is_muted": null, "display_name": "u_TuentinQuarantino", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_7E53C1.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TuentinQuarantino", "key_color": "", "name": "t5_2i8axg", "is_default_banner": true, "url": "/user/TuentinQuarantino/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TuentinQuarantino"}, "body": "You don't seem to be listening or arguing in terribly great capacity here.\n\nYou're comparing total sector power outages to... a few hooligans burning individual towers. To repeat myself on that note, and to distinguish between taking down the entire power grid/cell infrastructure and a single tower disturbance:\n\n>Cell infrastructure has a lot of redundancies typically. Rarely is an individual only capable of connecting to a single tower, particularly for 911 calls which allow you to use any carrier's tower not just your own.\n\nAs to your middle-of-nowhere, AZ anecdote, you clearly just ignored where I said:\n\n> In some extremely rural cases I suppose this could be a concern, but I would not generalize a massive expansion of domestic terrorism laws over a few exceptional cases. \n\nTo add, this is not evidence the individual did not have 911 access, which as I mentioned is available cross-carrier, just that her regular cellular access was down. They may still have been able to make a 911 call. At any rate, it is a very marginal concern when the vast, vast majority of people live in areas with multiple cell access points and networks within reach.\n\nTo the heart of the matter, again ignoring your egotistical insults that speak to your inability to hold a civil conversation:\n\n>But they ABSOLUTELY should make laws that label damage to an public service as an act of terrorism. Its do different from blowing up a power plant, hospital, water tower, or fire dept. \n\nHow is this terrorism when they aren't even attempting to terrorize people? Cite where public terror is their outcome and not simply civil disobedience and removal of what they (incorrectly) consider a direct personal and community health risk. Your demands for terrorism laws don't even make sense under the actual definition of terrorism. They are an obscene expansion of terrorism law in the domestic sphere, which is universally an assault on democratic norms. Over nothing that current laws can't handle at that.\n\nTo your last point:\n\n>I'd like to know why you want to defend peoples right to destroy\n\nI have repeatedly stated that these people should be brought up under the myriad laws already in place to deal with assault, vandalism, arson, etc. This is called \"arguing in bad faith\". I'm sure it makes you feel empowered and smarter than everyone else, but it is a hollow victory that only places your intellectual impoverishment on full display. I gain nothing from arguing further with you, you gain nothing as you won't even consider the other side or challenge yourself, and all sides and any audience simply loses for participating.\n\nOn that note, I am done. Good luck to you.", "created_utc": 1588983396.0, "distinguished": null, "id": "fpxirl6", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpw3wvn", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpxirl6", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpxirl6/"}