{"author": {"comment_karma": 2186, "created_utc": 1426279151.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_FFB000.png", "id": "m4v5w", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 72, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#FFB000", "user_is_muted": null, "display_name": "u_agreatcatsby", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_FFB000.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/agreatcatsby", "key_color": "", "name": "t5_bbllb", "is_default_banner": true, "url": "/user/agreatcatsby/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "agreatcatsby"}, "body": "You seem to have a misunderstanding as to the law of attempts. Attempted crimes are punishable as thought the primary offence were committed, if an act more than merely preparatory to the commission of the offence were carried out.\n\n> Knowledge of his condition as deadl would be attempted murder. \n\nNope. The definition of murder is traditionally as\n\n>*Coke - Institutes of the Law of England*  \n>  \n>\"when a man of sound memory, and of the age of discretion, unlawfully killeth within any country of the realm any reasonable creature in rerum natura under the King’s peace, with malice aforethought, either expressed by the party or implied by law, so as the party wounded, or hurt, etc. die of the wound or hurt, etc. within a year and a day after the same.\"\n\nThe mens rea of murder is the \"malice aforethought\", but this is a technical term divorced from it's colloquial meaning. The offendor need have no particular \"malice\" towards the victim. In fact, the House of Lords in *Maloney \\[1985\\] AC 905* confirmed that \"malice aforethought\" simply means \"intention\". \n\nIntention has the meaning given to it in *Woolin \\[1999\\] AC 82* in which Lord Steyn explained that\n\n>\"Where the charge is murder and in the rare cases where the simple direction (NB: the simple direction is that the defendent must have actively intended the victim's death) is not enough, the jury should be directed that they are not entitled to find the necessary intention, unless they feel sure that death or serious bodily harm was a virtual certainty (barring some unforeseen intervention) as a result of the defendant's actions and that the defendant appreciated that such was the case.\"\n\nThe difficulty in proving someone's mental state is an issue for the prosecution to persuade the Jury beyond reasonable doubt that the defendent held that mental state. Of course, we can't read someone's mind, but that's entirely different to the substance of the law. \n\nThe mens rea for an attempt of a crime is the same of the primary offence. If the defendent is shown to have intended to kill someone (or to have done an act where death would be a virtual certainty (barring some unforeseen intervention) and D appreceiated this was the case then an attempt could be made out. However, if the mens rea (ie intention) was not present then it simply couldn't be an attempt of the principal offence.\n\nOf course, you may have a separate understanding of Canadian law but a) given the common law shared history it seems unlikely that there would be such a fundamental divergence as this and b) given the offence was in England, Canadian law doesn't seem to be of that much relevance...", "created_utc": 1588925617.0, "distinguished": null, "id": "fpuvywv", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpusxo2", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpuvywv", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpuvywv/"}