{"author": {"comment_karma": 31533, "created_utc": 1432574252.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_EA0027.png", "id": "npdek", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 536, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#EA0027", "user_is_muted": null, "display_name": "u_Oilers93", "header_img": null, "title": "Seveneighty", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_EA0027.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Oilers93", "key_color": "", "name": "t5_3kia9", "is_default_banner": true, "url": "/user/Oilers93/", "banner_size": null, "user_is_moderator": null, "public_description": "Just a dude playing a dude disguised as another dude", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Oilers93"}, "body": "No, there is no truth behind it. This is going to be a long post, but stick with it because it's going to give you a better understanding of what's going on. The anti-5G community is hardcore conspiracy theorists, and they will twist any mainstream topic into fuel for their tire fire. What started as \"5G causes cancer\" has evolved into \"5G causes COVID19\". It's the pinnacle of the Dunning Kruger Effect. I'm not even going to cover the 5G COVID theory, **it's that absurd**. I'm going to cover the \"5G Causes Adverse Health Effects\" to help you grasp just how absurd these claims are. \n\nThe leading research body against 5G is the [EMF appeal](https://www.jrseco.com/wp-content/uploads/2017-09-13-Scientist-Appeal-5G-Moratorium.pdf) which is often cited by conspiracy theorists as an attempt to legitimize their argument. So, just as a thought experiment for myself, I decided to dig into this 5G appeal. As part of an exercise to substantiate the legitimacy, I decided to read the appeal and read some of the studies cited within. The first thing I did was scrolled to the signatories, and researched the very first person listed in my home country of Canada. What did I find on Dr. Magda Havas? Let's start there.  \nSome background on Magda Havas? “Dr. Magda Havas, Professor, Trent University”, gives us three strong indicators that turn off our safeguards against unconditionally accepting someone’s opinion: she has a Ph. D., she is a professor and she works at a university. For most people that is enough to accept her credibility, especially when she talks about radiation, a subject we instinctively fear and concerns something highly abstract. However, upon further research, her Ph. D. is in **botany**, giving her no qualifications in the field of medicine or physics. In fact, [this article](https://evilcyber.com/the-rest/havas-wifi-research/) delves in this more, citing a critical response to her theory that WiFi causes adverse health effects from her own colleagues in the Department of Physics at her very own Trent University. \n\nThen, back in 2012, the Office of Science and Society from McGill University found serious inconsistencies with her study on WiFi signals causing heart irregularities. Lorne Trottier, MSc in Electrical Engineering at McGill University, teamed up with Dr. Joe Schwarcz the Director of McGill's Office of Science and Society, and Dr. David Langleben the head of cardiology at the esteemed Montreal Jewish General Hospital attempted to challenge the study published by Havas, and went as far as [Challenging Dr. Havas to replicate her findings by conducting an independent double blind experiment](http://www.emfandhealth.com/Havas%20Challenge.html). Dr. Havas declined the invitation and even doubled down on her theory by claiming that Trottier had ulterior motives due to the personal company he owns which manufactures video cards. She wrongly accuses him of having stake in WiFi devices, which he points out his company [doesn't even make](https://matrox.com/en/). Even so, this experiment would be double blind, which would ensure the findings prove nothing but truth.  \n\nSo, **to conclude, it appears the signatories on this EMF appeal is utter garbage.** But let's forget that. Let's look at the studies themselves and form our own opinion.  \nSo the next thing I did was select a random study linked in the article. The article I selected was [the report that claims to prove a significant increase in cancer among animals exposed to EMF](https://link.springer.com/article/10.1007/s10669-011-9307-z). If you scroll down to appendix G, the section responsible for critical analysis of the study, you can find the following quotes by various reviewers:  \n*\"Summary: I am unable to accept the authors’ conclusions.\"* - Michael S Lauer, MD (OER)  \n*\"I think additional experiments are\nneeded to assess if the incidence\tof brain gliomas in male rats exposed to GSM- or CDMA-modulated RFR is significantly higher than\tthe control\tgroup or not.\"*  - Maxwell P. Lee, Ph.D.  \nLast but not least, the final reviewer, R. Mark Simpson, D.V.M., Ph.D., explains in depth the study limitations and inconsistencies within the study itself. He raises several concerns with statistical analysis and historical data. The study was *littered* with false positive results, and to my knowledge these false positives and testing inconsistencies have not been remedied.  \nInterestingly enough, the study showed that females weren't affected and the male rats that were exposed [actually lived longer](https://www.cancer.org/cancer/cancer-causes/radiation-exposure/cellular-phone-towers.html). So not only are they citing garbage references, these references don't even conclude what they want it too.  \nSo, **to conclude, the research is founded on utter garbage**.  \n\nI know this response is getting long and I might have lost you, so let me summarize. There is *no evidence that 5G has any negative health affects*. If you'd like to extrapolate that and say that \"not enough research has been done\", then I'd like to say this: Proving no effect is impossible, and any such proof would be immediately invalidated the moment the most minute thing was added to the equation. “Well, we know cell phones 100% do NOT kill us. Ok sorry, we just got an increase of 0.00003ppm of neon in the atmosphere. We now must prove that it is still safe now that conditions have changed.” This is evidently apparent when in vitro studies show a marginal change (that is cellular permeability) that is irrelevant to us as humans.\n\nYou can’t prove a negative as the adage goes. If there is a risk, it will be a liability for a company. Citizen science is at an all time high. If there are negative effects, the truth will come out, and the companies who installed it will be liable.\n\nIf nothing else, trust the inherently litigious American soul to ensure things are all ok. If you think the government will use 5G towers to track you, fine, but understand that they can do the exact same thing with the towers already in place.", "created_utc": 1586965349.0, "distinguished": null, "id": "fnhn04s", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fngq117", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586965568.0, "name": "t1_fnhn04s", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fnhn04s/"}