{"author": {"comment_karma": 3047, "created_utc": 1495720526.0, "has_verified_email": true, "icon_img": "https://a.thumbs.redditmedia.com/ojRxvpxe9zVDFIElaEP9LMmmG12MuHyvj7Xc00SsRN4.png", "id": "24adwmo", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 10383, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://b.thumbs.redditmedia.com/JRAHDatWIKfDY9kl8s3BBoGDQxMxBrvPneJRlpagKWE.png", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_Abel_A_Kay", "header_img": null, "title": "Abel_A_Kay", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://a.thumbs.redditmedia.com/ojRxvpxe9zVDFIElaEP9LMmmG12MuHyvj7Xc00SsRN4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/Abel_A_Kay", "key_color": "", "name": "t5_3l7nu", "is_default_banner": false, "url": "/user/Abel_A_Kay/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "Writer. Podcaster. Author. Illustrator and coder. Nutella monster.", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Abel_A_Kay"}, "body": "My thoughts about what freedom in a country means, are quite simple.\n\nI lived 12 years in **Germany**, then 13 years in **Argentina**, then 3 years working on cruise ships (didn't have a home country, really), then 20 years in **Miami, Florida**, and now 9 years in **China**. That's 55. My age.\n\nSo... Germany, Argentina, USA and China.\n\nPlease add **Croatia** to these four countries because BOTH my parents were from there, I speak Croatian perfectly (albeit with a funny accent because I never went to school there), and I went to visit relatives a few times. I need to add that I was 29 the very first time I set foot on Croatian soil.\n\nAnyways... Germany, Argentina, USA, China, and Croatia. And yes, I speak all five languages, and I podcast in three of them.\n\nNow...\n\n* If I can go to Germany (that's where I was born), and if I can go the main square of (let's say) Berlin, and if I can stand there for eight hours holding a A3 size paper (not A4, that's too small) that says \"I disagree with Angela Merkel's work,\" and if nothing will happen to me, then that's a free country.\n* Can I do that in Croatia? Yes, in fact,  I did exactly that in Zagreb, in the year 2006, just for testing purposes, together with a friend. People laughed while passing by, and one Bosnian drunkard wanted to drag me off to some bar, but otherwise I was unscathed. And that was 10 years after the Balkan War ended.\n* Can I do that in Argentina? Yes, but people would look at me suspiciously, and police might \"push\" me to a side, under the pretext that I might be causing businesses to lose money. You know, less eyeballs for their storefront windows, because people would be looking at me. But of course nobody would put me in jail.\n* Can I do that in the USA? Stand there with a sign, that says something bad about Trump? Yes. In fact, the answer is \"DOOOOH\" even though I left the US forever, because I personally think the American mentality has become too rotten. But of course I would have freedom to do that.\n* Can I do that in China? No way. Here is the thing. I would NOT get arrested personally, because of being a foreigner, but I would put in jeopardy my wife, my daughter, and even my wife's parents. They would probably tell me to leave, in a strict manner, and if I insisted, yes - they would put me in a police car, and drive me to the police station, to get picked up by my wife. But no jail time. If I was Chinese, there would be jail time (no doubt).\n\nNow, ask yourself this. Can you post on Twitter, or your own country's most popular social network, that your president is doing a bad job?\n\nIf you can prive that you can do this about your president, then I will believe your country's Coronavirus official numbers, whatever they are.\n\nIf not, don't expect me to do it.\n\nI have to admit one thing about Turkmenistan. \n\nIt is INDEED possible that a country like Turkmenistan has zero cases of Coronavirus. Yes, it is entirely possible, but ONLY is that country's credibility is at a good standing. If your country's freedom indexes are low, then that is NOT possible in my mind. \n\nIn other words, I will believe a man, as  long as this man's reputation is sound.\n\nTurkmenistan's standing in the world is low in Freedom of Expression, Freedom of Religion, and many other freedoms which even a country like the USA give their citizen without even thinking about it. \n\nAnd if you think those freedom indexes are not the right way to measure things, let's agree and do something else.\n\nLet us stand at the main square of Ashgabat (the capital of Turkmenistan), you and me together. \n\nLet us hold a big paper each, saying that President Gurbanguly Berdymukhamedov's work has been really bad. \n\nDo you think they will let me stay there for 8 hours, like in Germany, the US, Argentina, and Croatia?\n\nIn the meantime, my position about Turkmenistan has not changed. Sorry, not being ignorant here, and definitely not being pro-west (I left the US!).\n\nCordially,  \nAbel A Kay  \n(Host of the podcasts \"The Tale of Rome\" and \"El Cuento de Roma\")", "created_utc": 1587290500.0, "distinguished": null, "id": "fnvepm0", "is_submitter": true, "link_id": "t3_g3pfps", "parent_id": "t3_g3pfps", "score": 5, "stickied": false, "subreddit_id": "t5_3l7nu", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnvepm0", "collapsed": false, "permalink": "/r/u_Abel_A_Kay/comments/g3pfps/update_april_18_2020_the_day_spain_passed_20k/fnvepm0/"}