{"author": {"comment_karma": 105247, "created_utc": 1469938968.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_1c5k0c/styles/profileIcon_e6n7f9odfzh41.jpg?width=256&height=256&crop=256:256,smart&s=aa0271218327d500a804b511985193c8c824f4e5", "id": "zz512", "is_employee": false, "is_mod": true, "is_gold": true, "has_subscribed": true, "link_karma": 55527, "subreddit": {"default_set": false, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_1c5k0c/styles/profileBanner_1ze3du5w3wf31.jpg?width=1280&height=384&crop=1280:384,smart&s=17bb51ea2b53b21d880487c7f1323ab7917e5b2b", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_Kujo17", "header_img": null, "title": "K. Daniel", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_1c5k0c/styles/profileIcon_e6n7f9odfzh41.jpg?width=256&height=256&crop=256:256,smart&s=aa0271218327d500a804b511985193c8c824f4e5", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/Kujo17", "key_color": "", "name": "t5_1c5k0c", "is_default_banner": false, "url": "/user/Kujo17/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "\n\n@kujo1017 twitter mainly for personal and CVnews\n\nIf you're following for music Twitter is @Kujo19290176", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Kujo17"}, "clicked": false, "created_utc": 1586133469.0, "distinguished": null, "edited": false, "id": "fvouub", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_fvouub", "num_comments": 3, "over_18": false, "score": 7, "downs": 0, "title": "Tiger tests positive for coronavirus at Bronx Zoo, first known case in the world; The big cat is the first known case of a non-domesticated animal with COVID-19 symptoms—and is one of seven sick tigers at the New York zoo.", "view_count": null, "media": null, "url": "https://www.reddit.com/r/cvnews/comments/fvouub/tiger_tests_positive_for_coronavirus_at_bronx_zoo/", "permalink": "/r/cvnews/comments/fvouub/tiger_tests_positive_for_coronavirus_at_bronx_zoo/", "selftext": "[Source National Geographic ](https://www.nationalgeographic.com/animals/2020/04/tiger-coronavirus-covid19-positive-test-bronx-zoo/) **this article is posted in full, please note to view the article via this link one must agree to receive their free newsletter 🤷‍♂️***\n\n\nA TIGER AT the Bronx Zoo in New York City has tested positive for the virus that causes COVID-19, and six other big cats are exhibiting symptoms consistent with the illness, the U.S. Department of Agriculture announced Sunday afternoon.\n\n“It’s the first time, to our knowledge, that a [wild] animal has gotten sick from COVID-19 from a person,” says Paul Calle, chief veterinarian for the Bronx Zoo. The Malayan tiger, named Nadia, likely contracted the coronavirus from an infected—but unknown—asymptomatic zookeeper. “It’s the only thing that makes sense,” Calle says. The zoo has been closed to visitors since March 16.\n\nSeveral domestic animals had previously tested positive for SARS-CoV-2, the virus that causes COVID-19, including a Pomeranian and a German shepherd in Hong Kong, a domestic cat in Belgium.\n\nCats, both wild and domestic, are susceptible to feline coronavirus, but until recently, it was unknown whether they could contract SARS-CoV-2. A new Chinese study has found that cats may be able to infect each other, and scientists are rushing to learn what other speciesmay be able to be infected by it.\n\n##A world first at the Bronx Zoo\n\nAfter developing a dry cough in late March, the four-year-old Malayan tiger, Nadia, was tested for the virus on April 2, according to Calle. Nadia’s sister, two Siberian tigers, and three African lions have also had coughs and a loss of appetite, though they have not been tested. The zoo has the seven cats under veterinary care and expects them to recover, Calle says, though the Wildlife Conservation Society, the nonprofit that runs the Bronx Zoo, cautioned in a news release that it’s unknown how the disease might progress in animals.\n\nWhen Nadia started showing symptoms, the veterinary team did a number of diagnostic tests and blood work. “Considering what’s going on in New York City, we of course did the COVID testing,” Calle says. The team conducted the test on-site at the zoo, after sedating Nadia. They sent the samples for testing to the New York State Diagnostic Laboratory at Cornell University and the samples University of Illinois College of Veterinary Medicine Veterinary Diagnostic Laboratory.\n\nAccording to the USDA and the Centers for Disease Control and Prevention, there is currently no evidence that domestic or captive wild animals can spread the novel coronavirus to people. (It’s believed the virus infecting humans likely developed from a very closely related coronavirus found in bats.)\n\n##What’s next?\n\nThis is all completely new, Calle says, so there are many unanswered questions, including whether tigers and lions are more susceptible to coronavirus than other animals. None of the zoo’s other big cats, including snow leopards, cheetahs, a clouded leopard, an Amur leopard, and a puma are showing symptoms.\n\nZookeepers around the country have been making extra efforts to protect great apes in their care, as great apes can easily catch respiratory illnesses from humans. Experts have warned that they may be particularly susceptible to coronavirus.\n\nThe Bronx Zoo team is going to be sharing the diagnostic information widely with the zoo and scientific community, Calle says. “I suspect that there are other cases, and now that we’re sharing this information I have a hunch other likely cases will turn up.”\n\nJohn Goodrich, chief scientist and tiger program director at Panthera, a global big cat conservation organization, is concerned for wild tiger populations. “Big cats like tigers and lions are already facing a litany of threats to their survival in the wild. If COVID-19 jumps to wild big cat populations and becomes a significant cause of mortality, the virus could develop into a very serious concern for the future of these species.”", "stickied": false}