{"author": {"comment_karma": 188633, "created_utc": 1428810318.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_DB0064.png", "id": "muu8f", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 12075, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DB0064", "user_is_muted": null, "display_name": "u_Sorcatarius", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_DB0064.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Sorcatarius", "key_color": "", "name": "t5_evil9", "is_default_banner": true, "url": "/user/Sorcatarius/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Sorcatarius"}, "body": "I've dont first aid training about 14 times since I was 12, I was very familliar with triage and the fact that some emergencies are just more of an emergency from a young age.\n\nFew years ago I took Urban Search and rescue and prepared to glaze my eyes over when triage came up, until the started going into level 4. For those unfamiliar with SAR triage, the first 3 levels are very similar to standard first aid. \n\nGreen, these people are generally ambulatory, injuries minor enough that you can grab them and bring them back during a buildings initial sweep with no work. Yellow are more severe, some work will be necessary, but these people are also generally reasonably quick to patch up and get out of danger. Red is very severe, compound fracture, under rubble, need to be strapped into a KED to be removed from the building and carried over unstable ground, etc. These people are people who probably won't make it without aid.\n\nAn interesting point of difference is the triage for SAR works in reverse of normal triage. There was just an earthquake, you're worried about aftershocks and building collapses. Your priority is to save as many as possible, for that reason you start at green and work your way to red as resources and manpower allow. There's an ongoing threat, time is a factor and you need to make hard decisions on who to save. \n\nSo what's this fourth level? Black. This is the \"if you're not dead yet, let me know if you want me to pass a message on for you\" level. This person has been disemboweled and has no pulse. Black. Theres more blood outside them than inside them. Black. Why are your legs over there and your torso over here? Black. I know you're alive, because I can literally see your heart still beating. Black.\n\nI'm willing to bet right now they're working on a triage similar to SAR. The disease is running out of control and while a good doctor could probably save these older people, how much time and resources is it going to take up? Who else may die in the process?\n\nI am not envious of the person who made that call in the slightest.", "created_utc": 1584257968.0, "distinguished": null, "id": "fkjsqlp", "is_submitter": false, "link_id": "t3_fisiy7", "parent_id": "t1_fkiz9wn", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkjsqlp", "collapsed": false, "permalink": "/r/worldnews/comments/fisiy7/italians_over_80_will_be_left_to_die_as_country/fkjsqlp/"}