{"author": {"comment_karma": 45466, "created_utc": 1562755844.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_24A0ED.png", "id": "44fqmcws", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#24A0ED", "user_is_muted": null, "display_name": "u_ZombieDemocracy", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_24A0ED.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ZombieDemocracy", "key_color": "", "name": "t5_1o1y4t", "is_default_banner": true, "url": "/user/ZombieDemocracy/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ZombieDemocracy"}, "body": "Yeah herd immunity is a f****** horrible idea! you have no idea what levels of immunity this virus will actually produce in the human body so betting on any type of immunity is an especially stupid idea especially if it involves like allowing people to get infected more easily. It's reasonable to think that resistance might only last 4 months even in a healthy person. that does not give you a particularly long window of immunity to get the situation under control before exposing the rest to your high-risk people who didn't get caught up in the first wave. \n\nYou need to pay the high-risk people to stay home and enforce that by law and employer threats.\n\nThat's the most practical way to not overwhelm your healthcare system but of course you can't wait until you've already overwhelmed your healthcare system and expect the same kind of results.\n\nhowever even once you have overwhelmed your health care system you can probably still benefit from trying to compartmentalize the smaller side of the demographics that are the high risk demographics and this way the healthier people can be more or less put in the front line and they can keep everything running and they can self quarantine and get paid sick leave. \n\nThe difference is when the healthy people get sick they recover much faster and they use far less hospital resources in order to recover. The higher risk people will use an amazing amount more of your healthcare resources. They don't just use twice as much of your health care resource. They're going to probably use like 5 to 10 times as much.\n\nAnd of course some of the seemingly low-risk people will not turn out to be low-risk and will get seriously ill and face permanent damage. We have no way to know exactly who is highest risk so It's not a perfect plan but once you fail to contain the outbreak and it's in your country in a community spread fashion I think that's one of your better bets.\n\nIt's pretty simple risk assessment, you take the most vulnerable part of the population and you stash them away from harm and then you use the lowest risk to lead the charge. It's hardly a new idea.", "created_utc": 1584260135.0, "distinguished": null, "id": "fkjueml", "is_submitter": false, "link_id": "t3_fisiy7", "parent_id": "t3_fisiy7", "score": -1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkjueml", "collapsed": false, "permalink": "/r/worldnews/comments/fisiy7/italians_over_80_will_be_left_to_die_as_country/fkjueml/"}