{"author": {"comment_karma": 2524, "created_utc": 1542832544.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_ro0xu/styles/profileIcon_wnugzrukz6841.jpg?width=256&height=256&crop=256:256,smart&s=0bc73821bacc0689ba10b0be6df4239c169fec66", "id": "2n67l9qv", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": false, "link_karma": 1559, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_ro0xu/styles/profileBanner_56tf1b4107841.jpg?width=1280&height=384&crop=1280:384,smart&s=ec9783851a646ee6826bd108c87d1b2048293e00", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_Saturn_Dog", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_ro0xu/styles/profileIcon_wnugzrukz6841.jpg?width=256&height=256&crop=256:256,smart&s=0bc73821bacc0689ba10b0be6df4239c169fec66", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/Saturn_Dog", "key_color": "", "name": "t5_ro0xu", "is_default_banner": false, "url": "/user/Saturn_Dog/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "a", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Saturn_Dog"}, "body": "The problem lies in the Five Stars Movement.\n\nThe Five Stars were elected as a big \"FOOK U\" to our shitty political class and got a 30% majority as a lone party but Salvini's Lega got a fine result as well: alone he was just around 17% but his center right coalition got around 33/35% if i remember correctly.  \n\nUltimately, we ended up with an ill-fated alliance between Lega and the 5 Stars in order to prevent the Democrats from governing again even if they were the losers: out President is supposed to be impartial but he was not, he was clearly a Democrat and wanted to make another caretaker government with Democrats in. Basically, we were \"blackmailed\" and \"held hostage\" by our own President.\n\nThe Five Stars, though, were the majority in this \"alliance\" and had much of the decisional power, despite the \"government contract\" they wrote with the Lega, and ultimately chose this seemingly good man called Conte who taught law in universities as Prime Minister. (much later, it has been discovered his professorship has been a sham because of cronies when he got the job but he's umpunished because of Italian's crippled justice not doing its job).\n\nThings were going fine but when the Five Stars started to lose popularity and Salvini gained it instead, they started boycotting anything Salvini was trying to do, even if it was written in their contract. Even Conte started being hostile to Salvini, foreshadowing his immense falsehood and opportunism (not that Salvini was a saint, though) but when Salvini decided to break up with the Five Stars wanting to get new elections, but there have been a bunch of flip-flops and they, together with Conte, decided to make a semi-unelected government with the Italian Democrats (the \"PD\"), which is basically the full estabilishment party of the country (and a bunch of criminals, i add). All of this because the Five Stars DIDN'T WANT TO LOSE THEIR JOB, because they knew they would lose it if we got back to elections as Salvini hoped prior.\n\nAnd so, here we hare, the only elected party here is the Five Stars movement, now irrelevant everywhere, the rest are completely unelected: Democrats lost the election and **NOBODY, LITERALLY NOBODY** elected Conte, we got this man as PM only because the Five Stars decided so. To not mention that the Five Stars leader resigned as leader (but not as Foreign Minister). The Five Stars became the Democrats' bitches and are obeying at anything the Democrats want.\n\nThis is the super shitty situation italian people never asked for. This is all thanks to the founders of the Italian Republic, who were a mix of Christian Democrats and Communists who were afraid of a return of Fascism. They gave us a deeply flawed system, a poor excuse of a constitution that doesn't even protect people's individual freedoms (for example, the first article is utterly pointless and some other articles protect free speech \"unless laws decide otherwise\") and now have to live with all of this bullshit. This is why almost no government lasted more than five years. Most of these politicians have also adopted austerity and socialist policies, and that's one of the many reasons we're in deep shit now, and many people don't even realize it because this fucking shit of a political system is all they know.\n\nAnd then some snobs are surprised people shift to the right. Even if, in my opinion, it's not about being left or right but it's about being liberal or authoritarian... and most of these politicians have been authoritarian assholes. Only a serious leader could change this system but i think not even Salvini is like that, despite having some good ideas.\n\nI'm getting more pessimistic day after day, Italy is done for, politically. It's a funcioning country not thanks to politics, but \"despite\" politics.", "created_utc": 1584391470.0, "distinguished": null, "id": "fkooeb6", "is_submitter": false, "link_id": "t3_fjfdnq", "parent_id": "t1_fknx0jv", "score": 7, "stickied": false, "subreddit_id": "t5_3400v", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkooeb6", "collapsed": false, "permalink": "/r/kotakuinaction2/comments/fjfdnq/italians_over_80_will_be_left_to_die_as_country/fkooeb6/"}