{"author": {"comment_karma": 66253, "created_utc": 1420662071.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_008985.png", "id": "kkn03", "is_employee": false, "is_mod": true, "is_gold": true, "has_subscribed": true, "link_karma": 5289, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_RationalLies", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/RationalLies", "key_color": "", "name": "t5_1nfxxm", "is_default_banner": true, "url": "/user/RationalLies/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "RationalLies"}, "body": "In your email to the Dean, say you want in writing that you will be required to come to that class during these days.\n\nBUT ALSO (this is the important part) \n\nSay in your email that by requiring you to attend the class, the school is taking full financial and legal responsibility for you and anyone who you come in contact with in the event you or anyone you come in contact with get infected. \n\n*\"By requiring me to attend class during a highly infectious pandemic, despite legitimate health risks as a result, the school is knowingly accepting full financial responsibility for any medical costs incurred as a result of becoming infected with the virus, as well as the medical costs associated with anyone I come in contact with that may have been infected by me as a result, including but not limited to fellow students, staff, family members, friends, coworkers, etc.*\n\n*Failure to clearly identify the schools intentions and statement on the requirement of my physical presence in class within 24 hours of the time of this email will be construed as an agreement on the schools behalf of the aforementioned conditions. The school agrees to be held responsible for all costs incurred, including loss of wages in the event of infection. Requiring my physical presence in class during the pandemic will be considered a legal agreement on behalf of the school to pay all medical costs of myself and all parties I come in contact with, in addition to all the legal costs incurred while enforcing this contract.* \n\n*Alternatively, simply waiving me of the requirement to be physically present in class during the time of the pandemic will waive the school of any and all financial responsibility for medical, legal, or loss of wages costs in the event of my infection and the school will have absolutely no responsibility for any costs incurred.\"*\n\nThat will put an *instant* end to that shit real quick.\n\nFor bonus points, get a few of your classmates to send the email too and they'll just cancel the classes outright. \n\nUnder no circumstances will the school want to deal with that type of liability. Checkmate.", "created_utc": 1584305686.0, "distinguished": null, "id": "fklgayi", "is_submitter": false, "link_id": "t3_fisiy7", "parent_id": "t1_fkjruaw", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1584306981.0, "name": "t1_fklgayi", "collapsed": false, "permalink": "/r/worldnews/comments/fisiy7/italians_over_80_will_be_left_to_die_as_country/fklgayi/"}