{"author": {"comment_karma": 14657, "created_utc": 1510823657.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_DDBD37.png", "id": "5fiv183", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 5064, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_Cwlcymro", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Cwlcymro", "key_color": "", "name": "t5_4y54l", "is_default_banner": true, "url": "/user/Cwlcymro/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Cwlcymro"}, "body": "I don't know about your school specifically, but as a teacher I know that teachers will still have to work if/when the schools shut down as we have a duty to send work home to pupils. I've literally just finished writing an article for our government to send out to teachers with suggestions about how to get live video feed lessons and distant leaarning platforms up and running in case our country needs to shut schools.\n\nWhere you are absolutely right however is that governments need to put packages in place to help those who will lose their work/hours/business because of this. Whilst I teach one day a week, the rest of the time I run my own business and every single event I had in the diary for the next 3 months have now been cancelled. I'm one of the lucky ones that my business has no employees and no suppliers so I can cope with the iso of income without making hardship for others, but most businesses are not that lucky. \n\nAs for billionaires buying respirators, the problem is that there literally isn't any respirators available to buy right now. Every factory producing them has ramped production up as high as possible, but with every country on Earth begging to be buy the stuff it's going to take time. The UK announced last night that they will be trying to get other manufacturing factories to switch production to focus on respirators, but that sounds nearly impossible considering that the whole production line will be different. China built temporary hospitals all over the place, some countries are putting plans in place to take over private hospitals and even hotels to turn into extra hospital capacity. \n\nThis is all already happening as fast as possible in a lot of the World and the money is being spent. But what's needed right now is not more money, that's already being provided. It's time that needed. We need to slow the disease down so we can build up hospital capacity, so the factories can produce more and more respirators, so researchers can work out which antibiotics help and which would make thinks worse. And that's why all of our lives are being disrupted, to buy time. I know it sucks. I know it's going to cause so much hardship for so many people. But we need to buy time, desperately.", "created_utc": 1584265325.0, "distinguished": null, "id": "fkjyb87", "is_submitter": false, "link_id": "t3_fisiy7", "parent_id": "t1_fkjxh9f", "score": 2, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkjyb87", "collapsed": false, "permalink": "/r/worldnews/comments/fisiy7/italians_over_80_will_be_left_to_die_as_country/fkjyb87/"}