{"author": {"comment_karma": 2524, "created_utc": 1542832544.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_ro0xu/styles/profileIcon_wnugzrukz6841.jpg?width=256&height=256&crop=256:256,smart&s=0bc73821bacc0689ba10b0be6df4239c169fec66", "id": "2n67l9qv", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": false, "link_karma": 1559, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_ro0xu/styles/profileBanner_56tf1b4107841.jpg?width=1280&height=384&crop=1280:384,smart&s=ec9783851a646ee6826bd108c87d1b2048293e00", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_Saturn_Dog", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_ro0xu/styles/profileIcon_wnugzrukz6841.jpg?width=256&height=256&crop=256:256,smart&s=0bc73821bacc0689ba10b0be6df4239c169fec66", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/Saturn_Dog", "key_color": "", "name": "t5_ro0xu", "is_default_banner": false, "url": "/user/Saturn_Dog/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "a", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Saturn_Dog"}, "body": "Italian here. Not a Trump lover, more like someone who hates \"demonrats\" to death, for all the evil they've done in the world. I think they are far left nutjobs in the clothes of center left moderates.\n\nThe main problem isn't even \"socialized medicine\" alone: it's **austerity**. Basically a bunch of incompetent pricks cutting on healthcare because \"the EU asked us to do this\". The result? Think, because the (supershitty and unelected) government couldn't fund it, Lombardia couldn't build a provisionary hospital in Milan, and therefore privates had to fund it instead. The Gov also sent hospital useless rags in place of masks because they were lacking proper ones ([photo](https://i.imgur.com/CjxD5Bs.jpg)), and some help was sent by China (anyone believing this is philanthropy is a fool). \n\nTo not mention the Government acting like a fucking police state, and we aren't even minding it. Yes, Trump is doing the Quarantine as well, but i can't see him turning America into a fucking totialitarian shithole, while i can see far left assholes do that, and they're governing Italy right now. The EU, also, is showing itself its true nature: a bunch of soulless bureaucrats who leech on on other countries and that tries to ruin Italy knowing that if Italy was a healthy economy they couldn't compete with the latter. I'm talking about the french and german elite here, the lords of austerity and big banks.\n\nThere is also a deep crony sytem in Europe and, evidently, in Italy, and it's the same one that has always tried to prevent change towards a more libertarian society.\n\nThis is regardless the US system, the EU system and shit. If you see someone applying austerity for no apparent reason other than \"it's for your good\", you MUST kick that person away and never let them in politics ever again, because that person is the average EU far left politician, and it's a very dangerous and subversive one as well.\n\nLook at my posting history: it's mostly shiposting but this is too much, so i talked about this Coronavirus bullshit for a while. I really start to fear for my safety, but not because of the virus (it will eventually go away, and we should do our part anyway) but because of utterly idiotic and evil far left nutjobs governing my beautiful country without any approval of ordinary citizens.\n\nAnd this is regardless Salvini, right wing figures and similar stuff, Salvini's communication is quite stupid as well, don't think he's the best man ever. So far, politics can go fuck itself and get drained by the filthiest cesspools of hell. To not mention stupid environmentalists celebrating Coronavirus because of pollution. Fuck man.", "created_utc": 1584557239.0, "distinguished": null, "id": "fkuw46x", "is_submitter": false, "link_id": "t3_fjtjuh", "parent_id": "t3_fjtjuh", "score": 3, "stickied": false, "subreddit_id": "t5_3fuwj", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkuw46x", "collapsed": false, "permalink": "/r/AskThe_Donald/comments/fjtjuh/italians_over_80_will_be_left_to_die_as_country/fkuw46x/"}