{"author": {"comment_karma": 21028, "created_utc": 1564320334.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_46A508.png", "id": "493joj68", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46A508", "user_is_muted": null, "display_name": "u_PlayingTheWrongGame", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_46A508.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/PlayingTheWrongGame", "key_color": "", "name": "t5_225f75", "is_default_banner": true, "url": "/user/PlayingTheWrongGame/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "PlayingTheWrongGame"}, "body": "> Most other \"First World\" countries are handling COVID-19 better than us, I suspect. \n\nOkay, but exactly none of them are in a position to supplant the US financially.\n\n> China is shipping goods to other coutnries again\n\nSo is the US. China’s actually kind of up shit creek right now because of their export-focused economy. They’re giving away medical supplies because they’re well and truly fucked if the global marketplace doesn’t start buying again in a big hurry.\n\nChina is *way* more dependent on strong international exports than the US is, and coronavirus is fucking that over. \n\n> We already boosted the debt with a tax break that wasn't going to be paid for and now have at least 2 (maybe three) new stimulus packages already sent or in the pipeline.\n\nThere really isn’t any evidence the US can’t support that level of debt. Everyone panics over national debt, but governments with a strong tax base (even if they choose not to actually tax it) are extremely debt-tolerant. \n\nCertainly it would be far worse if the US were to respond with fiscal austerity right now. A high national debt-to-GDP ratio is way less dangerous than, say, freezing up the financial system. \n\n> Except when he's in charge during a global crisis and plans his policy around photo-ops for re-election rather than actually handling the crisis.\n\nThe he US has limped along through his presidency because it’s a fairly decentralized system. It remains a fairly decentralized system.\n\nLet me put it another way. Let’s suppose the worst case scenario happens, and 4% of the US population dies to coronavirus. The US still comes out of that as a global superpower. Superpowers don’t stop being superpowers simply due to the mountain of corpses they leave behind—world history is pretty clear on that part. \n\n> And Trump isn't a blithering idiot when it comes to public relations. His numbers with his base are at an all time high, I think.\n\nThere’s always a rally around the flag effect during a national crisis. Trump’s has been the weakest in history. If his rally effect has peaked now, he is fucked in November. His base can be as rabidly supportive as they like—they will still lose if Democratic turnout is even mediocre in November.", "created_utc": 1586172303.0, "distinguished": null, "id": "fmkxggl", "is_submitter": false, "link_id": "t3_fvm3sv", "parent_id": "t1_fmk52vo", "score": 1, "stickied": false, "subreddit_id": "t5_2qj8f", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmkxggl", "collapsed": false, "permalink": "/r/skeptic/comments/fvm3sv/this_is_very_scary_tiger_at_nycs_bronx_zoo_tests/fmkxggl/"}