{"author": {"comment_karma": 177918, "created_utc": 1326756256.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_FF66AC.png", "id": "6oj8y", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 4859, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_kejigoto", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/kejigoto", "key_color": "", "name": "t5_1ywi73", "is_default_banner": true, "url": "/user/kejigoto/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "kejigoto"}, "body": "I wish there was a reason or something like that for him but there isn't. Took him to the vet Monday to get his annual vaccinations, clean bill of health, heart healthy, teeth clean, gums looked great, glucose levels were excellent (he was diabetic but never an issue since I gave him insulin twice a day), all looked fine. Came home and a few days later he got sick in the middle of the night and just stayed sick. After he didn't eat that day I took him to the vet Saturday morning and dropped him off only to get updated later that day about his condition.\n\nHe was doing alright, had diarrhea, glucose and all those levels were good, blood cell count was good, nothing obviously wrong. Vet wanted to keep him overnight to monitor, have him on an IV for a medication to settle his stomach, and get him eating. Sunday rolls around and get called that he's doing better, eating now, and still has some loose stool they want to help solidify before sending him home since it's easier to medicate through IV than shoving pills down this throat.\n\nI agree and let them know I'll call Monday morning on my break to see when he's ready for pickup. Call Monday morning and I'm informed they found him dead in his kennel when they came in that morning and no one knows what happened. He was doing fine the day before and coming home to dead without explanation. Never got to say goodbye, never got to see him again, will never know what happened.\n\nLooking back on it now I feel like I was manipulated because the vet started immediately talking about costs of examining the body to determine cause and this was already expensive. Fairly certain they did something to cause his death or he wasn't improving and I was lied to the whole time. Changed vets and discovered my old vet has a problem with animals dying in the back during routine procedures with no explanation. My new vet also used to work with my old vet before she quit after being informed she wouldn't make it in this city and couldn't hack it. That was 15 years ago and she's had her own practice since. \n\nI'm 99.9% if I see the old vet again I'm going to attack him.\n\nAnd so far studies have shown dogs aren't likely to get the virus though more evidence and studies are needed as the original only tested five puppies of which two passed the cornavirus strain which causes COVID-19 in their feces while the other three didn't. Per RNA results it's not likely but mutations are definitely a possibility and canines aren't 100% ruled out as carriers. No harm in being cautious so far as minimizing animal exposure, washing hands when you come home before petting your dogs, and limiting who they are around just in case.", "created_utc": 1586154799.0, "distinguished": null, "id": "fmkh5q8", "is_submitter": false, "link_id": "t3_fvkx7k", "parent_id": "t1_fmkbzwr", "score": 1, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmkh5q8", "collapsed": false, "permalink": "/r/Coronavirus/comments/fvkx7k/bronx_zoo_says_one_of_its_tigers_has_tested/fmkh5q8/"}