{"url": "https://www.zerohedge.com/geopolitical/north-koreas-first-confirmed-coronavirus-patient-shot-dead", "text": "To loosely quote Stalin, \"No Patient Zero, No Problem.\"\n\nFor weeks, the outside world has speculated about the severity of the coronavirus outbreak in North Korea. And the entire time, North Korea has persisted in insisting that it doesn't have a coronavirus problem, even growing furious at a public offer of assistance from the State Department.\n\nFor all we know about the North Korean virus response, the government might have simply brainwashed the North Korean people into believing that loyalty to the Workers Party and Supreme Leader Kim Jong Un grants immunity to the virus. However, there have been whispers.\n\nA few weeks ago, there were whispers that one of the first coronavirus patients in the country was brutally killed by the regime after escaping from a (probably unimaginably brutal) quarantine. Moreover, according to the rumor, he was executed via the traditional North Korean punishment of extirpating criminals by shooting them with an anti-aircraft slug.\n\nNow, IB Times, a shady English-language news website with a reputation for occasionally scooping its more cautious competitors, is reporting that Kim Jong Un allegedly ordered the execution of the country's first coronavirus patient. IBT cited an anonymous twitter account called \"Secret Beijing\", claiming it has a history of reporting accurately.\n\nAccording to Secret Beijing, an anonymous social media commentator, who terms himself as an analyst on China affairs, the patient was shot dead. The story is still developing and there is still no clarity on the details of the patient executed by North Korea.\n\nThe account points out that such brutal tactics are in line with the regime's reputation.\n\nIt had been suggested last week that the patient had left quarantine to visit a public bath, and was killed for doing so. The victim caught the virus in China, then brought it back to NK. Pyongyang reportedly told the WHO that it had tested 141 suspected cases of coronavirus, and that all came up negative.\n\nThe South Korean press has reported that several cases have been identified in the North, with some of them leading to death, mirroring what's happening in Iran's obviously overwhelmed health-care system.\n\nIt's believed that fear of the virus has kept KJU from appearing in public over the past few weeks.", "images": ["https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/inline-images/KIM.PNG", "https://www.zerohedge.com/themes/zerohedge/images/live_commentary_button_big.png", "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/2020-02/KIM.PNG?itok=Z7iP06y2", "https://www.zerohedge.com/themes/zerohedge/images/logo_full.svg", "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/thumbnail/public/pictures/picture-5.jpg?itok=LY4e264-", "https://www.zerohedge.com/themes/zerohedge/images/logo_mobile.svg"], "top_img": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/2020-02/KIM.PNG?itok=Z7iP06y2", "keywords": [], "authors": [], "canonical_link": "https://www.zerohedge.com/geopolitical/north-koreas-first-confirmed-coronavirus-patient-shot-dead", "title": "North Korea's First Confirmed Coronavirus Patient Shot Dead", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@zerohedge", "description": "Reports have speculated that the man left a government quarantine to visit a public bath.", "title": "North Korea's First Confirmed Coronavirus Patient Shot Dead", "url": "https://www.zerohedge.com/geopolitical/north-koreas-first-confirmed-coronavirus-patient-shot-dead", "image": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/2020-02/KIM.PNG?itok=Z7iP06y2"}, "og": {"site_name": "Zero Hedge", "type": "Article", "url": "https://www.zerohedge.com/geopolitical/north-koreas-first-confirmed-coronavirus-patient-shot-dead", "title": "North Korea's First Confirmed Coronavirus Patient Shot Dead", "image": "https://zh-prod-1cc738ca-7d3b-4a72-b792-20bd8d8fa069.storage.googleapis.com/s3fs-public/styles/max_650x650/public/2020-02/KIM.PNG?itok=Z7iP06y2"}, "description": "Reports have speculated that the man left a government quarantine to visit a public bath.", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://www.zerohedge.com", "summary": ""}