{"url": "https://www.aljazeera.com/indepth/features/doctor-note-ibuprofen-coronavirus-worse-200316045046677.html", "text": "Don't take ibuprofen. That was the advice tweeted by France's health minister, Olivier Veran, a couple of days ago. Veran, who also happens to be a qualified doctor, wrote: \"Anti-inflammatories (ibuprofen, cortisone …) could aggravate the infection. If you have a fever, take paracetamol.\"\n\nThe infection he was speaking about was, of course, COVID-19, the coronavirus that is sparking fear and panic all around the globe. He also added that if you take this type of anti-inflammatory drug regularly, you should seek the advice of a doctor.\n\nMore Doctor's Notes:\n\nAnti-inflammatories are important drugs that are used by millions of people around the world to help treat pain, different types of arthritis, headaches, sore throats and colds.\n\nSo why should we suddenly be cautious about using them?\n\nDespite all of their beneficial effects, it has long been known that anti-inflammatories can have a depressive effect on parts of our immune systems.\n\nWhen it comes to taking them to help ease the symptoms of the common cold, we do not really have to worry about this slight but important reduction in the strength of our immune systems: We are very unlikely to develop complications from the common cold, let alone die from it.\n\nBut we need our immune system in top working order in order to battle the coronavirus and win.\n\nWhen the virus enters the human body, it induces mild to severe respiratory problems, a high fever, cough and, potentially, multi-organ dysfunction, which can lead to death.\n\nAn early part of our body's immune response to a virus of this sort is to release cells called mast cells, which form our first line of defence against the virus.\n\nThese are released very quickly from our respiratory tract - the nasal passageway and linings of the lungs.\n\nWhen the mast cells come into contact with the virus, they then trigger a much bigger immune response, which involves inflammatory chemicals being released.\n\nWe need these inflammatory chemicals to help tackle the virus in the medium to long term. It is the effectiveness of these chemicals that decides whether a person develops complications from the coronavirus or makes a full recovery.\n\nIf we take medicines that dampen this immune response, such as ibuprofen, this can lead to us not fighting off the infection as effectively, potentially leading to a longer illness with a higher risk of complications.\n\nCommonly used anti-inflammatories include ibuprofen, naproxen, diclofenac and steroids such as prednisolone.\n\nSome people rely on these medications every day to help manage crippling pain and long-term health conditions.\n\nOften anti-inflammatories are the only type of medication that can be used with some health conditions, so any changes to taking them should be discussed with your doctor first.\n\nFor some, it will have to be a careful balance between managing the symptoms of their long-term health condition and risking the devastating effects of the coronavirus.\n\nAn alternative medication for pain and fever may be paracetamol or acetaminophen.\n\nParacetamol is not an anti-inflammatory medication and can be used to effectively treat fever as well as mild to moderate pain and can, therefore, be used safely to help treat the fever associated with the coronavirus.\n\nA common trade name for paracetamol is Panadol, while acetaminophen is sold widely as Tylenol.", "images": ["https://www.aljazeera.com/mritems/images/site/aje-logo-white.svg", "https://www.aljazeera.com/mritems/imagecache/mbdxxlarge/mritems/Images/2020/3/16/3b6966c08922499c85bf35e5f95df339_18.jpg", "https://www.aljazeera.com/mritems/imagecache/profile/mritems/Images/2020/3/16/f00629c6d2b3478d8f704f48dcc6d1e9_6.jpg", "https://www.aljazeera.com/assets/images/novresptopfeature.jpg", "https://www.aljazeera.com/mritems/Images/2020/3/16/3b6966c08922499c85bf35e5f95df339_18.jpg", "https://www.aljazeera.com/assets/images/aj-logo-sm-2.png", "https://www.aljazeera.com/mritems/assets/images/aj-logo-sm-2.png", "https://www.aljazeera.com/assets/images/AljazeeraLogo.png"], "top_img": "https://www.aljazeera.com/mritems/Images/2020/3/16/3b6966c08922499c85bf35e5f95df339_18.jpg", "keywords": [], "authors": ["Dr Amir Khan", "About The Author", "Dr Amir Khan Is An Nhs Doctor", "A Senior University Lecturer In The United Kingdom."], "canonical_link": "https://www.aljazeera.com/indepth/features/doctor-note-ibuprofen-coronavirus-worse-200316045046677.html", "title": "Doctor's Note: Does ibuprofen make coronavirus worse?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0 maximum-scale=1.0, minimal-ui", "guid": 200316045046677, "title": "Doctor's Note: Does ibuprofen make coronavirus worse?", "author": "Dr Amir Khan", "description": "A doctor explains how anti-inflammatories like ibuprofen can affect our immune systems and why this may be dangerous.", "og": {"title": "Doctor's Note: Does ibuprofen make coronavirus worse?", "description": "A doctor explains how anti-inflammatories like ibuprofen can affect our immune systems and why this may be dangerous.", "url": "https://www.aljazeera.com/indepth/features/doctor-note-ibuprofen-coronavirus-worse-200316045046677.html", "internalurl": "https://www.aljazeera.com/indepth/features/doctor-note-ibuprofen-coronavirus-worse-200316045046677.html", "image": {"identifier": "https://www.aljazeera.com/mritems/Images/2020/3/16/3b6966c08922499c85bf35e5f95df339_18.jpg", "width": 1000, "height": 562}}, "url": "https://www.aljazeera.com/indepth/features/doctor-note-ibuprofen-coronavirus-worse-200316045046677.html", "ShortURL": "https://aje.io/sc6xp", "image": "https://www.aljazeera.com/mritems/Images/2020/3/16/3b6966c08922499c85bf35e5f95df339_18.jpg", "twitter": {"title": "Doctor's Note: Does ibuprofen make coronavirus worse?", "image": "https://www.aljazeera.com/mritems/Images/2020/3/16/3b6966c08922499c85bf35e5f95df339_18.jpg", "description": "A doctor explains how anti-inflammatories like ibuprofen can affect our immune systems and why this may be dangerous.", "account_id": 4970411, "card": "summary_large_image", "site": "@AJEnglish"}, "ContentType": "Feature", "news_keywords": "Doctor's Note, Health, Coronavirus pandemic", "ContentIndexURL": "/indepth/features/", "google-play-app": "app-id=net.aljazeera.english", "apple-itunes-app": "app-id=504847776"}, "movies": [], "publish_date": null, "source": "https://www.aljazeera.com", "summary": ""}