{"url": "https://techstartups.com/2020/03/28/dr-vladimir-zelenko-now-treated-699-coronavirus-patients-100-success-using-hydroxychloroquine-sulfate-zinc-z-pak-update/", "text": "April 11 Update: A new research study reveals that COVID-19 attacks hemoglobin in red blood cells, rendering it incapable of transporting oxygen. In the conclusion, researchers found that chloroquine could prevent the virus attacking the hemoglobin in the red blood cells.\n\nLast Wednesday, we published the success story from Dr. Vladimir Zelenko, a board-certified family practitioner in New York, after he successfully treated 350 coronavirus patients with 100 percent success using a cocktail of drugs: hydroxychloroquine, in combination with azithromycin (Z-Pak), an antibiotic to treat secondary infections, and zinc sulfate. Dr. Zelenko said he saw the symptom of shortness of breath resolved within four to six hours after treatment. Hydroxychloroquine is now being used worldwide, according to a map from French Dr. Didier Raoult. In the meantime, scientists at University of Pittsburgh School of Medicine believe they’ve found potential vaccine for coronavirus.\n\nNow, Dr. Zelenko provides updates on the treatment after he successfully treated 699 COVID-19 patients in New York. In an exclusive interview with former New York Mayor, Rudy Giuliani, Dr. Vladmir Zelenko shares the results of his latest study, which showed that out of his 699 patients treated, zero patients died, zero patients intubated, and four hospitalizations.\n\nDr. Zelenko said the whole treatment costs only $20 over a period of 5 days with 100% success. He defines success as “Not to die.” Dr. Zelenko first posted his Facebook video message last week calling on President Trump to “advise the country that they should be taking this medication.”\n\nThere are many other success stories about hydroxychloroquine across the country. Last week, Dr. William Grace, an oncologist at Lenox Hill Hospital in New York City, said they’ve not had a single death in their hospital because of hydroxychloroquine. “Thanks to hydroxychloroquine, we have not had a death in our hospital,’ Dr. Grace said.\n\nAlso, in a study conducted by the National Institute of Health (NIH) also confirmed some of Dr. Dr. Zelenko’s findings. The study by NIH showed that Zinc supplementation decreases the morbidity of lower respiratory tract infection in pediatric patients in the developing world. A second study also conducted by NIH titled: “In Vitro Antiviral Activity and Projection of Optimized Dosing Design of Hydroxychloroquine for the Treatment of Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2),” also showed hydroxychloroquine to be more potent in killing the virus off in vitro (in the test tube and not in the body).\n\nBelow is a video of his latest interview explaining the success of the treatment.\n\nApril 5 Update: Dr. Vladimir Zelenko said in a video interview that a cocktail of Hydroxychloroquine, Zinc Sulfate and Azithromycin are showing phenomenon results with 900 coronavirus patients treated. This a must watch video.\n\nApril 3 Update: In an exclusive interview, Dr. Zelenko provides a major update about the results of his COVID-19 patients: 700 coronavirus patients treated with 99.9% success rate using Hydroxychloroquine, 1 outpatient died after not following protocol.\n\nApril 1 Update: New results of the first randomized clinical trial show hydroxychloroquine helps coronavirus patients improve.\n\nMarch 31 Update: Dr. Vladimir Zelenko provides important update on three drug regimen of Hydroxychloroquine Sulfate, Zinc and Azithromycin (Z-Pak) he used to effectively treat 699 coronavirus patients with 100% success", "images": ["https://techstartups.com/wp-content/uploads/2020/06/Unreported-Truths-about-COVID-19-and-Lockdowns-book-700x466.jpg", "https://techstartups.com/wp-content/uploads/2020/03/Dr.-Anthony-Fauci-700x459.jpg", "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko-150x150.jpg", "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg", "https://techstartups.com/wp-content/uploads/2017/12/techstartups.com-logo-v3.png", "https://techstartups.com/wp-content/uploads/2020/04/myavatar.jpg", "https://techstartups.com/wp-content/uploads/2020/04/Coronavirus-Mutation-1-700x425.jpg"], "top_img": "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg", "keywords": [], "authors": [], "canonical_link": "https://techstartups.com/2020/03/28/dr-vladimir-zelenko-now-treated-699-coronavirus-patients-100-success-using-hydroxychloroquine-sulfate-zinc-z-pak-update/", "title": "Dr. Vladimir Zelenko has now treated 699 coronavirus patients with 100% success using Hydroxychloroquine Sulfate, Zinc and Z-Pak [UPDATES]", "meta_data": {"msvalidate.01": "C9F587B678F797450F643547987F1838", "description": "TechStartups - Coverage of Technology News, technology startups, Emerging technology, venture capital funding, and Silicon Valley", "keywords": "tech news, technology news, startup news, funding, venture capital", "og": {"locale": "en_US", "type": "article", "title": "Dr. Vladimir Zelenko has now treated 699 coronavirus patients with 100% success using Hydroxychloroquine Sulfate, Zinc and Z-Pak [UPDATES]", "description": "April 11 Update: A new research study reveals that COVID-19 attacks hemoglobin in red blood cells, rendering it incapable of transporting oxygen. In the conclusion, researchers found that chloroquine could prevent the virus attacking the hemoglobin in the red blood cells. …", "url": "https://techstartups.com/2020/03/28/dr-vladimir-zelenko-now-treated-699-coronavirus-patients-100-success-using-hydroxychloroquine-sulfate-zinc-z-pak-update/", "site_name": "Tech News | Startups News", "updated_time": "2020-04-11T18:11:36-04:00", "image": "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg"}, "article": {"publisher": "https://www.facebook.com/TechStartupsCom/", "section": "Featured", "published_time": "2020-03-28T23:34:48-04:00", "modified_time": "2020-04-11T18:11:36-04:00"}, "twitter": {"card": "summary", "description": "April 11 Update: A new research study reveals that COVID-19 attacks hemoglobin in red blood cells, rendering it incapable of transporting oxygen. In the conclusion, researchers found that chloroquine could prevent the virus attacking the hemoglobin in the red blood cells. […]", "title": "Dr. Vladimir Zelenko has now treated 699 coronavirus patients with 100% success using Hydroxychloroquine Sulfate, Zinc and Z-Pak [UPDATES] | Tech News | Startups News", "site": "@techstartupscom", "image": "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg", "creator": "@techstartupscom"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "generator": "WordPress 4.8.13", "msapplication-TileImage": "https://techstartups.com/wp-content/uploads/2016/09/cropped-3.1-270x270.png"}, "movies": ["https://www.youtube.com/embed/1TJdjhd_XG8?start=586&feature=oembed"], "publish_date": 1585368000.0, "source": "https://techstartups.com", "summary": ""}