{"url": "https://www.express.co.uk/news/world/1242801/coronavirus-lab-leak-chinese-pathogen-laboratory-scientists-wuhan-wet-market-bioweapon", "text": "FREE now and never miss the top politics stories again. SUBSCRIBE Invalid email Sign up fornow and never miss the top politics stories again. We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights.\n\nThey said scientists researching bat diseases could be responsible for the global outbreak, in a bombshell report published this week. Their report details how sick bats urinated, attacked and bled on researchers, who did their best to quarantine themselves. But the disease still spread through Wuhan, across China and throughout the world.\n\nThe new report by biological scientists from the prestigious South China University of Technology in Guangzhou, China, contradicts Beijing, who said it spread from contaminated bats being sold at a food market. Biologists Botao Xiao and Lei Xiao, published a pre-print entitled \"The possible origins of 2019-nCoV coronavirus”, in the report they described how “the killer coronavirus probably originated from a laboratory in Wuhan”. The report added: “We noted two laboratories conducting research on bat coronavirus in Wuhan, one of which was only 280 metres from the seafood market. “We briefly examined the histories of the laboratories and proposed that the coronavirus probably originated from a laboratory\n\nA Wuhan high security laboratory\n\n“Our proposal provided an alternative origin of the coronavirus in addition to natural recombination and intermediate host.” The scientists in the alarming report contested official findings that the pathogen first made the jump from bats to humans in the Wuhan wet market. They said: “The probability was very low for the bats to fly to the market. “According to municipal reports and the testimonies of 31 residents and 28 visitors, the bat was never a food source in the city, and no bat was traded in the market. READ NOW: Coronavirus UK outbreak: Scientist warns 400,000 Britons could die [NEWS]\n\nA Wuhan high security laboratory\n\n“There was possible natural recombination or intermediate host of the coronavirus, yet little proof has been reported.” The researchers screened the area around the seafood market and identified two laboratories conducting research on bat coronavirus. These laboratories were within 280 meters of the market, one is called the Wuhan Centre for Disease Control and Prevention. The research concludes that this laboratory hosted animals for research purposes, one of which was specialised in pathogens collection and identification. DON'T MISS: Coronavirus LIVE: We're staying home! Britons TERRIFIED to travel [NEWS]\n\nCoronavirus fears could cause shutdown of schools warns BBC reporter [INSIGHT]\n\nCoronavirus UK: Hidden crisis as panic grows over super-spreaders [VIDEO]\n\nThe coronavirus under a microscope\n\nThe paper claimed: “In one of their studies, 155 bats including Rhinolophus affinis were captured in Hubei province, and another 450 bats were captured in Zhejiang province. The expert who studied the collection of bats at the laboratory had described how he was once “attacked by bats and the blood of a bat shot onto his skin”. The paper added: “He knew the extreme danger of the infection so he quarantined himself for fourteen days. “In another accident, he quarantined himself again because bats urinated on him.”\n\nThe Chinese economy is suffering due to the virus\n\nThe scientists claim the laboratory is beside the Union Hospital where the first group of doctors were infected during this epidemic. The paper concluded: “It is plausible that the virus leaked out and contaminated the initial patients in this epidemic, though solid proofs are needed in future studies.” A second laboratory was identified around seven miles from the seafood market, belonging to Wuhan Institute of Virology of the Chinese Academy of Sciences. This laboratory reported the Chinese horseshoe bats are a natural reservoir for the severe acute respiratory syndrome coronavirus, SARS-CoV, which caused the 2002 to 2003 pandemic.\n\nPatient being taken for treatment\n\nTrending", "images": ["https://cdn.images.express.co.uk/img/dynamic/78/750x445/1242801.jpg", "https://cdn.images.express.co.uk/img/dynamic/1/285x190/1242768_1.jpg", "https://www.facebook.com/tr?id=568781449942811&ev=PageView&noscript=1", "https://analytics.twitter.com/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/dynamic/78/285x190/1242773_1.jpg", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0", "https://t.co/i/adsct?txn_id=l4f18&p_id=Twitter", "https://cdn.images.express.co.uk/img/page/placeholder-vertical.gif", "https://cdn.images.express.co.uk/img/dynamic/78/285x190/1242757_1.jpg", "https://cdn.images.express.co.uk/img/dynamic/78/285x190/1242750_1.jpg", "https://cdn.images.express.co.uk/img/covers/70x91/front_2020-06-08.jpg", "https://cdn.images.express.co.uk/img/page/preloaderbig.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035737&cv=2.0&cj=1"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1242801.jpg", "keywords": [], "authors": ["Brian Mcgleenon"], "canonical_link": "https://www.express.co.uk/news/world/1242801/coronavirus-lab-leak-chinese-pathogen-laboratory-scientists-wuhan-wet-market-bioweapon", "title": "Coronavirus bombshell: ‘REAL cause’ of outbreak claim - Chinese scientists break cover", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "CORONAVIRUS spread from a science laboratory in Wuhan and not a ‘wet market', a group of Chinese scientists have sensationally claimed.", "fb": {"pages": 129617873765147, "app_id": 823607694325129}, "og": {"title": "Coronavirus bombshell: ‘REAL cause’ of outbreak claim - Chinese scientists break cover", "type": "article", "url": "https://www.express.co.uk/news/world/1242801/coronavirus-lab-leak-chinese-pathogen-laboratory-scientists-wuhan-wet-market-bioweapon", "image": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1242801.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "headlines,world,ctp_video,autoplay_video,coronavirus,lab leak,chinese pathogen,laboratory,scientists,wuhan,wet market,bioweapon", "section": "World", "description": "CORONAVIRUS spread from a science laboratory in Wuhan and not a ‘wet market', a group of Chinese scientists have sensationally claimed."}, "news_keywords": "headlines,world,ctp_video,autoplay_video,coronavirus,lab leak,chinese pathogen,laboratory,scientists,wuhan,wet market,bioweapon", "article": {"tag": "bioweapon", "published_time": "2020-02-16T00:17:00+00:00", "modified_time": "2020-02-16T00:18:21+00:00", "expiration_time": "2020-03-17", "section": "World", "image_count": 5, "video_count": 1, "word_count": 830, "internal_link_count": 3, "external_link_count": 0}, "author": "Brian McGleenon", "twitter": {"card": "summary_large_image", "image": {"src": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1242801.jpg"}, "title": "Coronavirus bombshell: ‘REAL cause’ of outbreak claim - Chinese scientists break cover", "description": "CORONAVIRUS spread from a science laboratory in Wuhan and not a ‘wet market', a group of Chinese scientists have sensationally claimed."}, "video_autoplay": "false", "headline_short": "Coronavirus bombshell: ‘REAL cause’ of outbreak claim - Chinese scientists break cover", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "robots": "noodp,noydir,all"}, "movies": [], "publish_date": 1581812220.0, "source": "https://www.express.co.uk", "summary": ""}