{"author": {"comment_karma": 41503, "created_utc": 1467226465.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_94E044.png", "id": "z490k", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 42850, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_upvoatz", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/upvoatz", "key_color": "", "name": "t5_1cvb1g", "is_default_banner": true, "url": "/user/upvoatz/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "upvoatz"}, "body": "OP's video is two weeks old.\n\nA better quality source [submitted yesterday](https://old.reddit.com/r/conspiracy/comments/f3aowq/this_is_a_week_old_but_i_just_saw_it_last_night/) by u/mikepompeosjockstrap \n\nOP's video is from a Senate Armed Services Committee hearing.   Senator Tom Cotten suggested the Coronavirus known as COVID-19 originated from the BSL-4 lab in Wuhan.  The two generals from DoD did NOT confirm this.\n\n* January 30, 2020: Senator Cotton Urges China Travel Ban in Wake of Coronavirus  \nJan 30, 2020  \nhttps://www.youtube.com/watch?v=iT3txmbWxb4\n\n---\n\n\nMost people are discussing passenger air travel, but aren't thinking about air cargo or container shipping by sea.\n\nconsider how much of the worlds manufacturing capability has been outsourced to one country ... China\n\n* electronics\n* packaging\n* medical supplies\n* various goods including processed food\n\nI'm barely scratching the surface.\n\nIf the corona virus continues you're going to see a severe impact on global markets including shortages. That's assuming the virus is contained to China.\n\nHundreds of pilots flying air cargo to/from China each day could be infected and spread the virus.\n\nPackages and goods shipped from China on air cargo flights could contain active living corona virus which could infect anyone along a supply chain, including package handlers, customs, or the recipient.\n\nConsider how much air freight ships from China each day to the United States, Canada, and Mexico, not counting goods sold through Ebay, Alibaba, or Amazon\n\nVariants of corona virus can remain active for up to 28 days on surfaces at 39.2 ° F (4 °C)\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4659470/\n\n> We report here that pathogenic human coronavirus 229E remained infectious in a human lung cell culture model following at least 5 days of persistence on a range of common nonbiocidal surface materials, including polytetrafluoroethylene (Teflon; PTFE), polyvinyl chloride (PVC), ceramic tiles, glass, silicone rubber, and stainless steel. We have shown previously that noroviruses are destroyed on copper alloy surfaces. In this new study, human coronavirus 229E was rapidly inactivated on a range of copper alloys (within a few minutes for simulated fingertip contamination) and Cu/Zn brasses were very effective at lower copper concentration. Exposure to copper destroyed the viral genomes and irreversibly affected virus morphology, including disintegration of envelope and dispersal of surface spikes.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2863430/\n\n> Effects of Air Temperature and Relative Humidity on Coronavirus Survival on Surfaces▿\n> \n\n> **Abstract**  \nAssessment of the risks posed by severe acute respiratory syndrome (SARS) coronavirus (SARS-CoV) on surfaces requires data on survival of this virus on environmental surfaces and on how survival is affected by environmental variables, such as air temperature (AT) and relative humidity (RH). The use of surrogate viruses has the potential to overcome the challenges of working with SARS-CoV and to increase the available data on coronavirus survival on surfaces. Two potential surrogates were evaluated in this study; transmissible gastroenteritis virus (TGEV) and mouse hepatitis virus (MHV) were used to determine effects of AT and RH on the survival of coronaviruses on stainless steel. At 4°C, **infectious virus persisted for as long as 28 days**, and the lowest level of inactivation occurred at 20% RH. Inactivation was more rapid at 20°C than at 4°C at all humidity levels; the viruses persisted for 5 to 28 days, and the slowest inactivation occurred at low RH. Both viruses were inactivated more rapidly at 40°C than at 20°C. The relationship between inactivation and RH was not monotonic, and there was greater survival or a greater protective effect at low RH (20%) and high RH (80%) than at moderate RH (50%). There was also evidence of an interaction between AT and RH. The results show that when high numbers of viruses are deposited, TGEV and MHV may survive for days on surfaces at ATs and RHs typical of indoor environments. TGEV and MHV could serve as conservative surrogates for modeling exposure, the risk of transmission, and control measures for pathogenic enveloped viruses, such as SARS-CoV and influenza virus, on health care surfaces.", "created_utc": 1581672623.0, "distinguished": null, "id": "fhk8ya9", "is_submitter": false, "link_id": "t3_f3oida", "parent_id": "t3_f3oida", "score": 6, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": 1581673420.0, "name": "t1_fhk8ya9", "collapsed": false, "permalink": "/r/conspiracy/comments/f3oida/department_of_defense_confirms_coronavirus_is_a/fhk8ya9/"}