{"author": {"comment_karma": 827, "created_utc": 1564352403.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_19_94E044.png", "id": "4977jj9e", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 713, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_Technauseam", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_19_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Technauseam", "key_color": "", "name": "t5_226e5m", "is_default_banner": true, "url": "/user/Technauseam/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Technauseam"}, "body": "He called the fear mongering image that the media is trying to draw up because it will get you to watch so they can profit off of you and do anything they can to drum up a negative image of trump, the hoax.\n\nWhat reality is usually lands between what trump says and his opponents say.\n\nWhat coronavirus is in america, and what the media try to portray it to be are two completely different things. You dont seem to be wanting to separate the two. So much hype about what it COULD turn into rather than what it is.\n\nYes trump hasn't done everything perfectly which no president can claim when it comes to pandemics. But how we come out of this will be the real answer as to how he truly handled it. Testing isnt the golden ticket to stopping a pandemic. Culture and size of country play a major role. Even with lack of tests early on, we would have seen death rates rise higher than normal which we could extrapolate how many theoretical cases there are. Death rates haven't exploded and we are now all mentally aware of the pandemic.\n\nYou will see nowhere on the left, any genuine discussion about what trump did to consolidate agencies to be more effective combating things like coronavirus. You only hear hur dur he cut this and fired that with little to no actual context. Just lazy smear attempts being piled on.\n\nHere is some information that existed before this all broke out.\n\n2018 https://www.whitehouse.gov/presidential-actions/presidential-memorandum-support-national-biodefense/\n\n\"To ensure an integrated, comprehensive approach, agencies shall coordinate and manage biodefense activities in support of the broader biodefense enterprise, which consists of all stakeholders with a role in the detection of, prevention of, preparedness for, response to, and recovery from biological incidents, including Federal, State, local, tribal, and territorial governments, the private sector, and international partners.\"\n\nhttps://www.google.com/amp/s/www.washingtonexaminer.com/news/former-nsc-official-denies-claims-that-trump-administration-cut-pandemic-response-office%3f_amp=true\n\n\"It is true that the Tump administration has seen fit to shrink the NSC staff. But the bloat that occurred under the previous administration clearly needed a correction,''\n\nhe continued.\n\nMorrison explained that ''one such move at the NSC was to create the counterproliferation and biodefense directorate, which was the result of consolidating three directorates into one, given the obvious overlap between arms control and nonproliferation, weapons of mass destruction terrorism, and global health and biodefense.''\n\nHe added, ''It is this reorganization that critics have misconstrued or intentionally misrepresented. If anything, the combined directorate was stronger because related expertise could be commingled.''\n\nMorrison, who testified during the House's impeachment hearings last year, later argued that the United States should combat the political narrative promulgated by Democrats, saying he feels it stems from propaganda disseminated from China.", "created_utc": 1584474925.0, "distinguished": null, "id": "fkrs409", "is_submitter": false, "link_id": "t3_fka5wb", "parent_id": "t1_fkrpeu0", "score": -24, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkrs409", "collapsed": false, "permalink": "/r/politics/comments/fka5wb/trump_says_he_knew_coronavirus_was_a_pandemic/fkrs409/"}