{"author": {"comment_karma": 39481, "created_utc": 1323905921.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_D4E815.png", "id": "6fwnh", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 287, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#D4E815", "user_is_muted": null, "display_name": "u_this_is_poorly_done", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_D4E815.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/this_is_poorly_done", "key_color": "", "name": "t5_1z3ga6", "is_default_banner": true, "url": "/user/this_is_poorly_done/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "this_is_poorly_done"}, "body": "But what does that boil down to really? If person A is saying person B should be more prepared and needs to do more concerning event 1 and person B makes a big deal saying that person A is blowing everything out of proportion, should not be making as big of a fuss over event 1 as they are, and that their criticisms are a hoax; doesn't that basically boil down to them calling event 1 a \"hoax\"? Especially in Trump language? He is so intentionally vague with his language at times but he does mean what he says in certain ways. He spent months calling the Mueller investigation the Russia hoax, and then calling the impeachment process a hoax. By calling it the Democrats new hoax he was specifically trying to tie it to those two other events in his supporters minds. That's why the right wing press tried to down play it for weeks at a time, and a certain Congressman showed up to work in a gas mask. They were trying to tie the corona virus to \"fake news\" and hoped it would go away because this administration is so utterly unprepared for anything like this all they could do was deflect and spread blame.\n\nHeres the full quote from his 2/28 rally where the hoax language comes from: \n\n>\"But with your help we have exposed the far left's corruption and defeated their sinister schemes and let's see what happens in the coming months. Let's watch. Let's just watch. Very dishonest people. Now the Democrats are politicizing the coronavirus. You know that, right? Coronavirus. They're politicizing it. We did one of the great jobs, you say, \"How's President Trump doing?\", \"Oh, nothing, nothing.\" They have no clue, they don't have any clue. They can't even count their votes in Iowa, they can't even count. No, they can't. They can count their votes. One of my people came up to me and said, \"Mr. President, they tried to beat you on Russia, Russia, Russia.\" That didn't work out too well. They couldn't do it. They tried the impeachment hoax. That was on a perfect conversation.They tried anything, they tried it over and over, they've been doing it since she got in. It's all turning, they lost. It's all turning, think of it, think of it. And this is their new hoax. But you know we did something that's been pretty amazing. We have 15 people in this massive country and because of the fact that we went early, we went early, we could have had a lot more than that.\"\n\nIt's pretty plain here he was trying to tell his supporters it wasn't a big deal, that it's the Democrats fault, and that it will all go away soon, hence the \"could have\" at the end. From the beginning he treated this like he treats everything, a problem that will eventually go away soon and won't hurt him. Too him the actual concerns and threats of the virus were not a legitimate threat until others took the concerns into their own hands and he had no choice but to follow suit. To him the virus was not a big deal, hence by calling this a new democratic hoax he is by extension calling the very threat presented by the new disease a hoax. Because it wasnt just Democrats, it was public health experts on both sides and around the globe who sounded the alarm but he chose to spin this to his fan base as the Democrats fault and to blame them.", "created_utc": 1584508795.0, "distinguished": null, "id": "fkt7nuq", "is_submitter": false, "link_id": "t3_fka5wb", "parent_id": "t1_fksywrk", "score": 2, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkt7nuq", "collapsed": false, "permalink": "/r/politics/comments/fka5wb/trump_says_he_knew_coronavirus_was_a_pandemic/fkt7nuq/"}