{"author": {"comment_karma": 5062, "created_utc": 1517385262.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_7193FF.png", "id": "upbmt03", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7193FF", "user_is_muted": null, "display_name": "u_UniverseCatalyzed", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_7193FF.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/UniverseCatalyzed", "key_color": "", "name": "t5_f8ivb", "is_default_banner": true, "url": "/user/UniverseCatalyzed/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "UniverseCatalyzed"}, "body": "January 22: “We have it totally under control. It’s one person coming in from China. It’s going to be just fine.”\n\nFebruary 2: “Well, we pretty much shut it down coming in from China. … We can’t have thousands of people coming in who may have this problem, the coronavirus. So we’re gonna see what happens, but we did shut it down, yes.”\n\nFebruary 14: “We have a very small number of people in the country, right now, with it. It’s like around 12. Many of them are getting better. Some are fully recovered already. So we’re in very good shape.”\n\nFebruary 24: “The Coronavirus is very much under control in the USA… Stock Market starting to look very good to me!”\n\nFebruary 25: “CDC and my Administration are doing a GREAT job of handling Coronavirus.”\n\nFebruary 25: “I think that's a problem that’s going to go away… They have studied it. They know very much. In fact, we’re very close to a vaccine.”\n\nFebruary 26: “The 15 (cases in the US) within a couple of days is going to be down to close to zero.”\n\nFebruary 26: “We're going very substantially down, not up.”\n\nFebruary 27: “One day it’s like a miracle, it will disappear.”\n\nFebruary 28: “We're ordering a lot of supplies. We're ordering a lot of, uh, elements that frankly we wouldn't be ordering unless it was something like this. But we're ordering a lot of different elements of medical.”\n\nFebruary 28: “Now the Democrats are politicizing the coronavirus, you know that, right? Coronavirus, they’re politicizing it. We did one of the great jobs. You say, ‘How’s President Trump doing?’ They go, ‘Oh, not good, not good.’ They have no clue. They don’t have any clue. They can’t even count their votes in Iowa.” “They tried the impeachment hoax. That was on a perfect conversation. They tried anything. They tried it over and over. They’d been doing it since you got in. It’s all turning. They lost. It’s all turning. Think of it. Think of it. And this is their new hoax.”\n\nMarch 2: “You take a solid flu vaccine, you don't think that could have an impact, or much of an impact, on corona?”\n\nMarch 2: “A lot of things are happening, a lot of very exciting things are happening and they’re happening very rapidly.”\n\nMarch 4: “If we have thousands or hundreds of thousands of people that get better just by, you know, sitting around and even going to work — some of them go to work, but they get better.”\n\nMarch 5: “I NEVER said people that are feeling sick should go to work.”\n\nMarch 5: “The United States… has, as of now, only 129 cases… and 11 deaths. We are working very hard to keep these numbers as low as possible!”\n\nMarch 6: “I think we’re doing a really good job in this country at keeping it down… a tremendous job at keeping it down.”\n\nMarch 6: “Anybody right now, and yesterday, anybody that needs a test gets a test. They’re there. And the tests are beautiful…. the tests are all perfect like the letter was perfect. The transcription was perfect. Right? This was not as perfect as that but pretty good.”\n\nMarch 6: \"You know, my uncle was a great person. He was at MIT. He taught at MIT for, I think, like a record number of years. He was a great super genius. Dr. John Trump. I like this stuff. I really get it. People are surprised that I understand it. Every one of these doctors said, 'How do you know so much about this? ' Maybe I have a natural ability. Maybe I should have done that instead of running for president.\"\n\nMarch 6: “I don't need to have the numbers double because of one ship that wasn't our fault.”\n\nMarch 8: “We have a perfectly coordinated and fine tuned plan at the White House for our attack on CoronaVirus.”\n\nMarch 9: “This blindsided the world.”\n\nMarch 9: \"The Fake News Media and their partner, the Democrat Party, is doing everything within its semi-considerable power (it used to be greater!) to inflame the CoronaVirus situation, far beyond what the facts would warrant.”\n\nMarch 9: “So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!”\n\nMarch 10: \"It will go away. Just stay calm. It will go away.\"\n\nMarch 11: \"This is the most aggressive and comprehensive effort to confront a foreign virus in modern history.\"\n\nMarch 13: \"Today I am officially declaring a national emergency. Two very big words.\"\n\nMarch 13: “I don't take responsibility at all”\n\nMarch 13: \"For decades the u/CDCgov looked at, and studied, its testing system, but did nothing about it. It would always be inadequate and slow for a large scale pandemic, but a pandemic would never happen, they hoped. **President Obama made changes that only complicated things further**\"\n\nMarch 14: \"SOCIAL DISTANCING!\"\n\nMarch 15: \"TODAY IS A NATIONAL DAY OF PRAYER. GOD BLESS EVERYONE!\"\n\nMarch 15: “This is a very contagious virus. It’s incredible. But it’s something that we have tremendous control over.”\n\nMarch 16: “If you’re talking about the virus, no, that’s not under control for any place in the world. ... I was talking about what we’re doing is under control, but I’m not talking about the virus.\"\n\nMarch 16: \"I'd rate it a 10\" (in response to how he rate his handling of the situation)", "created_utc": 1584482580.0, "distinguished": null, "id": "fks5av9", "is_submitter": false, "link_id": "t3_fkcwca", "parent_id": "t1_fks560i", "score": 12, "stickied": false, "subreddit_id": "t5_2qh63", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fks5av9", "collapsed": false, "permalink": "/r/Libertarian/comments/fkcwca/trump_says_he_knew_coronavirus_was_a_pandemic/fks5av9/"}