{"author": {"comment_karma": 12307, "created_utc": 1339009250.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_545452.png", "id": "7x1kf", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 13329, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_TheEternal792", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TheEternal792", "key_color": "", "name": "t5_efm0w", "is_default_banner": true, "url": "/user/TheEternal792/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TheEternal792"}, "body": ">You’re still comparing apples and oranges, and trying to make excuses for Trump by attacking Obama over something that’s more or less completely unrelated, and therefore irrelevant.\n\nThey're both potentially-fatal, viral pandemics than originated in foreign countries. Certainly not apples to oranges. \n\nAnd to be clear, I'm not attacking Obama, I'm simply using that as the most recent and equivalent reference point. This sub is claiming President Trump called it a hoax, which is a straight lie. All I'm saying is, if he truly believed it to be a hoax, why would he declare it to be a national emergency so early using Obama's declaration as a \"standard\"?\n\n>> The media, conversely, has blown it way out of proportion\n\n>Conservatives trot this line out every single time a natural disaster causes a crisis. And this time they’re being exposed for being dead fucking wrong at every turn.\n\nBecause it's true. Look at the media's response to H1N1 under Obama compared to COVID-19 under Trump. Drastic differences, despite near media silence even when H1N1 was at a much worse point. Media portrayal and reception has an impact.\n\nThe media wants the market to worsen to make Trump look bad. It doesn't matter to them if millions lose their job, it's worth it if it makes Trump look bad. That has been admitted by several in the industry. \n\n>This virus is as serious as it gets, and lives will be lost that could have been saved had Orange Foolius bothered to give a shit before it was too late.\n\nThe virus is serious, sure. But mostly because of its ability to spread rapidly and overwhelm the healthcare system, especially with the elderly or respiratory comorbidities. Most people can get the virus and really be no worse for wear. You wouldn't think so if you turned on the TV or listened to the radio. We need to take necessary precautions to prevent it from spreading quickly, but freaking out like we're all going to die and need to buy up all the toilet paper and cleaning supplies in the world doesn't do anyone any good.", "created_utc": 1584547068.0, "distinguished": null, "id": "fkuczhk", "is_submitter": false, "link_id": "t3_fka5wb", "parent_id": "t1_fkub4j6", "score": -1, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkuczhk", "collapsed": false, "permalink": "/r/politics/comments/fka5wb/trump_says_he_knew_coronavirus_was_a_pandemic/fkuczhk/"}