{"author": {"comment_karma": 1460, "created_utc": 1342372027.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FF8717.png", "id": "8c93g", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 41, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF8717", "user_is_muted": null, "display_name": "u_WavelandAvenue", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FF8717.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/WavelandAvenue", "key_color": "", "name": "t5_cti4f", "is_default_banner": true, "url": "/user/WavelandAvenue/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "WavelandAvenue"}, "body": "My question was trying to understand what we consider a specific statement or action that would be categorized as downplaying the severity of the virus.\n\nFor example, early on, when President Trump made his comments about how the number would be small and could quickly fall to zero, I would say that is downplaying it. What is interesting to me is that his statements around that time could be construed as downplaying it, while some of his actions told a different story; for example, the travel ban.\n\nSo his words indicated one thing, and at least some of his actions indicated the opposite.\n\nMeanwhile, some mainstream media outlets seemed to argue against the travel ban at the time, which I’m not sure if we should consider that as also downplaying it - hence my question.\n\nBased on one of the people’s posts in this thread, it seems pretty clear that Hannity and some others were also downplaying it, which I’m not surprised by at all given their political bent. However, I also can’t verify that on my own, since I quit paying attention to Hannity years ago.\n\nWhile I’m not surprised by them downplaying it, I don’t have a good understanding of what they specifically said or did to downplay it. Again, due to the fact that I just don’t pay attention to those types of opinion journalism anymore.\n\nNow, all that rambling aside, there are plenty of examples of opinion journalists at the end of January/beginning of February that were arguing against a travel ban. Some political leaders continued to argue against a travel ban as late as March 12. So that sticks out to me as an interesting aspect of this situation, because you have specific tactics that indicate taking it more or less seriously, while at the same time comments on it that may indicate the opposite. And some people - like president trump for example - seemed to come down on both sides of thay coin at the exact same time, creating mixed signals at best, in my personal opinion. \n\nIf you are serious and want me to actually list specific examples to further discuss it, I can.", "created_utc": 1585092226.0, "distinguished": null, "id": "flev9im", "is_submitter": false, "link_id": "t3_fnv8fy", "parent_id": "t1_flco9oy", "score": 1, "stickied": false, "subreddit_id": "t5_3a6w2", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_flev9im", "collapsed": false, "permalink": "/r/media_criticism/comments/fnv8fy/washington_post_reporter_has_apologized_for_and/flev9im/"}