{"author": {"comment_karma": 1670, "created_utc": 1378822616.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_94E044.png", "id": "d3bvf", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 148, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_danwojciechowski", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/danwojciechowski", "key_color": "", "name": "t5_cycpk", "is_default_banner": true, "url": "/user/danwojciechowski/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "danwojciechowski"}, "body": ">...  \n>  \n>would the moons gravity get stronger as i approached the moon ?\n\nYes. The gravitational attraction between any two bodies is proportional to the sum of the masses of the two bodies and inversely proportional to the square of the distance between the two bodies.\n\n&#x200B;\n\n>at what point would gravity become so negligible that the rocket would no longer need to spend fuel fighting gravity?\n\nYes. However, the point is not a fixed distance, rather the distance depends on velocity. As has been said before, for any given gravitational force, at any given distance from source of the gravitation, there is a velocity beyond which a moving object will not fall back to the gravitational source.\n\nA rocket only accelerates (increases velocity) when burning fuel. However a rocket does not stop because it stops burning fuel; it stops \\*accelerating\\*. What happens to the rocket's velocity depends on the other forces acting on the rocket, it this case, gravity. So, three things are happening:\n\n1. With time, the rocket is \"coasting\" away from the gravity source. The distance is increasing.\n2. With time, the rocket's velocity is decreasing due to the \"pull\" of gravity.\n3. With distance, the gravity \"pulling\" on the rocket is decreasing.\n\nWhether or not the coasting rocket leaves the gravity source or gets pulled back will depend on whether the initial \"coasting\" speed was enough, such that ever decreasing gravitational \"pull\" can reduce it to zero.\n\nHave you ever ridden a bicycle on a road with a big dip in it? A place where the road goes down, and then back up? If you let your bike start rolling down one side of the dip, you pick up speed until you hit the bottom and then begin to slow as you climb back out of the dip. Let's say that you start by just letting the bike roll, not pedaling. You shoot down the slope and then back up the other side, but you don't make it all the way up. Now you go back to the original side, but start farther back. You pedal until you reach to start of the slope and then start coasting. This time you shoot down the slope and up the other side without stopping. What changed? In the first case, your initial velocity was zero. In the second case, you had some non-zero initial velocity that was great enough to allow you to \"escape\" the \"gravity well\" of the dip in the road.", "created_utc": 1583160489.0, "distinguished": null, "id": "fj9vd13", "is_submitter": false, "link_id": "t3_fawf9o", "parent_id": "t1_fj255pw", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fj9vd13", "collapsed": false, "permalink": "/r/conspiracy/comments/fawf9o/is_it_a_coincidence_that_every_election_year_has/fj9vd13/"}