{"author": {"comment_karma": 16332, "created_utc": 1324903408.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_EA0027.png", "id": "6il6f", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 22233, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#EA0027", "user_is_muted": null, "display_name": "u_EnoughNoLibsSpam", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_EA0027.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/EnoughNoLibsSpam", "key_color": "", "name": "t5_1z1a39", "is_default_banner": true, "url": "/user/EnoughNoLibsSpam/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "EnoughNoLibsSpam"}, "body": ">Well that's not a national standard or state standard, nor would anyone who actually knows about Columbus would teach that.\n\nlet me guess. you know all about Columbus ?\n\n>Your teacher is a fucking idiot.\n\naren't we all ?\n\ni still suck at heart surgery :(\n\n>No one teaches Flat Earth Columbus unless they're an elementary teacher spreading misconceptions.\n\nthats what was in the textbook. \n\nhere is a google image search for \"Columbus ships edge of flat earth\" \n\nthese are the pics that were in our textbooks. \n\nhttps://www.google.com/search?q=columbus+ships+edge+of+flat+earth&tbm=isch&ved=2ahUKEwi5gaTZsvXnAhUWOc0KHUjaBaQQ2-cCegQIABAA&oq=columbus+ships+edge+of+flat+earth&gs_l=img \n\n>You idiots try to make a conspiracy out any stupid shit that came out of your teachers mouth.\n\nthey didn't \"teach\" us that flat earth was real, they merely brought it up in the context of Columbus, in order to mock the idea and introduce young, impressionable minds, to idea that that the earth is a pear shaped oblate spheroid \n\ni hope you laughed. \n\nyes, black science guy wants YOU to believe the earth is pear-shaped\n\nhttps://www.google.com/search?tbm=isch&source=hp&biw=1582&bih=1111&ei=86JZXvOCGZDm-gSJt4WQCQ&q=black+science+guy+pear+shaped+earth&oq=black+science+guy+pear+shaped+earth&gs_l=img \n\n>You ever consider you just went to terrible schools?\n\nwell, i did grow up in the ghetto, and in retrospect the literal gangs of thugs in the hallways and after school were a little intimidating...\n\nbut, believe it or not, at the time, those schools were the top in the nation. \n\na few miles from me was the state teachers college, which is where college students go if they want to be a teacher. it remains one of the top teaching schools in the nation, with students from all states and countries coming and going. \n\nand they even had a \"laboratory school\", which was basically an elementary school were the student teachers could use real students as guinea pigs during their student teaching... \n\neven our state coin is dedicated to education. \n\nhttps://www.google.com/search?q=iowa+dollar+coin&tbm=isch&ved=2ahUKEwiZ__f8s_XnAhXLPM0KHbKrABYQ2-cCegQIABAA&oq=iowa+dollar+coin&gs_l=img \n\n>Do you think they teach flat Earth Columbus in universities?\n\nprobably not anymore, since bringing it up for the sole purpose of mocking it, seems to have back-fired, and now everyone knows about flat-earth. \n\n>I'm upset with how dumb your comment is.\n\nthat is a symptom of cognitive dissonance. \n\ncognitive dissonance is one of the quirks of human nature that the establishment uses to enslave your mind and keep you under control.\n\nonce your owners download a version of reality into your mind, you will reflexively reject anything that challenges that reality. \n\nflat earth is a good example. once you have it in your mind that the earth is ball-shaped, you'll reflexively reject any other model,\n\n to the point of getting mad, upset, etc\n\nmy advice to anyone. when you know you are experiencing cognitive dissonance, don't run away from it. stay around and resolve the conflict. you'll be glad you did, 100% of the time. \n\nwhen you have a \"gut reaction\" to something, like a feeling of being sick to your stomach, thats when you know...you know... you've flipped\n\nhttps://en.wikipedia.org/wiki/Cognitive_dissonance \n\n>Morons breed morons I guess.\n\nwhen people are challenged with new ideas that are diametrically opposed to their personal version of reality, \n\none of their reflexive, knee-jerk reactions is to assume the messenger is either stupid, crazy, a troll, or a shill. \n\nwhile it might be helpful to keep those possibilities in mind, its nonetheless an ad hominem fallacy, \n\nand you should endeavor to address the root of the argument, regardless of who delivers it. \n\nit is the mark of an educated mind to be able to entertain a notion without accepting it\n\n____\n\nanyway, one of the primary purposes of the Apollo Moon Landing Hoax was to obtain pics of a \"round earth\" \n\nall the rest was theatrics around this one prime objective.  \n\nevery picture that you think you have seen of a \"round earth\" is in fact nothing but \"computer-generated images\" CGI\n\nits obvious as the day is long, if you just compare a bunch of them to each other, for example in this google image search...\n\nthe only reason they fooled you before, is because you never saw more than one at a time...\n\nthat gut feeling you're  about to feel ? ....\n\nhttps://www.google.com/search?tbm=isch&source=hp&biw=1582&bih=1111&ei=1ahZXtCVHYzGsQXur6SADQ&q=CGI+round+earth&oq=CGI+round+earth&gs_l=img \n\nthe good news is, the universe really does revolve around you, regardless of what your mum told you.", "created_utc": 1582934337.0, "distinguished": null, "id": "fj24imj", "is_submitter": false, "link_id": "t3_fawf9o", "parent_id": "t1_fj1spxr", "score": -1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fj24imj", "collapsed": false, "permalink": "/r/conspiracy/comments/fawf9o/is_it_a_coincidence_that_every_election_year_has/fj24imj/"}