{"title": "Will Sipping Water Every 15 Minutes Prevent a Coronavirus Infection?", "subtitle": "This \"serious excellent advice by Japanese doctors treating COVID-19 cases\" is not all that excellent.", "date": "11 March 2020", "claim": "Taking a few sips of water every 15 mins will prevent the new coronavirus from entering your windpipe and lungs.", "rating": "False", "true_part": "", "false_part": "", "content": "Inaccurate messages about the new coronavirus are spreading and mutating online. One frequently copied and pasted bit of text that has gone viral on Facebook, Twitter, and WhatsApp purports to impart “serious excellent advice” from “Japanese doctors treating COVID-19 cases.”\nThat “advice” asserts regular sips of water can prevent the coronavirus, which causes the COVID-19 disease, from entering the respiratory system:\nSERIOUS EXCELLENT ADVICE by Japanese doctors treating COVID-19 cases.  Everyone should ensure your mouth & throat is moist, never DRY. Take a few sips of water every 15 mins at least. WHY?  Even if the virus gets into your mouth … drinking water or other liquids will WASH them down through your oesophagus and into the stomach. Once there in tummy … your stomach ACID will kill all the virus. If you don’t drink enough water more regularly … the virus can enter your windpipes and into the LUNGS. That’s very dangerous.\nThe “serious excellent advice by Japanese doctors” text is often combined with other viral coronavirus claims including a paragraph about a “self-check” attributed to “Taiwan experts,” and a set of recommendations that begins with a claim about differentiating between a cold and COVID-19. Snopes addressed the “Taiwan experts self-check” claim here and addressed the list of tips that begins with a dubious method of distinguishing a cold from COVID-19 here. This article deals only with the claim regarding sipping water every 15 minutes.\nIt is true that COVID-19 infects the respiratory system by directly entering the body through the mouth or nose. This fact is central to both the Centers for Disease Control and Prevention (CDC) and World Health Organization (WHO) recommendations to wash hands frequently and avoid touching your face. The assertion in this viral “advice,” however, is that if the virus were already in your mouth, water would help wash it away. Though medical officials recommend drinking water during any infection, no evidence exists to support the notion that sipping water prevents a virus from infecting the respiratory system.\nDrinking more water, while good for your overall health, will not keep anyone from catching the coronavirus, according to Dr. William Schaffner, an infectious diseases expert at Vanderbilt University. Schaffner told The Associated Press, “We always caution anyone healthy and people who are sick to keep up fluid intake and keep mucus membranes moist.” He also said: “It makes you feel better; there is no clear indication that it directly protects you against complications.”\nDr. Susan Wootton, an infectious disease expert at McGovern Medical School at UTHealth, agreed with that assessment, telling KHOU that no data exist to support the claim that sipping water will prevent infection by transporting it to the stomach.\nBecause no evidence supports the claim, we rank the notion that sipping water regularly prevents COVID-19 infection as “False.”", "links": ["http://archive.vn/IioqF", "http://archive.vn/wip/C5OcJ", "https://www.snopes.com/fact-check/taiwan-experts-self-check/", "https://www.snopes.com/news/2020/03/05/uncle-coronavirus/", "https://www.cdc.gov/coronavirus/2019-ncov/about/prevention.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public", "https://apnews.com/afs:Content:8551030197", "https://www.khou.com/article/news/verify/verify-does-drinking-water-prevent-the-spread-of-covid-19/285-a661bc55-c0a8-41ce-9cb4-33df65253a3c"], "imgs": []}