{"title": "Do Sulfur Emissions from Wuhan, China, Point to Mass Cremation of Coronavirus Victims?", "subtitle": "A data map that appeared in a popular Twitter thread did not show what some people claimed.", "date": "24 February 2020", "claim": "Satellite data show a large release of sulfur dioxide gas from the outskirts of Wuhan, China, and could be viewed as evidence of the mass cremation of new coronavirus victims.", "rating": "False", "true_part": "", "false_part": "", "content": "On Feb. 8, 2020, a well-shared Twitter thread claimed that “data” showed a massive increase in sulfur emissions over Wuhan, China. The thread further suggested that a likely explanation for this alleged observation was the cremation of bodies associated with the outbreak of the new coronavirus whose origin is in that region:\n\nThe Sun and The Express, among other outlets, uncritically repeated this claim, despite its dubious origins. Both outlets later deleted their stories without a correction note by the time of our reporting. The Sun, for example, had described the above image as showing the “extent of corpse burning in Wuhan.” That premise is fatally flawed for at least two reasons.\nFirst and most significantly: The data presented are not a real-time observation of sulfur concentrations above Wuhan. Instead, the image is a computer-model output designed to predict, based on a historical knowledge of the area and its current atmospheric conditions, what concentration of sulfur is likely present in the air at a given time and place. Second, sulfur is not a significant emission from human cremation. It is, however, a significant emission from the burning of coal in power plants or for other industrial uses like iron and steel production. The area directly below the hotspot shown in Twitter thread is, in fact, the Wuhan Iron & Steel Company.\nThe source of the data highlighted in the Twitter thread is a company named Windy.com, which combines several models and meteorological inputs to create global maps of weather conditions aimed primarily at people who partake in outdoor sports. Windy, in turn, gets its sulfur data from a NASA climate model named GEOS-5. Arlindo da Silva, a research meteorologist at NASA’s Global Modeling and Assimilation Office, told the British fact-checking organization Full Fact that the GEOS-5 sulphur dioxide models do not “assimilate real satellite data” into their forecasts.\nInstead, he said, “Our forecasts are based on fixed emission inventories,” which “do not account for the day-to-day variations in SO2 emissions and as such cannot account for sudden changes in human activity.” The sulfur fluctuations present in the GEOS-5 model stem from “variations in the meteorological conditions, in particular winds.” The high levels of industry in the region — the Wuhan Iron & Steel Company — are likely the cause of higher “emission inventories” prescribed by the model for the Wuhan region.\nThe viral twitter thread asserts that “sulfur dioxide [is] commonly associated with the burning of organic matters.” This is a technically correct statement that is grossly misleading in this context. Sulfur dioxide is commonly associated with the burning of coal. Coal, formed from the carbon compounds of dead plant material buried and heated naturally in the earth for millions to hundreds of millions of years, is indeed an example of “organic matter” that, when burned, can release sulfur dioxide.\nHumans, while also an example of organic matter, nevertheless contain a negligible amount of sulfur. Carbon, hydrogen, oxygen, nitrogen, calcium, and phosphorus make up more than 99% of all chemicals in the human body, leaving less than 1 percent for anything else, including sulfur. The sulfur present in coal dominantly comes from geologic processes that occur over millions of years. As such, a recently deceased body, when burned, is not going to generate an abundance of sulfur compounds even if there were live satellite measurements to document that release of chemicals (which there are not).\nNone of this is to say that there has not been an increase in cremation in areas in China affected by the spread of the coronavirus. On Feb. 2, 2020, the Chinese government announced that it was banning all funerals for victims of the viral infection, further stipulating that cremation would be required for their bodies.\nHowever, the suggestion that satellite data provides a measurable signal of increases in cremation relies on two fundamental misunderstandings about both the atmospheric model at issue and the chemistry used to interpret it. As such, we rate this claim as “False.”", "links": ["http://archive.ph/yhuDg#selection-3023.28-3023.132", "http://archive.is/ShAfz", "https://web.archive.org/web/20200214152411/https://www.express.co.uk/news/world/1240523/Coronavirus-satellite-image-scale-of-coronavirus-outbreak-infections-coronavirus-cremation", "http://www.aaqr.org/files/article/7988/9_AAQR-19-07-OA-0363_2056-2069.pdf", "https://www.google.com/maps/place/Wuhan+Iron+%26+Steel+%EF%BC%88Group%EF%BC%89+Company/@30.6329981,114.4156506,8561m/data=!3m1!1e3!4m13!1m7!3m6!1s0x0:0x0!2zMzDCsDM3JzQ2LjciTiAxMTTCsDI2JzM1LjciRQ!3b1!8m2!3d30.62963!4d114.44325!3m4!1s0x342ea0c35d54bb35:0xc30f63c9d24b1933!8m2!3d30.635393!4d114.4477773", "http://archive.ph/txSKp#selection-1165.1-1165.134", "https://fullfact.org/health/satellites-wuhan-sulphur-dioxide-coronavirus/", "https://www.google.com/maps/place/Wuhan+Iron+%26+Steel+%EF%BC%88Group%EF%BC%89+Company/@30.6329981,114.4156506,8561m/data=!3m1!1e3!4m13!1m7!3m6!1s0x0:0x0!2zMzDCsDM3JzQ2LjciTiAxMTTCsDI2JzM1LjciRQ!3b1!8m2!3d30.62963!4d114.44325!3m4!1s0x342ea0c35d54bb35:0xc30f63c9d24b1933!8m2!3d30.635393!4d114.4477773", "http://archive.ph/yhuDg#selection-3023.28-3023.132", "https://www.ucsusa.org/resources/coal-and-air-pollution", "https://www.google.com/books/edition/Nature_s_Building_Blocks/j-Xu07p3cKwC?hl=en&gbpv=1&dq=The%20Elements%20JOhn%20Emsley&pg=PA6&printsec=frontcover&bsq=fraction%20of%20total%20body%20mass", "https://www.sciencedirect.com/science/article/abs/pii/S0166516212001516", "http://www.nhc.gov.cn/yzygj/s7659/202002/163c26a24057489dbf64dba359c59a5f.shtml"], "imgs": ["https://www.snopes.com/tachyon/2020/02/wuhan-tweet.png"]}