{"title": "Did Empire State Building Display ‘Siren’ Lights During COVID-19 Pandemic?", "subtitle": "A strange sight for strange times.", "date": "31 March 2020", "claim": "The Empire State Building displayed a red and white \"siren\" light during the COVID-19 pandemic.", "rating": "True", "true_part": "", "false_part": "", "content": "On March 30, 2020, videos and photographs supposedly showing a red and white siren light atop the Empire State Building in New York City were widely circulated on social media. The following video, for instance, was viewed more than 7 million times within 24 hours of its initial posting:\nThe @EmpireStateBldg reminding us that the city is in the middle of an emergency. pic.twitter.com/50TjEjOogN\n— Rita J. King (@RitaJKing) March 31, 2020\n\nThis is a genuine video of the Empire State Building taken on March 30, 2020, as the city (as well as the country) fought against the COVID-19 pandemic. \nA brief statement on the the Empire State Building website explained the building “will be lit red with a siren in the mast paying respect to heroic COVID-19 emergency workers.” The official Twitter account for the Empire State Building stated that these “heartbeat” and “siren” lights would be displayed “through the COVID-19 battle.” \nA March 27 press release noted that this nightly show, synced with music (the “modern era anthem of New York City, Alicia Keys’ ‘Empire State of Mind'”), would continue through April 2.  \nHere is more information about the display:\nTo keep the light of New York City bright, the light show will replay on Saturday, March 28, and then again from Monday, March 30 through Thursday, April 2. On Sunday, March 29, the Empire State Building will shine in a dynamic heartbeat from 9:00 p.m. to 10:00 p.m. in support of the “FOX PRESENTS THE IHEART LIVING ROOM CONCERT FOR AMERICA.”\nTo honor the first responders who tackle this health crisis daily, Z100’s Elvis Duran will kick off every light show at 8:55 p.m. with a spotlight interview to highlight the amazing individuals who are on the front lines of the fight against COVID-19.\nESRT’s Empire State Building and IHRT’s Z100 will premiere new shows each Friday night as we work together to beat COVID-19. Listen and watch for the announcement of a new music-to-light show that will premiere on Friday, April 3, and play nightly for one week.\nRemember to comply with the directions of authorities and maintain social distance while you watch from your window, rooftop, or sidewalk. The power of iHeartMedia’s Z100 and the icon of New York City, the Empire State Building, join to help our city, our country, and our world heal and maintain perspective. Additionally, the show, designed by world-renowned lighting artist Marc Brickman, will be streamed on the Empire State Building’s Facebook page.\n“The Empire State Building has always served as an international symbol of hope, of challenges overcome, and of New York City itself,” said Anthony E. Malkin, Chairman and CEO, ESRT.", "links": ["https://twitter.com/EmpireStateBldg?ref_src=twsrc%5Etfw", "https://t.co/50TjEjOogN", "https://twitter.com/RitaJKing/status/1244782872076128256?ref_src=twsrc%5Etfw", "https://www.esbnyc.com/tower-lighting-2020-03-30-000000", "https://twitter.com/EmpireStateBldg/status/1244742999059369993", "https://www.esbnyc.com/sites/default/files/press_release_-_esb_and_iheart_.pdf"], "imgs": []}