{"title": "Is China Seeking Approval to Kill 20,000 Coronavirus Patients?", "subtitle": "A disreputable website spread unfounded claims in the wake of a new coronavirus outbreak.", "date": "6 February 2020", "claim": "Chinese officials are seeking approval to start the mass killing of 20,000 people in order to stop the spread of new coronavirus.", "rating": "False", "true_part": "", "false_part": "", "content": "On Feb. 5, 2020, the website AB-TC (aka City News) published an article that claimed Chinese officials were seeking approval from the Supreme People’s Court to start the mass killing of 20,000 people infected with the new coronavirus in an attempt to contain the disease: \nChina seek for court’s approval to kill the over 20,000 coronavirus patients to avoid further spread of the virus\nThe highest level of court in Chhina [sic], Supreme People’s Court, is expected to give an approval on Friday for the mass killing of coronavirus patients in China as sure means of controlling the spread of the deadly virus.\nThe State tells the court that China is on the verge of losing its health workers to Coronavirus as at least 20 health workers contract the virus daily.\nThis is not a genuine news report. While the AB-TC website does not carry any disclaimers labeling its content as fiction, we found a number of red flags concerning the legitimacy of this outlet’s reporting. \nFor starters, this website is full of junk news stories. For instance, a July 2010 article (still featured on the homepage) carries the headline, “BREAKING: New York Giants coach Pat Shurmur has died.” But Shurmur didn’t die in 2010. In fact, he is still alive as of this writing and was hired as the offensive coordinator for the Denver Broncos in January 2020.\nThe website has also published hoax articles about “cannibal restaurants” (debunked here), death hoaxes about celebrity couples (debunked here), doctored tweets from U.S. President Donald Trump, and a junk news article that falsely claimed Prince Andrew had committed suicide.\nThis website has also previously spread misinformation about the coronavirus, or 2019-nCoV acute respiratory disease. The government of Singapore released a statement on Jan. 30, 2020, to refute claims published in an AB-TC report:\nCorrections and clarifications regarding falsehoods published by AB-TC City News’ website\nOn 30 Jan 2020, a website called ‘City News’ published an article titled “BREAKING NEWS: Singapore records six more coronavirus case, total of 16 now” (https://ab-tc.com/singapore-coronavirus-cases/) claiming that five Singaporeans have contracted the Wuhan coronavirus without going to China.\nAs of 9pm on 30 Jan 2020, there is no local transmission of the Wuhan virus in Singapore. All confirmed cases in Singapore to date are Chinese nationals who travelled from Wuhan.\nNone of the AB-TC articles we examined was accompanied by a person’s byline. Rather, they were all written by so-called “local correspondents.” \nIn other words, this website doesn’t exactly have a great track record of genuine news reporting. \nIn addition to its history of pushing misinformation, there are also a few red flags in AB-TC’s article about the mass killing of coronavirus patients. For instance, like most of the other articles on this website, this article contains no links back to supporting evidence. Even when the article mentions secondary sources, such as a “document” or a “press conference,” they provide no evidence to show that these items actually exist or took place. The article is also suspiciously void of specifics. AB-TC reports that “the state” or “the court” or an “official” made a statement, but doesn’t provide any direct quotes or names in its report. \nLastly, no credible news outlets have published reports containing this claim. The New York Times reported on Feb. 6, 2020, that a senior official in China “ordered the authorities in the city of Wuhan to immediately round up all residents who have been infected with the coronavirus and place them in isolation, quarantine or designated hospitals.” That report, of course, made no mention of “mass killings.”\nThere is also no mention of this supposed court case on the The Supreme People’s Court of the People’s Republic of China website.  \nAB-TC is the sole source of this rumor. However, this website provided no evidence to support its claim. This website also has a history of spreading misinformation. As this claim is not supported by any other credible news reports, we’ve concluded that this report is indeed false. ", "links": ["http://archive.ph/4bUue", "http://archive.ph/d1rJ8", "https://www.denverbroncos.com/news/broncos-name-pat-shurmur-as-offensive-coordinator", "http://archive.ph/esEB7", "https://www.snopes.com/fact-check/nightclub-patrons-meat/", "http://archive.ph/AmxQG", "https://hoax-alert.leadstories.com/3470655-fake-news-breaking-news-shaunae-miller-and-husband-maicel-uibo-drown-in-canada-while-fishing---lates.html", "http://archive.ph/F03L8", "http://archive.ph/2wo9p", "https://www.gov.sg/article/factually-clarifications-on-falsehoods-posted-by-abtc-city-news", "https://www.nytimes.com/2020/02/06/world/asia/coronavirus-china.html#link-3cb0be85", "http://english.court.gov.cn/index.html"], "imgs": []}