{"title": "Can People Who Recover from COVID-19 Become Reinfected?", "subtitle": "Medical professionals believe positive coronavirus retests are more likely the result of errors in testing rather than reinfection.", "date": "15 March 2020", "claim": "People who have survived the COVID-19 coronavirus disease can become reinfected by the virus.", "rating": "Unproven", "true_part": "", "false_part": "", "content": "As the world grappled with the COVID-19 coronavirus disease pandemic in early 2020, people around the globe began to consider the dread possibility that COVID-19 might not only be more infectious and have a much higher mortality rate than the seasonal flu, but that at least some persons who survived  it might become reinfected rather than developing an immunity to it.  \nA few reports have trickled in from around the world suggesting that someone who had COVID-19 recovered and then fell ill with it again, such as the following account from China:\n\nMr. Wang, a resident of Xuzhou, in Jiangsu province, appeared to have emerged victorious from a monthlong battle with the illness. \nThree days later, though, Wang tested positive for the coronavirus again. He was re-hospitalized and his neighbors were locked down once more. His current condition is unknown.\nWang, whose full name has not been disclosed for privacy reasons, is one of more than 100 reported cases of Chinese patients who have been released from hospitals as survivors of the new coronavirus — only to test positive for it a second time in the bewildering math of this mysterious illness.\n\nHowever, at this juncture it’s difficult to determine whether such reports document that fully recovered COVID-19 patients truly became infected anew, or whether those persons may have relapsed or not completely recovered from their first bout of the illness.  Problems with diagnostic testing techniques have been raised as one possibility to explain why some patients might have retested positive for COVID-19 after seemingly recovering:\n\n[Such cases] are raising questions in China about the reliability of diagnostic tests, the possibility of reinfection and whether patients are wrongly designated as “recovered” and released too early from hospitals.\nScientists in and outside China agree that reinfection is a highly unlikely explanation for the patients who retest positive. They say testing errors are more likely to blame — either false negatives that resulted in patients being discharged too early, or false positives when they retested and were taken back into hospital.\nThose errors could be attributed to contaminated test samples, human error while taking swabs, or an oversensitive nucleic acid test that detects strands of virus.\n\nThe Los Angeles Times quoted Dr. Keiji Fukuda, director of Hong Kong University’s School of Public Health, as saying that COVID-19 reinfection was unlikely and that false positives in testing procedures were a more likely possibility:\n\n“If you get an infection, your immune system is revved up against that virus,” he said. “To get reinfected again when you’re in that situation would be quite unusual unless your immune system was not functioning right.”\nWhat’s more likely is that people are being released from hospitals while still carrying dormant fragments of the disease that are not infectious but resemble the virus when put through a nucleic acid test, he said.\n“The test may be positive, but the infection is not there,” he said\n\nDr. Clifford Lane, deputy director for Clinical Research and Special Projects at the National Institute of Allergy and Infectious Diseases, was also quoted as suggesting that the real issue was with inaccuracies in testing patients who had not fully recovered rather than with reinfection:\n\nAnother possibility is that the level of virus fell below the threshold that tests could detect but then resurfaced, [Lane] said.\n“So it looks like [some patients] cleared the virus and then the virus came back,” Lane said. “But they never really cleared it and they had a more prolonged course of infection.”\nLane was one of only two U.S. experts in a World Health Organization delegation that visited China in February. He said Chinese experts told the visitors that there were no examples of people who became “reinfected.”\n\nA coronavirus infection’s going into a “dormant” stage and then re-emerging was another possibility for explaining the appearance of reinfection suggested by Dr. Philip M. Tierno, Clinical Professor of Microbiology and Pathology at at New York University: “Once you have the infection, it could remain dormant with minimal symptoms.  And then you can get an exacerbation if it finds its way into the lungs.” \nThe Associated Press also offered the possibility that mutations in the virus might conceivably make it different enough to reinfect persons who had acquired immunity to an earlier version:\n\nScientists at the at the Fred Hutchinson Cancer Research Center in Seattle say the 30,000-letter genetic code of the virus changes by one letter every 15 days. It’s not known how many of these changes would be needed for the virus to seem different enough to the immune system of someone who had a previous version of it for it to cause a fresh infection.\n\nDr. Anthony S. Fauci, the Director of the National Institute of Allergy and Infectious Diseases who is for many Americans the most familiar source for information on the coronavirus disease (due to his numerous appearances at government press conferences and cable television news reports), told Congress that he felt it was unlikely anyone could become reinfected by the virus: “We haven’t formally proved it, but … if this acts like any other virus, once you recover, you won’t get reinfected.”   \nWhile this topic is an area that requires additional study, medical professionals still caution that “The things to worry about are at the other end of the illness” — that the primary focus should still be on limiting the outbreak by trying to ensure that symptomatic and undiagnosed persons are not exposing themselves to, and potentially infecting, others.", "links": ["https://www.latimes.com/world-nation/story/2020-03-13/china-japan-korea-coronavirus-reinfection-test-positive", "https://www.snopes.com/ap/2020/03/15/how-coronavirus-spreads-and-infects/", "https://www.c-span.org/video/?470277-1/federal-health-officials-testify-coronavirus-outbreak-response"], "imgs": []}