{"title": "Are People With Type-A Blood More Susceptible to COVID-19?", "subtitle": "Such an observation would have an impact on how medical professionals identify those most at risk of the disease.", "date": "20 March 2020", "claim": "People with Type-A blood are more susceptible to COVID-19.", "rating": "Unproven", "true_part": "", "false_part": "", "content": "On March 11, 2020, researchers in China released a preliminary draft of a study that collected data on the ABO blood types of 2,173 patients with lab-verified cases of the COVID-19 coronavirus disease from two hospitals in Wuhan and one in Shenzhen. The researchers compared the distribution of blood types in the infected patients to the distribution of blood types of uninfected people (as a control group) from Wuhan City and Shenzhen City.\nThe team analyzed the data in an effort to answer two questions. First, if infection from COVID-19 appeared disproportionately high or low in any blood group; and second, if instances of death from COVID-19 had any relationship to blood type. The researchers found that:\nThese results, which the authors cautioned should not be used to guide clinical practice, came with several caveats. First, this study is a draft of a research paper that has not yet been peer-reviewed or published in any journal. Second, the study is limited in both sample size and geographic scope. Speaking to the South China Morning Post, Gao Yingdai, a Tianjin-based researcher not involved in the study, said that while a 2,000-person sample is not necessarily small, it is dwarfed by the number of cases globally. \nTara Moriarty, an expert in infectious diseases and immunopathology with the University of Toronto, told us by email that the study provides “an interesting observation that may have an impact on how we identify those most at risk of disease, but until it has been fully peer-reviewed and confirmed/disconfirmed by additional studies, we cannot yet say if blood type affects susceptibility to COVID-19 infection.”\nGao, the Tianjin-based researcher, echoed this point with the Morning Post, saying the results “may be helpful to medical professionals, but ordinary citizens should not take the statistics too seriously” and that “If you are type A, there is no need to panic.”\nABO blood type is determined by the the presence or absence of particular sugars and of specific proteins known as antibodies found in the plasma component of blood, as well as the presence or absence of proteins or sugars known as antigens found on the surface of red blood cells. Several viral infections, including Severe Acute Respiratory Syndrome (SARS), appear to have a certain affinity for specific blood types. “Blood type groups are associated with differences in vulnerability to infection with multiple viruses, and severity of outcomes, Moriarity told us. “Examples include HIV, viruses that cause gastrointestinal illness (norovirus, rotavirus), as well as the SARS coronavirus that caused the 2002-2003 SARS outbreak.”\nThe exact mechanism behind difference in how viruses respond to blood types is not well-understood, but may involve how antigens and antibodies inhibit or promote a virus binding to the surface of a cell, Moriarity said.\nIn short, ample scientific evidence exists for the hypothesis that COVID-19 — or other infections — could affect people differently depending on their blood type. However, such a conclusion cannot be made confidently on the basis of a single study that has yet to be peer reviewed or published in a journal. As such, we rank this claim about blood types as “Unproven.”", "links": ["https://www.medrxiv.org/content/10.1101/2020.03.11.20031096v1.full.pdf", "https://www.scmp.com/news/china/society/article/3075567/people-blood-type-may-be-more-vulnerable-coronavirus-china-study", "https://www.scmp.com/news/china/society/article/3075567/people-blood-type-may-be-more-vulnerable-coronavirus-china-study", "https://www.nhs.uk/conditions/blood-groups/", "https://jamanetwork.com/journals/jama/article-abstract/200582", "https://jamanetwork.com/journals/jama/article-abstract/200582"], "imgs": []}