{"title": "Was This Pandemic Poem Written by Kathleen O’Mara in 1919?", "subtitle": "A global pandemic did indeed inspire this poem. But that's as far as it goes.", "date": "6 April 2020", "claim": "Kathleen O'Mara is the author of a poem written \"during the 1919 pandemic.\"", "rating": "Misattributed", "true_part": "", "false_part": "", "content": "In April 2020, as the world fought the spread of COVID-19, a poem supposedly written during a previous pandemic started to circulate on social media. This poem, which starts with the line “and the people stayed home,” can be seen at the bottom of this article.\nThis piece of text was accompanied by a variety of claims as it circulated on social media. On Reddit, for instance, it was shared under the title “Poem written by Kathleen O’Mara during the 1919 pandemic.” A posting on Imgur included a slightly more convoluted version of this claim: O’Mara wrote this poem in 1869 and it was reprinted during the 1919 pandemic. According to the latter link:\nHistory repeats itself. Came across this poem written in 1869, reprinted during 1919 Pandemic.\nThis is Timeless …\nIt was written in 1869 by Kathleen O’Mara:\nThis poem was not written by someone named Kathleen O’Mara in 1869 and then reprinted in 1919. (Side note: The “Spanish Flu” pandemic is referred to on the CDC website as the “1918 pandemic,” not the “1919 pandemic.”) This text is actually a modern-day poem written during the COVID-19 coronavirus disease pandemic by author Catherine M. O’Meara. \nO’Meara posted this poem to her blog The Daily Round on March 16, 2020. The poem went viral, racking up thousands of shares as it circulated on social media. On March 19, Oprah Magazine dubbed O’Meara, a former teacher in Madison, Wisconsin, the “poet laureate of the pandemic,” writing:\nKitty O’Meara is the poet laureate of the pandemic. Her untitled prose poem, which begins with the line, “And the people stayed home,” has been shared countless times, on countless backgrounds, with countless fonts, since its first posting. It was most widely popularized by Deepak Chopra, and has since been shared by everyone from Bella Hadid to radio stations in Australia. The poem has become shorthand for a silver-linings perspective during the coronavirus outbreak — the hope that something good can come out of this collective state of “together, apart.”\nHere’s an Instagram posting of O’Meara’s modern pandemic poem:\n\nA post shared by Gina Bonacci (@healthfully_gb) on Mar 16, 2020 at 6:48am PDT\n", "links": ["https://www.reddit.com/r/Mindfulness/comments/fut36f/poem_written_by_kathleen_omara_during_the_1919/", "https://imgur.com/gallery/uoTsLm3", "https://texags.com/forums/16/topics/3104746", "https://www.cdc.gov/flu/pandemic-resources/1918-pandemic-h1n1.html", "https://the-daily-round.com/2020/03/16/in-the-time-of-pandemic/", "https://www.oprahmag.com/entertainment/a31747557/and-the-people-stayed-home-poem-kitty-omeara-interview/", "https://www.instagram.com/p/B9y_jLIBTcy/?utm_source=ig_embed&utm_campaign=loading"], "imgs": []}