{"title": "Was Eminem Diagnosed with Coronavirus?", "subtitle": "Will the real author of this viral joke please stand up?", "date": "7 February 2020", "claim": "Rapper Eminem was the first celebrity to be diagnosed with new coronavirus in February 2020.", "rating": "False", "true_part": "", "false_part": "", "content": "In February 2020, the claim that rapper Eminem (Marshall Mathers) had been diagnosed with new coronavirus attracted attention on social media:\nBREAKING: Eminem becomes the first celebrity to be diagnosed with Coronavirus.\nClearly some people did not read past the headline. While the humorous nature of the post seemed rather obvious, search queries from people concerned with Eminem’s health quickly registered here at Snopes. \nEminem did not contract coronavirus. This silly piece of text is just a joke that repurposed some of Eminem’s lyrics. We’re not entirely sure where this joke originated because the text was copy and pasted across different social media posts.\nHere’s how this joke appeared on the “Dad Jokes” section of Reddit:\n“In a statement released by doctors, it has been revealed that his palms were sweaty, knees weak and arms were heavy.. He presented with vomit on his sweater already.. Initial testing has revealed it was mums spaghetti”\nIf this “news” story sounds a bit familiar, it’s because the text borrows heavily from Eminem’s “Lose Yourself.” The song, which won the Academy Award for Best Original Song in 2002, starts with the lyrics:\n“His palms are sweaty, knees weak, arms are heavy\nThere’s vomit on his sweater already, mom’s spaghetti”\nHere’s a video of the song from the movie “8 Mile”:\nThis is hardly the first piece of misinformation to spread about the coronavirus. We’ve previously debunked claims about “The Simpsons” predicting the outbreak, a pamphlet warning about the disease spreading via sex with animals, and China seeking approval to kill 20,000 patients to stop the spread of the disease. All of these claims were false.\nOf course, the 2020 outbreak of coronavirus, or 2019-nCoV acute respiratory disease, was no joke. As of this writing, more than 30,000 people worldwide were reported to have been infected and more than 600 had died as a result in China. Learn more about the virus here.", "links": ["https://www.reddit.com/r/dadjokes/comments/ezggef/breaking_news_eminem_has_just_become_the_first/", "https://www.snopes.com/fact-check/simpsons-predict-coronavirus/", "https://www.snopes.com/fact-check/coronavirus-bulletin-farm-animals/", "https://www.snopes.com/fact-check/china-kill-coronavirus-patients/", "https://www.cdc.gov/coronavirus/2019-ncov/about/index.html"], "imgs": []}