{"title": "Did Schumer Delete a Tweet Criticizing Trump for Banning Air Travel from China ‘Prematurely’?", "subtitle": "Pranksters no longer need spend time with Photoshop to create convincing fake tweets.", "date": "28 March 2020", "claim": "Sen. Chuck Schumer tweeted a criticism of President Trump for the latter's 'premature' ban of air travel from China.", "rating": "False", "true_part": "", "false_part": "", "content": "At the end of February 2020, various right-leaning websites and social media users reproduced a purported Feb. 5 tweet from Sen. Chuck Schumer (D-N.Y.) criticizing President Trump for having “prematurely” restricted travel to and from China (in order to protect against the COVID-19 coronavirus’ being spread to the U.S.), and a month later some were still taking the tweet at face value and reposting it:\nThis 👇🏻 pic.twitter.com/8IQlNh9aPn\n— James Woods (@RealJamesWoods) March 28, 2020\n\nThat this alleged tweet did not exist in Schumer’s Twitter timeline was also taken by some of those who reproduced and criticized it as evidence that Schumer had subsequently tried to cover it up by deleting it.\n\nIn what amounts to a plea of “guilty” to the charge of being full of crap and criticizing President Trump no matter what he does, Senator Chuck Schumer has deleted his February 5 tweet reading:\n“The premature travel ban to and from China by the current administration is just an excuse to further his ongoing war against immigrants. There must be a check and Balance on these restrictions.”\nI hope that President Trump ruthlessly mocks Schumer for this.  If Schumer had an honest bone in his body, he would acknowledge that Trump did the right thing and that he was wrong to criticize him.  Schumer and all Americans should be grateful that President Trump took quick and effective action that has so far limited the impact on us of the epidemic.  Had he followed Schumer’s advice, the epidemic would have spread here, as it has in Italy.\n\nIn fact, Schumer never tweeted any such thing — the image of the purported tweet was just a fabrication likely created using one of the many fake Tweet generator websites that exist online.\nThe ProPublica news outlet maintains a Politiwoops database of “the Tweets They Didn’t Want You to See” which “tracks deleted tweets by public officials, including people currently in office and candidates for office.”  That database recorded no such deleted tweet from Schumer’s Twitter account.\nAs well, we found no evidence that this purported tweet had ever been retweeted, commented upon, or otherwise reproduced at the time it was supposedly posted, as it certainly would have been.\nSome websites that wrongly criticized Schumer over the tweet without verifying it later acknowledged that they had been hoaxed:\n\nHOAXED: My apologies to readers. The allegedly deleted Schumer tweet does not appear in Pro Publica’s authoritative list of deleted Schumer tweets. I regret not verifying the authenticity of the deleted tweet before posting this. I’m declaring it a hoax.\n\n\n", "links": ["https://www.washingtontimes.com/news/2020/mar/22/trump-never-actually-banned-flights-from-china-or-/", "https://t.co/8IQlNh9aPn", "https://twitter.com/RealJamesWoods/status/1243761890116812800?ref_src=twsrc%5Etfw", "https://www.americanthinker.com/blog/2020/02/chuck_schumer_quietly_deletes_his_tweet_criticizing_trumps_china_travel_ban_as_premature_and_war_against_immigrants.html", "https://www.tweetgen.com/", "https://projects.propublica.org/politwoops/", "https://projects.propublica.org/politwoops/user/SenSchumer", "https://www.powerlineblog.com/archives/2020/02/schuminations-hiding-the-truth.php"], "imgs": []}