{"title": "Did Fauci Warn Trump in 2017 That a ‘Surprise Outbreak’ Was Coming?", "subtitle": "Dr. Anthony Fauci has led the NIAID for more than three decades, advising five U.S. presidents on global health threats.", "date": "14 May 2020", "claim": "NAIAD director Dr. Anthony Fauci warned in January 2017 that the Trump administration would face a surprise infectious disease outbreak.", "rating": "True", "true_part": "", "false_part": "", "content": "In the spring of 2020, as debate raged over the timeliness and effectiveness of U.S. President Donald Trump’s response to the COVID-19 coronavirus pandemic, some critics pointed to an article dating from shortly before Trump’s January 2017 inauguration, in which Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID), seemingly warned that the incoming president would “no doubt” be faced with a “surprise infectious disease outbreak”:\n\nThis image did reflect a genuine article, published on Jan. 11, 2017 (nine days before Trump’s inauguration), headlined “Fauci: ‘No doubt’ Trump will face surprise infectious disease outbreak.” That article read (in part):\nAnthony S. Fauci, MD, director of the National Institute of Allergy and Infectious Diseases, said there is “no doubt” Donald J. Trump will be confronted with a surprise infectious disease outbreak during his presidency.\nFauci has led the NIAID for more than 3 decades, advising the past five United States presidents on global health threats from the early days of the AIDS epidemic in the 1980s through to the current Zika virus outbreak.\nDuring a forum on pandemic preparedness at Georgetown University, Fauci said the Trump administration will not only be challenged by ongoing global health threats such as influenza and HIV, but also a surprise disease outbreak.\n“The history of the last 32 years that I have been the director of the NIAID will tell the next administration that there is no doubt they will be faced with the challenges their predecessors were faced with,” he said.\nAs noted above, Dr. Fauci’s comments were made during a Georgetown University forum on pandemic preparedness, at which Fauci delivered the keynote address on the subject of “Pandemic Preparedness in the Next Administration,” which he opened with the following statement:\n“I thought I would bring that perspective [of my experience in five administrations] to the topic today, [which] is the issue of pandemic preparedness. And if there’s one message that I want to leave with you today based on my experience … [it] is that there is no question that there will be a challenge to the coming [Trump] administration in the arena of infectious diseases … both chronic infectious diseases in the sense of already ongoing disease … but also there will be a surprise outbreak, and I hope by the end my relatively short presentation you will understand why history, the history of the last 32 years that I’ve been the director of the NAIAD, will tell the next administration that there’s no doubt in anyone’s mind that they will be faced with the challenges that their predecessors were faced with.”\nDr. Fauci did not literally warn in January 2017 that the Trump administration would certainly face a deadly pandemic affecting the U.S., but he said more generally (while speaking on the subject of pandemic preparedness) there was “no question” that a “surprise outbreak” of infectious disease would occur. The outgoing (Obama) administration had already faced multiple such events, including the 2009 swine flu (H1N1) pandemic, the 2015–2016 Zika virus epidemic, and the 2014-16 Ebola outbreak in West Africa:\nFauci and others noted some of the disease outbreaks that recent administrations have faced, including current President Barack Obama, whose administration was tested early on with an H1N1 influenza pandemic in 2009. More recently, the administration was forced to repurpose almost $600 million in federal funds set aside for the Ebola outbreak when Republicans rejected Obama’s request for $1.9 billion to fund the nation’s Zika response.", "links": ["https://www.healio.com/infectious-disease/emerging-diseases/news/online/%7B85a3f9c0-ed0a-4be8-9ca2-8854b2be7d13%7D/fauci-no-doubt-trump-will-face-surprise-infectious-disease-outbreak", "https://www.cdc.gov/flu/pandemic-resources/2009-h1n1-pandemic.html", "https://www.cdc.gov/mmwr/volumes/65/wr/mm6503e1.htm", "https://www.cdc.gov/vhf/ebola/history/2014-2016-outbreak/index.html"], "imgs": []}