{"title": "Was This ‘Health Bulletin’ an Accurate Coronavirus Warning?", "subtitle": "A viral social media post erroneously advised the public to \"keep your throat moist\" in order to avoid contracting the respiratory infection.", "date": "31 January 2020", "claim": "A viral social media post in January 2020 represented an authentic, accurate \"health bulletin\" about the new coronavirus outbreak from an official public health authority.", "rating": "False", "true_part": "", "false_part": "", "content": "In January 2020 we received multiple inquiries from readers about an alert that was shared widely on Facebook and Twitter, purporting to be an “emergency notification” from an unspecified “Ministry of Health” about an ongoing outbreak of a new coronavirus. \nBroadly speaking, the warning appeared in two forms. The most commonly shared was a text post that typically read as follows:\n*Urgent: Health Bulletin to the Public *\n*Ministry of health’s emergency notification to the public that the Coronavirus outbreak this time is very very serious & fatal. There’s no cure once you are infected.*\n*Its spreading from China to various countries*\n*Prevention method is to keep your throat moist, do not let your throat dry up. Thus do not hold your thirst because once your membrane in your throat is dried, the virus will invade into your body within 10 mins.*\n*Drink 50-80cc warm water, 30-50cc for kids, according to age.* *Everytime u feel your throat is dry, do not wait, keep water in hand.* *Do not drink plenty at one time as it doesn’t help, instead continue to keep throat moist.*\n*Till end of March 2020, do not go to crowded places, wear mask as needed especially in train or public transportation* *Avoid fried or spicy food and load up vitamin C.*\n*The symptoms/ description are*\n*1.repeated high fever*\n*2.prolonged coughing after fever*\n*3.Children are prone*\n*4.Adults usually feel uneasy,*headache and mainly respiratory related*\n*5: highly contagious*\n\nThe message was typically followed up with an exhortation to share its warnings, such as, “Please forward to help others.” One version of the viral alert even concluded by pleading with readers, “Please share if you care for human life.” \nThe second principal form in which the message appeared was as a photograph of a printed email, dated Jan. 28, 2020, and purporting to have been sent by “NWLLAB.” It contained many of the same key components — it purported to come from an unspecified “MOH” (Ministry of Health), and its main recommendation to the public was again to “keep your throat moist” by drinking water. It read as follows:\nPls tell ur families, relatives and friends\nMOH Health Bulletin to the Public:\nThe Upper Respiratory Infection affecting China at present is quite serious. The virus causing it is very potent and is resistant to existing antibiotics. \n(virus is not bacterial infection hence cannot be treated by antibiotics).\nThe prevention method now is to keep your throat moist, do not let your throat dry up. Thus do not hold your thirst because once your membrane in your throat is dried, the virus will invade into your body within 10 mins. Drink 50-80cc warm water, 30-50cc for kids, according to age. Everytime [sic] you feel your throat is dry, do not wait, keep water in hand. Do not drink plenty at one time as it does not help; instead, continue to keep throat moist. Till end of March, do not go to crowded places, wear mask as needed especially in train or public transportation. \nAvoid fried or spicy food and load up vitamin C. \nThe symptoms/description are:\n1. Repeated high fever.\n2. Prolonged coughing after fever. \n3. Children are more prone. \n4. Adults usually feel uneasy, headache and mainly respiratory related illness. \nThis illness is highly contagious. Let’s continue to pray and wait for further notice about the infection. \nPlease share. \n\nNeither the printed email nor the viral Facebook message were official statements produced by any public health authority. The alert was apt to spread widely online precisely because it did not include any details about its supposed source, aside from mentioning a “Ministry of Health” in an unspecified country or region. \nThe message also contained erroneous advice, claiming that readers could avoid contracting the virus by “keeping your throat moist,” avoiding fried or spicy food, and taking vitamin-C supplements.\nAccording to the U.S. Centers for Disease Control and Prevention (CDC), the so-called “novel coronavirus (2019-nCoV)” outbreak is thought to have first been transmitted from animals to humans in Wuhan, Hubei Province, in China. Since then, it has spread from person to person. Previous coronaviruses like Middle East respiratory syndrome (MERS) and Severe acute respiratory syndrome (SARS) have been transmitted between humans primarily through “respiratory droplets” ⁠— that is, coughs and sneezes. \nThe CDC’s general respiratory infection prevention advice applies to the 2019-nCoV outbreak, as follows:\nNo evidence exists to indicate that any public health authority is officially advising the public that a dry throat makes individuals more vulnerable to contracting the virus, and that therefore drinking water is an effective prevention method, nor that vitamin C deficiency contributes to one’s vulnerability to contracting the illness, nor that fried and spicy food are a medium for transmission of 2019-nCoV. ", "links": ["https://www.facebook.com/stteklehaimanot.ottawa.7/posts/541679743365250", "http://archive.is/ISzJ3", "https://www.facebook.com/MethodistChurchFiji/photos/a.494219720667971/2776065395816714/?type=3&theater", "http://archive.is/i6pZd", "http://archive.is/QDCLo", "http://archive.is/n8Vnm"], "imgs": ["https://www.snopes.com/tachyon/2020/01/pixelScreenshot-2020-01-30-at-10.47.38.png", "https://www.snopes.com/tachyon/2020/01/83773856_2776065399150047_4406228702975754240_o.jpg"]}