{"title": "Can a Cattle Vaccine Be Used To Fight COVID-19?", "subtitle": "The confusion seems to stem from the overuse of the word \"coronavirus.\"", "date": "26 March 2020", "claim": "A vaccine meant for cattle can be used to fight COVID-19.", "rating": "False", "true_part": "", "false_part": "", "content": "In March 2020, a rumor started to circulate on social media claiming that the world has been using a vaccine for coronavirus on cattle for years, and that the current panic about a growing COVID-19 pandemic was being overblown by the media:\n\nHowever, as of this writing, no vaccine currently exists for the novel coronavirus that causes the COVID-19 disease.\nThe confusion seems to stem from a misunderstanding of the word “coronavirus.” While this word was frequently used in the early days of the COVID-19 pandemic to describe the virus that causes the new disease, “coronavirus” is actually a broad term that refers to a group of viruses.\nThe Centers for Disease Control and Prevention (CDC) writes:\n“Coronaviruses are named for the crown-like spikes on their surface. There are four main sub-groupings of coronaviruses, known as alpha, beta, gamma, and delta.\n“Human coronaviruses were first identified in the mid-1960s. [There are] seven coronaviruses that can infect people…”\nThe above-displayed photograph does show a real vaccine used to treat bovine coronavirus. This vaccine, however, is not effective in humans or against the new strain of coronavirus that emerged at the end of 2019. \nThis product, called ScourGard 4K, is for the “vaccination of healthy, pregnant cows and heifers as an aid in preventing diarrhea in their calves caused by bovine rotavirus (serotypes G6 and G10), bovine coronavirus, and enterotoxigenic strains of Escherichia coli having the K99 pili adherence factor.”\nMing Tan, a faculty member of the Division of Infectious Diseases at Cincinnati Children’s Hospital Medical Center, told PolitiFact that:\nThe coronavirus used in the Bovine Rotavirus-Coronavirus Vaccine is distinct from the current coronavirus.\n“The antibodies produced by the Bovine Rotavirus-Coronavirus Vaccine will not recognize the current “coronavirus” and thus will not protect humans from infection.”\nAlthough the disease at the center of the COVID-19 pandemic was often referred to as simply “coronavirus” in the early days of 2020, a more scientific name has since emerged. According to the World Health Organization, the virus is called SARS-CoV-2 (severe acute respiratory syndrome coronavirus 2) and the disease is referred to as COVID-19. \nTo sum up: The word “coronavirus” refers to a group of viruses, not one specific pathogen. A vaccine that is developed for a particular strain of coronavirus, such as bovine coronavirus, SARS, or MERS, is not necessarily going to be effective against other variations in this group. At the moment, no vaccine exists for SARS-CoV-2. For these reasons, we rate this claim “False.”", "links": ["https://www.cdc.gov/coronavirus/types.html", "https://www.zoetisus.com/contact/pages/product_information/msds_pi/pi/ScourGuard_4K.pdf", "https://www.zoetisus.com/contact/pages/product_information/msds_pi/pi/ScourGuard_4K.pdf", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/technical-guidance/naming-the-coronavirus-disease-(covid-2019)-and-the-virus-that-causes-it"], "imgs": ["https://www.snopes.com/tachyon/2020/03/cattle-vaccine.jpg"]}