{"title": "Did Health Experts ‘Predict’ New Coronavirus Could Kill 65 Million People?", "subtitle": "Some details from a mock health exercise were confused with real-world reports.", "date": "31 January 2020", "claim": "Health experts predicted the new coronavirus could kill 65 million people.", "rating": "False", "true_part": "", "false_part": "", "content": "Amid growing public anxiety about an outbreak of a new coronavirus originating in China in late January 2020, various media outlets reported on a dire warning that suggested the virus could kill 65 million people annually. \nThe Daily Mail, for example, reported that health experts had “predicted” the virus could kill 65 million people in a year. The publication later issued a correction and updated its article.\nSuch stories were prompted by a mock pandemic health exercise run by Johns Hopkins Center for Health Security on Oct. 18, 2019. But that exercise did not “predict” the current virus would kill 65 million people.\nJohns Hopkins released a statement countering the viral news stories (emphasis added):\nIn October 2019, the Johns Hopkins Center for Health Security hosted a pandemic tabletop exercise called Event 201 with partners, the World Economic Forum and the Bill & Melinda Gates Foundation. Recently, the Center for Health Security has received questions about whether that pandemic exercise predicted the current novel coronavirus outbreak in China. To be clear, the Center for Health Security and partners did not make a prediction during our tabletop exercise. For the scenario, we modeled a fictional coronavirus pandemic, but we explicitly stated that it was not a prediction. Instead, the exercise served to highlight preparedness and response challenges that would likely arise in a very severe pandemic. We are not now predicting that the nCoV-2019 outbreak will kill 65 million people. Although our tabletop exercise included a mock novel coronavirus, the inputs we used for modeling the potential impact of that fictional virus are not similar to nCoV-2019.\nAccording to the U.S. Centers for Disease Control, coronaviruses are “a large family of viruses that are common in many different species of animals, including camels, cattle, cats, and bats. Rarely, animal coronaviruses can infect people and then spread between people such as with MERS and SARS.”\nThe coronavirus that was first reported in Wuhan, Hubei Province, in China, is a respiratory illness dubbed 2019-nCoV that had killed 213 people in China as of this writing. On Jan. 30, 2020, the World Health Organization declared it a global emergency. Chinese authorities have quarantined 50 million people in an unprecedented effort to contain the virus.", "links": ["https://archive.is/JznLH#selection-15203.0-15208.0", "https://news.yahoo.com/health-experts-issued-ominous-warning-170400102.html?guccounter=1", "https://www.dailymail.co.uk/health/article-7925475/US-health-experts-hosted-fictional-coronavirus-simulation-THREE-months-ago.html", "http://www.centerforhealthsecurity.org/event201/", "http://www.centerforhealthsecurity.org/newsroom/center-news/2020-01-24-Statement-of-Clarification-Event201.html", "http://www.centerforhealthsecurity.org/event201/", "https://www.cdc.gov/coronavirus/2019-nCoV/summary.html", "https://www.bbc.com/news/world-51318246", "https://www.latimes.com/science/story/2020-01-28/wuhan-chinas-coronavirus-50-million-people-quarantined"], "imgs": []}