{"title": "Is COVID-19 Being Spread Through Gas Pumps?", "subtitle": "Gas pump handles are one of many common objects that could be contaminated, so consumers should take reasonable precautions to avoid exposure.", "date": "22 March 2020", "claim": "The COVID-19 coronavirus disease is \"spreading quickly from gas pumps.\"", "rating": "Mixture", "true_part": "Gas pump handles are a potential source of surface contact transmission of the COVID-19 coronavirus.", "false_part": "Gas pumps are only one of many commonly-handled objects that could transmit the COVID-19 coronavirus, and we have found no substantiated reports of anyone's having been infected in that fashion yet.", "content": "In March 2020, during the COVID-19 coronavirus disease pandemic, social media users began sharing warnings about the virus’ allegedly “spreading quickly from gas pumps.”  Such warnings cautioned readers to use gloves or paper towels while pumping gas and to discard them immediately afterward:\n\nOne particular version of this class of warning attributed the advice to “Galway Hospital” in Ireland:\n\nHowever, University Hospital Galway told TheJournal.ie that “we’ve not issued any such advice.”\nAs for the content of the message (regardless of its source), as with many coronavirus-related pieces of advice, it’s something of a mixed bag.\nWe’re not aware of any credible reports of COVID-19 being spread via gas pump handles (something that would likely be difficult to determine as the specific source of any particular infection).  It is true that surface contact is one of the means of transmission of the novel coronavirus, and since gas pumps are objects that are typically handled by many different people throughout the course of a day — in many places without being regularly cleaned between uses (especially in areas where self-service is the norm) — they are a potential route for the virus to spread from person to person. \nHow much risk pumping gas poses relative to other ordinary day-to-day activities is difficult to determine.  Consumer Reports, for example, offered advice consistent with what was expressed in social media warnings:\n\nFor many [persons] the occasional trip to the gas station is inevitable, as is touching the pump handle and payment keypad. Pump handles and credit card keypads, which are high-touch areas, could have the virus present, which experts say can stay alive for hours or even days on hard surfaces …\n[T]here are a few things you can do that will help you stay safe when you have to pump gas.\n• Consider carrying some disposable nitrile or latex gloves in your car to use when gripping the pump handle. Short of that, you can try to use paper towels that are sometimes available at the pump or have some with you to cover your hands when you grip the handle. \n• Invert the gloves and throw them away, and also any paper towels you might have used. Use hand sanitizer to make sure your hands are clean after you’re done and before you get back into your car.\n\nOn the other hand, TheJournal.ie quoted the Irish Petroleum Industry Association as dismissive of the advice in the social media messages:\n\nOur members are implementing enhanced hygiene protocols in our service station shops. In line with HSE [Health and Safety Executive] advice, our workers regularly wash and sanitise their hands and the areas customers interact with such as fuel nozzles, credit card PIN pads, door handles and food areas.\nWe are aware of messages being shared on social media and wanted to inform customers that pump handles are no more or less prone to the spread of infection than any other hard surface and to outline the significant steps we are taking to combat the spread of Covid-19 and keep our valued customers safe.\n\nGas pumps could be considered somewhat more of a concern because consumers typically touch other surfaces — such as the door handles and interiors of their vehicles — immediately afterwards and could thereby create yet another pathway of contamination for themselves or others.  However, gas pumps are just one of many objects that multiple people commonly handle in similar fashion during the course of a day, including ATMs, payment processing systems, shopping cart handles, and currency, all of which pose varying degrees of risk.\nHow much potential for spreading the coronavirus any such object may present depends in large part on whether it’s properly cleaned between uses, something that the public may not know (and should not bank on).  In general, the best advice is to wipe down surfaces you need to touch with disinfectant wipes, and don’t touch your face or anything at home until you’ve washed your hands thoroughly afterwards:\n\nJohn Eichberger, executive director of the nonprofit Fuels Institute, says gas station owners and operators are doing what they can to combat the spread of COVID-19 by cleaning their facilities more often. But that might not be enough assurance for some motorists.\n“If consumers are really worried about touching a gas pump handle, they can do what they do when they go to a grocery store and wipe down surfaces with disinfectant wipes when they need to touch something,” Eichberger says.\nAnd as you would after any trip outside your home during this unusual time, remember to wash your hands before touching anything at home.\n", "links": ["https://www.saolta.ie/hospital/university-hospital-galway", "https://www.thejournal.ie/debunked-galway-petrol-pumps-5052956-Mar2020/", "https://www.nih.gov/news-events/news-releases/new-coronavirus-stable-hours-surfaces", "https://www.consumerreports.org/cars-how-to-protect-yourself-against-coronavirus-when-pumping-gas/", "https://www.wired.com/story/coronavirus-disinfectant-cleaning-guide/"], "imgs": []}