{"title": "Is the ‘Umbrella Corporation’ Logo Oddly Similar to a Wuhan Biotech Lab’s?", "subtitle": "Some concern arose over apparent connections between the video game \"Resident Evil\" and a new coronavirus outbreak.", "date": "29 January 2020", "claim": "The fictional \"Umbrella Corporation\" from the game \"Resident Evil\" shares a logo with a biotech lab in Wuhan, Hubei Province in China, where a new coronavirus is believed to have originated.", "rating": "False", "true_part": "", "false_part": "", "content": "In the video game series “Resident Evil,” a virus created by the pharmaceutical company “The Umbrella Corporation” turns many of the residents of Raccoon City into zombie-like creatures. While the events in this game were obviously fiction, some social media users pointed to a few strange coincidences in January 2020 as China and other countries responded to the real-world spread of a new coronavirus. \nSocial media posts claimed that the logo of a biotech lab in Wuhan, the Chinese city at the center of the January 2020 outbreak, was eerily similar to the logo of the Umbrella Corporation. Furthermore, these posts noted how “corona” was an anagram for “racoon,” the city at the center of “Resident Evil.” \n\nThis eerie coincidence wasn’t too eerie on second glance. \nFor starters, the picture on the left did not show the logo for a biotech company in Wuhan. As one can infer from its name (which can be fully seen on an uncropped version of this image), Shang Hai Ruilan Bao Hu San Biotech Limited is located in Shanghai, not Wuhan. These two Chinese cities are approximately 500 miles away from one another. \nThe company’s website (ruiblue.com) shows that the blue-and-white, umbrella-like logo is real, and that the company is located in Shanghai, China.\nThe claim that “Corona” is an anagram for “Raccoon” is also a curious one. As you’ll notice by re-reading the previous sentence, “Corona” has a single “C” while “Raccoon” has two “c’s.” While Merriam-Webster noted that “Racoon” is a valid, albeit less common, spelling for this dumpster-diving mammal, the city in the “Resident Evil” games is spelled “Raccoon City.” \n\nIn short, the logo for the Umbrella Corporation is similar to the logo of a biotech company in China. However, this company, which no longer appears to be in operation, was not located in Wuhan, the Chinese city at the center of the coronavirus outbreak in 2020, but in Shanghai, a city about 500 miles to the east.", "links": ["https://twitter.com/Undoomed/status/1221545217641402370", "https://kotaku.com/chinese-resident-evil-fans-think-this-biotech-companys-1835609001", "http://archive.is/a2gZH", "https://www.merriam-webster.com/dictionary/racoon"], "imgs": ["https://www.snopes.com/tachyon/2020/01/UndoomedUmbrellaTweet.png", "https://www.snopes.com/tachyon/2020/01/raccoon-city.jpg"]}