{"title": "Does ‘Every Election Year’ Have a Coinciding Disease?", "subtitle": "A conspiratorial meme about disease outbreaks got a number of key facts wrong.", "date": "3 March 2020", "claim": "A major disease outbreak occurred in \"every election year\" since 2004.", "rating": "False", "true_part": "", "false_part": "", "content": "In late February and early March 2020, social media users shared a meme containing the conspiratorial claim that a disease outbreak had coincided with “every election year” since 2004.\nReaders asked Snopes to verify the claims made in the meme below, which circulated amid fears over a new coronavirus that causes the disease known as COVID-19. As of this writing, six people in the U.S. had died due to the novel virus, while health officials warned that the international outbreak of the disease could become a pandemic.\n\nThe meme is misleading for a number of reasons. It implies without proffering evidence that the outbreaks didn’t originate naturally, but rather were the result of some amorphous scheme to influence politics — though which country’s politics is never directly stated (perhaps the U.S.?), and the illnesses listed varied in virulence and severity, not to mention affected multiple countries at various times.  \nThe meme is also misleading for a reason made obvious by the name of the coronavirus-caused disease, COVID-19: the number 19 signifies the year 2019, when that virus was first detected, not 2020 as the meme implies. \nIndeed, the meme gets a number of years wrong in regard to when the illnesses were first detected globally. For example, the outbreak of severe acute respiratory syndrome (SARS) didn’t happen in 2004, the year U.S. President George W. Bush was reelected. SARS was first reported in February 2003, which was not a presidential election year, and was deemed contained in the U.S. by May 2003. Similarly, swine flu was declared a pandemic in the spring of 2009, not 2010, which was a midterm election year in the United States.\nFurthermore, it’s unclear what the term “election year” means. Again assuming the meme is addressing the U.S., some of the years listed were presidential election years, while others were midterm election years. But elections are held at every level of government every year, if one takes into account special elections and state and local elections.\nAnd, much like COVID-19, the Zika virus started late in the year leading up to an election year and bled over into it. Zika cases were initially reported in 2015 (presidential election year of 2016), while the new coronavirus was first reported in Wuhan, China, in the winter of 2019 (presidential election year of 2020).\nConspiracy theories are usually half-baked; this one isn’t even ready to go in the oven.", "links": ["https://archive.is/O3tSO", "https://www.cdc.gov/coronavirus/2019-ncov/summary.html", "https://www.cdc.gov/sars/about/fs-sars.html", "https://www.cdc.gov/flu/pandemic-resources/2009-h1n1-pandemic.html", "https://www.cdc.gov/zika/reporting/2015-case-counts.html", "https://www.cdc.gov/coronavirus/2019-ncov/summary.html"], "imgs": ["https://www.snopes.com/tachyon/2020/03/export.jpg"]}