{"title": "Was a ‘Sacrifice the Weak’ Sign Shown at a COVID-19 ‘ReOpen Tennessee’ Rally?", "subtitle": "A person reportedly was seen holding up such a sign.", "date": "24 April 2020", "claim": "A picture shows a person holding a \"Sacrifice the Weak\" sign at a rally urging the state of Tennessee to re-start its economy amid COVID-19 lockdown orders.", "rating": "True", "true_part": "", "false_part": "", "content": " In April 2020, an image supposedly showing a person holding a “Sacrifice the Weak” sign at an anti-COVID-19-lockdown rally in Tennessee went viral on social media:\n\nThis is a genuine screenshot of a news broadcast from the anti-lockdown protest in Tennessee on April 20, 2020. The “Sacrifice the Weak” sign is real, although we can’t say for certain whether this protester was holding this sign in earnest, or displaying it ironically as a way to mock these protests. \nThis screenshot comes from a WKRN broadcast featuring reporter Elizabeth Lane. Here’s the full video of Lane’s report. The “Sacrifice the Weak” sign can be seen around the 1:40 mark:\nOur coverage of an anti-shutdown rally in Tennessee is getting a lot of attention. Here’s my full report below ⬇️ pic.twitter.com/50lnAahuPL\n— Elizabeth Lane WKRN (@elizabethlanetv) April 22, 2020\n\nLane said that she didn’t notice the sign while reporting on the “ReOpen Rally” in Tennessee and only noticed the sign after it was brought to her attention on social media. Lane said that some people had asked if the protest sign was “satire” but said she did not have an answer:\nThis is the protestor drawing the most attention. I’m getting lots of questions — we did not speak with her & did not see her sign until this screenshot was taken. Many people have emailed asking if this was satire, perhaps. To those questions, I do not have answers. pic.twitter.com/GkPKboTVQQ\n— Elizabeth Lane WKRN (@elizabethlanetv) April 22, 2020\n\nThis “Sacrifice the Weak” sign can also be seen in a broadcast from ABC News Channel 9. \nTENNESSEE IN PROTEST: Even with the announcement to start re-opening the state's economy on May 1, Governor Bill Lee has been facing some sharp criticism for not starting the process immediately. https://t.co/Pn3jY7k85S\n— WTVC NewsChannel 9 (@newschannelnine) April 21, 2020\n", "links": ["https://twitter.com/ConorBlenner/status/1252870171422715907", "https://t.co/50lnAahuPL", "https://twitter.com/elizabethlanetv/status/1253018667165593600?ref_src=twsrc%5Etfw", "https://t.co/GkPKboTVQQ", "https://twitter.com/elizabethlanetv/status/1253018959491858432?ref_src=twsrc%5Etfw", "https://newschannel9.com/news/coronavirus/scammers-play-on-users-fears-as-coronavirus-spreads", "https://t.co/Pn3jY7k85S", "https://twitter.com/newschannelnine/status/1252414298594238467?ref_src=twsrc%5Etfw"], "imgs": ["https://www.snopes.com/tachyon/2020/04/sacrifice-the-weak.png"]}