{"title": "Did a Doctor in Italy Warn Coronavirus Wasn’t Just a ‘Bad Flu’?", "subtitle": "Physician: \"The situation is now nothing short of dramatic. No other words come to mind.\"", "date": "11 March 2020", "claim": "A doctor in Italy shared numerous details about how hospitals in the country are dealing with COVID-19, a disease caused by the new coronavirus.", "rating": "Correct Attribution", "true_part": "", "false_part": "", "content": "In March 2020, as the coronavirus continued to spread around the globe, a viral message circulated on social media that was supposedly written by a doctor in Italy about how the new virus had impacted hospitals in the country.\nSilvia Stringhini, an epidemiologist, shared a translated version of this post on Twitter. A screenshot of Stringhini’s first few tweets appear below. The full thread can be viewed here:\n\nStringhini’s viral tweets are a translated version of a real Italian-language Facebook post from Dr. Daniele Macchini, an intensive care unit physician at the Humanitas Gavazzeni hospital in Bergamo. \nA screenshot of a portion of Macchini’s post appears below. The full post can be viewed here, and a translated version appears in full at the bottom of this article:\n\nMacchini explained that hospitals in Italy were overwhelmed with new cases, urged people to stop downplaying the disease as just a “bad flu,” and asked those who were “unafraid” of the disease to consider how it will impact older populations. Macchini also complimented the cooperative efforts of medical professionals at the hospital, writing that there were “no more surgeons, urologists, orthopedists,” just doctors who “suddenly become part of a single team to face this tsunami that has overwhelmed us.”\nHere’s Macchini’s message in full (translated via Google):\nIn one of the constant emails that I receive from my health department on a more than daily basis now these days, there was also a paragraph entitled “doing social responsibly”, with some recommendations that can only be supported.\nAfter thinking for a long time if and what to write about what is happening to us, I felt that the silence was not at all responsible. I will therefore try to convey to people “not involved in the work” and further away from our reality, what we are experiencing in Bergamo during these pandemic days from Covid-19.\nI understand the need not to create panic, but when the message of the danger of what is happening does not reach people and I still feel who cares about the recommendations and people who gather together complaining about not being able to go to the gym or to be able to do soccer tournaments I shudder.\nI also understand the economic damage and I am also worried about that. After the epidemic, the tragedy will start again. However, apart from the fact that we are literally also devastating our NHS from an economic point of view, I allow myself to raise the importance of the health damage that is likely throughout the country and I find it nothing short of “chilling” for example that a red zone already requested by the region has not yet been established for the municipalities of Alzano Lombardo and Nembro (I would like to clarify that this is pure personal opinion).\nI myself looked with some amazement at the reorganizations of the entire hospital in the previous week, when our current enemy was still in the shadows: the wards slowly “emptied”, the elective activities interrupted, the intensive therapies freed to create as many beds as possible. Containers arriving in front of the emergency room to create diversified routes and avoid any infections. All this rapid transformation brought into the corridors of the hospital an atmosphere of surreal silence and emptiness that we still did not understand, waiting for a war that was yet to begin and that many (including me) were not so sure would never come with such ferocity .\n(I open a parenthesis: all this in silence and without publicity, while several newspapers had the courage to say that private health care was not doing anything).\nI still remember my night guard a week ago passed unnecessarily without turning a blind eye, waiting for a call from the microbiology of the Sack. I was waiting for the outcome of a swab on the first suspect patient in our hospital, thinking about what consequences it would have for us and the clinic. If I think about it, my agitation for one possible case seems almost ridiculous and unjustified, now that I have seen what is happening.\nWell, the situation is now nothing short of dramatic. No other words come to mind.\nThe war has literally exploded and the battles are uninterrupted day and night.\nOne after the other the unfortunate poor people come to the emergency room. They have far from the complications of a flu. Let’s stop saying it’s a bad flu. In these 2 years I have learned that the people of Bergamo do not come to the emergency room at all. They did well this time too. They followed all the indications given: a week or ten days at home with a fever without going out and risking contagion, but now they can’t take it anymore. They don’t breathe enough, they need oxygen.\nDrug therapies for this virus are few. The course mainly depends on our organism. We can only support it when it can’t take it anymore. It is mainly hoped that our body will eradicate the virus on its own, let’s face it. Antiviral therapies are experimental on this virus and we learn its behavior day after day. Staying at home until the symptoms worsen does not change the prognosis of the disease.\nNow, however, that need for beds in all its drama has arrived. One after another, the departments that had been emptied are filling up at an impressive rate. The display boards with the names of the sick, of different colors depending on the operating unit they belong to, are now all red and instead of the surgical operation there is the diagnosis, which is always the same cursed: bilateral interstitial pneumonia.\nNow, tell me which flu virus causes such a rapid tragedy. Because that’s the difference (now I’m going down a bit in the technical field): in the classical flu, apart from infecting much less population over several months, cases can be complicated less frequently, only when the VIRUS destroying the protective barriers of the Our respiratory tract allows BACTERIA normally resident in the upper tract to invade the bronchi and lungs, causing more serious cases. Covid 19 causes a banal influence in many young people, but in many elderly people (and not only) a real SARS because it arrives directly in the alveoli of the lungs and infects them making them unable to perform their function.\nSorry, but to me as a doctor it doesn’t reassure you that the most serious are mainly elderly people with other pathologies. The elderly population is the most represented in our country and it is difficult to find someone who, above 65 years of age, does not take at least the tablet for pressure or diabetes. I also assure you that when you see young people who end up in intubated intensive care, pronated or worse in ECMO (a machine for the worst cases, which extracts the blood, re-oxygenates it and returns it to the body, waiting for the organism, hopefully, heal your lungs), all this tranquility for your young age passes there.\nAnd while there are still people on social networks who pride themselves on not being afraid by ignoring the indications, protesting that their normal lifestyle habits are “temporarily” in crisis, the epidemiological disaster is taking place.\nAnd there are no more surgeons, urologists, orthopedists, we are only doctors who suddenly become part of a single team to face this tsunami that has overwhelmed us. The cases multiply, we arrive at the rate of 15-20 hospitalizations a day all for the same reason. The results of the swabs now come one after the other: positive, positive, positive. Suddenly the emergency room is collapsing. Emergency provisions are issued: help is needed in the emergency room. A quick meeting to learn how the first aid management software works and a few minutes later they are already downstairs, next to the warriors on the war front. The PC screen with the reasons for the access is always the same: fever and difficulty breathing, fever and cough, respiratory failure etc … The exams, radiology always with the same sentence: bilateral interstitial pneumonia, bilateral interstitial pneumonia, bilateral interstitial pneumonia. All to be hospitalized. Someone already to intubate and go to intensive care. For others it is late …\nIntensive care becomes saturated, and where intensive care ends, more are created. Each fan becomes like gold: those of the operating rooms that have now suspended their non-urgent activity become places for intensive care that did not exist before.\nI found it incredible, or at least I can speak for the HUMANITAS Gavazzeni (where I work) how it was possible to implement in such a short time a deployment and a reorganization of resources so finely designed to prepare for a disaster of this magnitude. And every reorganization of beds, wards, staff, work shifts and tasks is constantly reviewed day after day to try to give everything and even more.\nThose wards that previously looked like ghosts are now saturated, ready to try to give their best for the sick, but exhausted. The staff is exhausted. I saw fatigue on faces that didn’t know what it was despite the already grueling workloads they had. I have seen people still stop beyond the times they used to stop already, for overtime that was now habitual. I saw solidarity from all of us, who never failed to go to our internist colleagues to ask “what can I do for you now?” or “leave that hospitalization alone.” Doctors who move beds and transfer patients, who administer therapies instead of nurses. Nurses with tears in their eyes because we are unable to save everyone and the vital signs of several patients at the same time reveal an already marked destiny.\nThere are no more shifts, schedules. Social life is suspended for us.\nI have been separated for a few months, and I assure you that I have always done my best to constantly see my son even on the day of disassembly at night, without sleeping and postponing sleep until when I am without him, but for almost 2 weeks I have not voluntarily I see neither my son nor my family members for fear of infecting them and in turn infecting an elderly grandmother or relatives with other health problems. I’m happy with some photos of my son that I regard between tears and a few video calls.\nSo be patient too, you can’t go to the theater, museums or gym. Try to have mercy on that myriad of older people you could exterminate. It is not your fault, I know, but of those who put it in your head that you are exaggerating and even this testimony may seem just an exaggeration for those who are far from the epidemic, but please, listen to us, try to leave the house only to indispensable things. Do not go en masse to make stocks in supermarkets: it is the worst thing because you concentrate and the risk of contacts with infected people who do not know they are. You can go there as you usually do. Maybe if you have a normal mask (even those that are used to do certain manual work) put it on. Don’t look for ffp2 or ffp3. Those should serve us and we are beginning to struggle to find them. By now we have had to optimize their use only in certain circumstances, as the WHO recently suggested in view of their almost ubiquitous impoverishment.\nOh yes, thanks to the shortage of certain devices, I and many other colleagues are certainly exposed despite all the means of protection we have. Some of us have already become infected despite the protocols. Some infected colleagues have in turn infected family members and some of their family members already struggle between life and death.\nWe are where your fears could make you stay away. Try to make sure you stay away. Tell your elderly or other family members to stay indoors. Bring him the groceries please.\nWe have no alternative. It’s our job. In fact, what I do these days is not really the job I’m used to, but I do it anyway and I will like it as long as it responds to the same principles: try to make some sick people feel better and heal, or even just alleviate the suffering and the pain to those who unfortunately cannot heal.\nI don’t spend a lot of words about the people who define us heroes these days and who until yesterday were ready to insult and report us. Both will return to insult and report as soon as everything is over. People forget everything quickly.\nAnd we’re not even heroes these days. It’s our job. We risked something bad every day before: when we put our hands in a belly full of blood of someone we don’t even know if he has HIV or hepatitis C; when we do it even though we know it has HIV or hepatitis C; when we sting with the one with HIV and take the drugs that make us vomit from morning to night for a month. When we open with the usual anguish the results of the tests at the various checks after an accidental puncture hoping not to be infected. We simply earn our living with something that gives us emotions. It doesn’t matter if they are beautiful or ugly, just take them home.\nIn the end we only try to make ourselves useful for everyone. Now try to do it too though: with our actions we influence the life and death of a few dozen people. You with yours, many more.\nPlease share and share the message. We must spread the word to prevent what is happening here in Italy.\nShortly after Macchini’s post went viral, the Italian government announced new restrictions on public travel in an effort to stop the spread of the disease. ", "links": ["https://twitter.com/silviast9/status/1236933818654896129", "https://twitter.com/silviast9/status/1236933818654896129", "https://www.facebook.com/daniele.macchini.52/posts/3395152210500625", "https://www.gavazzeni.it/medici/daniele-macchini/", "https://www.facebook.com/daniele.macchini.52/posts/3395152210500625", "https://www.theguardian.com/world/2020/mar/10/from-confidence-to-quarantine-how-coronavirus-swept-italy"], "imgs": ["https://www.snopes.com/tachyon/2020/03/chinese-doctor-post.png", "https://www.snopes.com/tachyon/2020/03/italy-fb-post.png"]}