{"title": "Was COVID-19 Found in Packages of Toilet Paper?", "subtitle": "The last thing readers needed amid the 2020 coronavirus pandemic was fiction disguised as \"news.\"", "date": "11 March 2020", "claim": "The Centers for Disease Control and Prevention (CDC) announced that COVID-19, a disease caused by the coronavirus, had been found in toilet paper, and that people should use wet cloths instead.", "rating": "False", "true_part": "", "false_part": "", "content": "On March 10, 2020, Now8News published an article positing that the Centers for Disease Control and Prevention (CDC) announced that COVID-19, a disease caused by the new coronavirus, had been found in packages of toilet paper, and that people should start using a wet washcloth to clean themselves instead:\nCOVID-19 Found in Toilet Paper\n[…]\nThe coronavirus has been found in the one place people never expected, toilet paper.\nAn estimated 6000 more people have contracted the virus in the United States tied to a contamination of toilet paper. Testing by Washington State Health department confirmed the COVID-19 virus particles were present in the samples they took from five separate packages of toilet paper from Big Box stores. The CDC said this strain of deadly virus “breeds rapidly in tissue fibers.”\nThe CDC is urging people to using a wet washcloth when cleaning themselves after using the bathroom instead of toilet paper.\nThis is not a genuine news article. Now8News is a junk news site that traffics in misinformation. \nNow8News does not carry a readily available disclaimer labeling its content as “satire” or “fake news,” but this website’s content is undoubtedly fiction. We’ve been debunking misinformation from Now8News since at least 2015, including junk news articles about people having sex with pigs at Walmart, a cannibal eating a person at a haunted house in Texas, and a lottery winner who died after dipping his testicles in gold.  \nThose unfamiliar with this site, however, were given no indications that this toilet-paper story was false. It was presented like a traditional news story and even includes fabricated quotes from the CDC. \nNow 8 News writes:\nThe CDC is urging people to using a wet washcloth when cleaning themselves after using the bathroom instead of toilet paper.\n“Use a washcloth to clean yourself after you go to the bathroom, it’s not a big deal, that’s what we did back in the old days,” said Peter Lendl, who headed the investigation of the contaminated toilet paper. “Just know which one is yours.”\nThis is not a genuine quote from the CDC. We were unable to find this quote in news articles, social media posts from someone named “Peter Lendl,” or from a CDC press release. In fact, the only results for this quote pointed back to this junk news article from Now8News. \nIn sum, the CDC did not announce in March 2020 that the new strain of coronavirus was “rapidly breeding” on toilet paper and that people should use a wet washcloth instead. You can find genuine information about how to deal with the coronavirus on the CDC website. ", "links": ["http://archive.vn/piH1g", "https://www.snopes.com/news/2016/01/14/fake-news-sites/", "https://www.cdc.gov/coronavirus/2019-nCoV/index.html"], "imgs": []}