{"title": "Has Dr. Zelenko Successfully Treated 669 Coronavirus Patients?", "subtitle": "A blog post asserting that people responded well to an experimental COVID-19 treatment is in no way an evidence-based contribution to science.", "date": "30 March 2020", "claim": "Dr. Vladimir Zelenko's 669 COVID-19 patients that were treated with a combination of hydroxychloroquine, azithromycin, and zinc have seen zero hospitalizations, complications, or deaths.", "rating": "Unproven", "true_part": "", "false_part": "", "content": "On March 29, 2020, Rudy Giuliani, the personal attorney to U.S. President Donald Trump, tweeted about a treatment from family practitioner Dr. Vladimir Zelenko, who has claimed to have treated 669 COVID-19 coronavirus patients with a cocktail of hydroxychloroquine, azithromycin, and zinc:\n\nA more detailed explainer of the potential role of anti-malarial drugs like hydroxychloroquine against the COVID-19 coronavirus disease, with or without antibiotics, can be found here. Zelenko’s claims, however, rest solely on taking him at his word: He has published no data, described no study design, and reported no analysis.\nIn an open letter to Trump dated March 23, 2020, and published online in various locations, Zelenko provided his first batch of assertions without providing evidence to support his treatment regime:\nI developed the following treatment protocol in the pre-hospital setting and have seen only positive results. […]\nThe rationale for my treatment plan is as follows. […] We know that hydroxychloroquine helps Zinc enter the cell. We know that Zinc slows viral replication within the cell. Regarding the use of azithromycin, I postulate it prevents secondary bacterial infections. These three drugs are well known and usually well tolerated, hence the risk to the patient is low.\nSince last Thursday, my team has treated approximately 350 patients in Kiryas Joel and another 150 patients in other areas of New York with the above regimen. Of this group and the information provided to me by affiliated medical teams, we have had ZERO deaths, ZERO hospitalizations, and ZERO intubations. In addition, I have not heard of any negative side effects other than approximately 10% of patients with temporary nausea and diarrhea.\nIn sum, my urgent recommendation is to initiate treatment in the outpatient setting as soon as possible in accordance with the above. Based on my direct experience, it prevents acute respiratory distress syndrome (ARDS), prevents the need for hospitalization and saves lives.\nAs has been noted elsewhere, combining hydroxychloroquine and azithromycin can cause serious problems for people with certain heart conditions. Though zinc appears to be an important factor in several immune functions, a potential mechanism for how it might work against viral infections is not well-understood.\nIn an interview with Forward, Zelenko “acknowledged that his regimen was new and untested, and that it was too soon to assess its long-term effectiveness.” He instead argued that “the risks of waiting to verify its efficacy” were greater. This is an assertion with which public health officials largely disagree.\nRegardless, making an assertion in a blog post or in a YouTube interview that neither describes the study design nor provides the actual data used to reach a conclusion about efficacy cannot, in any way, be critically evaluated. As such, this claim is rated “Unproven.”", "links": ["http://archive.vn/mlixw", "https://www.snopes.com/news/2020/03/25/chloroquine-covid-19/", "http://archive.vn/2EBfJ", "http://archive.vn/a5weA", "https://www.acc.org/latest-in-cardiology/articles/2020/03/27/14/00/ventricular-arrhythmia-risk-due-to-hydroxychloroquine-azithromycin-treatment-for-covid-19", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6483791/", "https://forward.com/news/national/442285/coronavirus-hydroxychloroquine-trump-doctor/", "https://theintercept.com/2020/03/20/trump-disagrees-top-immunologist-untested-drug-treatment-covid-19/"], "imgs": ["https://www.snopes.com/tachyon/2020/03/Screen-Shot-2020-03-30-at-3.10.32-PM.png"]}