{"title": "Did Self-Described Psychic Sylvia Browne Predict the Coronavirus?", "subtitle": "Lobbing vague claims about likely events does not a prediction make.", "date": "4 March 2020", "claim": "Self-described psychic Sylvia Browne \"predicted\" a 2020 outbreak of the new coronavirus.", "rating": "Mixture", "true_part": "Self-described psychic Sylvia Browne wrote in her 2008 book \"End of Days\" that a respiratory illness would spread across the globe.", "false_part": "", "content": "In early March 2020, amid fears about an international outbreak of illness caused by the new coronavirus, dubbed COVID-19, social media users shared an image of a page in the book “End of Days,” which was published in 2008 and authored by self-described psychic and medium Sylvia Browne.\n“Did Sylvia Browne predict the coronavirus in her book End of Days?” one reader asked.\nBrowne died in 2013. She gained notoriety for her claims that she could predict the future and communicate with spirits. But she was also the subject of criticism for offering the grieving parents of missing children false information.\nBrowne did vaguely write in her 2008 book that a respiratory illness would spread across the globe in 2020. Here are her own words from the Google Books version of “End of Days”:\nIn around 2020 a severe pneumonia-like illness will spread throughout the globe, attacking the lungs and the bronchial tubes and resisting all known treatments. Almost more baffling than the illness itself will be the fact that it will suddenly vanish as quickly as it arrived, attack again ten years later, and then disappear completely.\nAlthough the term “prediction” is a subjective one, it may come as no surprise that Browne claimed to have foreseen an international respiratory disease outbreak, considering that the SARS (severe acute respiratory syndrome) outbreak of the early 2000s occurred before her book was published.\nThe term “severe” would certainly apply to some cases of COVID-19, the coronavirus disease, which has been deadly for thousands of patients in 2020. The illness appears to be more lethal than the seasonal flu, though some of the cases are quite mild or asymptomatic.\nFinally, it would be subjective to describe the coronavirus as “baffling.” Coronavirus infections are not new, although COVID-19 is a new strain, and because of that, no vaccines or therapeutic treatments exist yet to fight it. And of course no evidence exists that COVID-19 will “suddenly vanish.” In fact health professionals have stated it might become a seasonal illness.\nWe therefore rate this claim “Mixture.” Although it could be argued that stating a respiratory illness would sweep through the world in 2020 was accurate, other elements of the book passage are unknown or unlikely, and of course “predicting” a worldwide outbreak of a respiratory illness when one has already happened could be more a matter of lucky guessing than predicting.", "links": ["https://www.latimes.com/california/story/2020-03-04/los-angeles-county-declares-coronavirus-emergency-6-new-cases", "https://www.youtube.com/watch?v=Kiiuc0M4L40", "https://www.theguardian.com/world/2013/may/07/sylvia-browne-amanda-berry-cleveland", "https://books.google.com/books?id=bAAOiMl1BIcC&pg=PP1&source=gbs_selected_pages&cad=3#v=onepage&q&f=false", "https://www.cdc.gov/about/history/sars/timeline.htm", "https://www.nytimes.com/2020/03/02/world/coronavirus-updates-news-covid-19.html", "https://www.nytimes.com/2020/02/29/health/coronavirus-flu.html", "https://www.health.harvard.edu/blog/as-coronavirus-spreads-many-questions-and-some-answers-2020022719004", "https://www.cdc.gov/coronavirus/types.html", "https://www.washingtonpost.com/health/how-bad-will-the-coronavirus-outbreak-get-in-the-us/2020/03/03/55c5d088-5c9d-11ea-9055-5fa12981bbbf_story.html"], "imgs": []}