{"title": "Can Contaminated Money Spread the New Coronavirus?", "subtitle": "The World Health Organization has advised people to “wash their hands after handling banknotes.”", "date": "6 March 2020", "claim": "", "rating": "", "true_part": "", "false_part": "", "content": "On March 2 2020, The Telegraph published an article highlighting the potential for currency to spread viral infections such as the new coronavirus, which causes the disease COVID-19. That article quoted an unnamed World Health Organization (WHO) spokesperson:\nThe World Health Organization said the British public should exercise care when handling potentially infectious banknotes. Asked whether banknotes could be spreading coronavirus, a WHO spokesman replied: “Yes it’s possible and it’s a good question. We know that money changes hands frequently and can pick up all sorts of bacteria and viruses and things like that.\n“We would advise people to wash their hands after handling banknotes, and avoid touching their face. … When possible it’s a good idea to use contactless payments.”\nLater, a WHO spokesperson clarified to CNBC that the agency was speaking generally, and that they were not issuing coronavirus-specific guidance with regard to dirty money or suggesting contactless payments as a way to prevent COVID-19’s transmission:\nDespite reports that the World Health Organization was pushing people to use contactless payments, a spokesperson for the WHO tells CNBC[‘s] Make It it has not issued any warnings or statements about the use of cash. Instead, it reiterated that you should wash your hands, including after handling money, especially if you’re eating or touching food.\nWe reached out to WHO for further clarification on the apparent conflicting statements, but have not yet received a response.\nGiven coronavirus’ recent discovery, no scientific studies have yet addressed if it can spread specifically on banknotes or coins. The new coronavirus, like other viruses in that family, causes respiratory infections in humans. To do so, however, the virus needs to enter the body via the mouth or nose. That means any potential transmission involving money necessarily includes touching your face after touching a contaminated bill or coin.\nIn general, coronaviruses can remain infectious on surfaces exposed to the elements for several days. A recent review of 22 scientific studies showed that “human coronaviruses such as Severe Acute Respiratory Syndrome (SARS) coronavirus, Middle East Respiratory Syndrome (MERS) coronavirus or endemic human coronaviruses (HCoV) can persist on inanimate surfaces like metal, glass or plastic for up to 9 days.” Few studies exist on the survival of coronaviruses on paper or other potential banknote material, but a 2003 study conducted on a strain of SARS found infectious coronavirus for up to 72 hours on “press paper” and 96 hours on “cloth.” Based on structural similarities among coronaviruses, it is a reasonable conclusion that this would hold true for the new coronavirus as well.\nMoney may contain a host of infectious agents, including coronaviruses, at any time, regardless of the presence of a novel outbreak. For this reason the WHO recommends — in general — washing one’s hands after handling money. While it is true that China and Korea have taken measures to sanitize their cash, these moves are based on theoretical concerns and not a scientific conclusion that the novel coronavirus specifically has a higher risk of transmission on money than other similar viruses.\nThe best defense against potentially infected money is simple: Don’t touch your face or eat food after handling cash without washing your hands, and always wash your hands thoroughly after coming into contact with any money. This advice, WHO told CNBC, should be followed all the time, not only during a viral outbreak.", "links": ["http://archive.ph/m6IK8", "https://www.cnbc.com/2020/03/06/what-you-need-to-know-about-handling-cash-amid-coronavirus-spread-who.html", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/1471-2334-6-130", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/1471-2334-6-130", "https://www.journalofhospitalinfection.com/article/S0195-6701(20)30046-3/fulltext", "https://www.ncbi.nlm.nih.gov/pubmed/14631830", "https://pubs.acs.org/doi/10.1021/es070056u", "https://www.cnbc.com/2020/02/17/coronavirus-china-disinfects-cash-in-a-bid-to-stop-virus-spreading.html", "https://finance.yahoo.com/news/who-world-health-organisation-coronavirus-banknotes-warning-111019361.html", "https://www.cnbc.com/2020/03/06/what-you-need-to-know-about-handling-cash-amid-coronavirus-spread-who.html"], "imgs": []}