{"title": "Can a Homemade Tito’s Vodka Hand Sanitizer Help Stem Coronavirus?", "subtitle": "As the coronavirus spread in 2020, a fierce outbreak of bad advice took hold online.", "date": "5 March 2020", "claim": "A homemade hand sanitizer made with Tito's Vodka can be used to fight the new coronavirus.", "rating": "False", "true_part": "", "false_part": "", "content": "As the coronavirus known as COVID-19 spread around the globe in March 2020, a piece of advice repeated frequently was to wash your hands often. The Centers for Disease Control and Prevention (CDC) recommends using soap and water, but the internet had another suggestion: Tito’s Vodka. \nA popular rumor on social media held that people could fight off the coronavirus by combining hand gel and Tito’s Vodka in a homemade hand sanitizer:\n\nThis is not true. Tito’s Vodka cannot be used to make effective hand sanitizer. \nA number of DIY articles on the internet explain how to make homemade hand sanitizer. While some of these articles specified that vodka containing at least 60% alcohol was required to make an effective hand sanitizer, others simply stated that any vodka would do. Good Housekeeping, for instance, published an article on March 2 that told readers they could make homemade hand sanitizer with any “plain vodka.” \nBut that isn’t the case. The CDC writes that people can use an “alcohol-based hand sanitizer with at least 60% alcohol” if soap and water is not available. But most vodkas (including Tito’s) only contain 40%.\nTito’s has been responding to people on social media informing them that the product is not a suitable hand sanitizer. \n\nThis is hardly the first piece of bad advice to circulate on social media during the coronavirus outbreak. Read more in our “Coronavirus Collection.” For up-to-date information on the coronavirus outbreak, please visit the CDC website. ", "links": ["https://www.cdc.gov/coronavirus/2019-ncov/about/prevention-treatment.html", "https://www.jerrybaker.com/jb021718", "http://web.archive.org/web/20200304150152/https://www.goodhousekeeping.com/health/wellness/g20706539/how-to-make-a-natural-hand-sanitizer/", "https://twitter.com/TitosVodka/status/1235616589237477376", "https://www.snopes.com/collections/coronavirus-origins-treatments/", "https://www.cdc.gov/coronavirus/2019-ncov/about/prevention-treatment.html"], "imgs": ["https://www.snopes.com/tachyon/2020/03/Copy-of-Real_Fake-Yes_No-Square1.png", "https://www.snopes.com/tachyon/2020/03/titos.png"]}