{"title": "Does Video Show Guns, Violence in Aftermath of Coronavirus Outbreak in China?", "subtitle": "Speculation does not equal evidence.", "date": "14 February 2020", "claim": "A video shows a chaotic scene in Wuhan, China, involving doctors armed with weapons, gunshots to deter people from leaving a new coronavirus quarantine, and a woman who was shot dead after she attempted to break through a roadblock.", "rating": "Miscaptioned", "true_part": "", "false_part": "", "content": "WARNING: This article contains a video that shows a recently deceased person. As such, it may not be suitable for all viewers. \nIn February 2020, a video supposedly showing a chaotic scene in Wuhan, China, was widely shared on social media with the suggestion that it was related to the 2020 outbreak of a new coronavirus. \nActor James Woods posted the video to his Twitter account, asking if anyone knew what was actually going on in this footage:\n\nAlthough the video attached to Woods’ tweet was later removed, at the time of this writing it was still viewable on other Twitter posts.\nMeanwhile over 25,000 killed they have started shooting down all the people with the virus in China… this is so sad 🥺🥺🥺 pic.twitter.com/IfVWMUuSw6\n— Rangoli Chandel (@Rangoli_A) February 13, 2020\n\nWhile the video was widely shared as if it showed a singular incident, it was actually made up of three individual and unrelated clips, which we evaluate separately below.\nAre these armed doctors?\nRating: Miscaptioned.\nThe first clip in this video was widely shared along with the unfounded claim that it showed medical professionals armed with weapons. The implication here appears to be that doctors are killing patients as opposed to treating them. However, this video appears to show police officers dressed in medical gear, not medical professionals. \nWhile we have not been able to find the source of this video, Getty Images does have a few photographs of police officers in Wuhan, China, wearing similar protective clothing. Furthermore, the word “police” can be briefly seen on the hood of this car. \n\nAre these gunshots being fired to deter people from leaving quarantine?\nRating: Miscaptioned.\nThe second clip in this video was widely shared as if it showed doctors treating coronavirus patients on the street as gunshots could be heard in the background. One Twitter user wrote:\nNew video from the quarantine zone in China. Medical personal checking #coronavirus patients. There’re multiple reports from the ground of people dying in their homes. The gunshots you hear in the background is to stop those who want to escape from off-road terrain.\nThere was no evidence to support speculation that the blasts in the background were gunshots, that these gunshots were being fired to prevent people from fleeing the area, or that people laying in the streets are coronavirus victims. \nNobody can be seen on screen holding a gun, and the people shown in the video do not seem particularly disturbed by the supposed “gunfire.” This video also started circulating on or around Jan. 25, 2020, when China was celebrating Lunar New Year. One early posting of this footage noted that the explosions in the background were fireworks from the holiday celebration. \n武汉周圍很多農村人，被感染后进不了医院，只有醫护上门，也無法確診，最終死在家里！這些死亡病例肯定是不会統計进官方肺炎死亡人数的！背景中是欢庆新年的烟花爆空，而他們死得绝望無辜！歷史也許永遠不会有真相！ pic.twitter.com/bw5co9vuk3\n— 财经冷眼 (@charles984681) January 26, 2020\n\nWas a woman shot dead after attempting to break through a coronavirus blockade?\nRating: Miscaptioned.\nThe final clip in this video supposedly shows a woman who was “shot dead after she attempted to break the blockade set up to contain #coronavirus.” \nAt Wuzu Town, Huangmei County in #Hubei , a woman was said to have shot dead after she attempted to break the blockade set up to contain #coronavirus . 湖北省黄梅县五祖镇 , 据说这名妇女因强闯 #武汉肺炎 封锁线被警察打死。#CoronavirusOutbreak何不 #全民自救 #全民互救 ？ pic.twitter.com/HqEvzSknz2\n— 曾錚 Jennifer Zeng (@jenniferatntd) February 4, 2020\n\nThis is a genuine video. However, it is not related to the coronavirus nor to a roadblock. This video actually shows a person who was killed in a motorbike accident. \nRemnants of this accident can be seen in the video. At one point, a busted up sidewalk can be seen near the victim. An overturned scooter can also be seen in the background. The French news outlet Les Observateurs France 24 obtained a slightly longer version of this video that more clearly shows the crashed motorbike. \nLes Observateurs also obtained a statement from the director of the Wuzu police station who said that this was a “one-vehicle road accident”: \n“In the afternoon of January 29, a one-sided [one-vehicle] road accident occurred in the city of Wuzu. The person involved was driving a scooter and, due to bad traffic maneuver, she shifted to the side of the road, collided with the stones along the ledge and fell on the back of the head, and unfortunately died. The driver was solely responsible. Local police and health center workers quickly arrived to handle the accident.”\nIn Summary\nAlthough Wuhan, China, and surrounding areas were certainly dealing with an outbreak of coronavirus in early 2020, and while some of the photographs and videos coming out of China are undoubtedly real, many clips have been captioned in a way to capitalize on the fear of this potential pandemic.\nWhen we examined another set of videos that supposedly showed people collapsing in the street as a result of contracting coronavirus, for instance, we found that these claims were based purely on the spectator’s assumptions and not any first-hand knowledge. The World Health Organization said that it would be “atypical” for people to collapse in this manner from the virus. \nFind more information on coronavirus here. ", "links": ["https://twitter.com/RealJamesWoods/status/1228019269234872320", "https://twitter.com/Rangoli_A/status/1227792415676780545", "https://t.co/IfVWMUuSw6", "https://twitter.com/Rangoli_A/status/1227792415676780545?ref_src=twsrc%5Etfw", "https://www.gettyimages.com/detail/news-photo/police-officers-wearing-protective-gear-monitor-outside-news-photo/1200073961?adppopup=true", "https://www.gettyimages.com/detail/news-photo/child-wearing-a-face-mask-rides-his-scooter-past-a-police-news-photo/1200074005?adppopup=true", "https://twitter.com/Rangoli_A/status/1227792415676780545", "https://twitter.com/howroute/status/1221179204491993088", "https://t.co/bw5co9vuk3", "https://twitter.com/charles984681/status/1221327847425335296?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Hubei?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/coronavirus?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/%E6%AD%A6%E6%B1%89%E8%82%BA%E7%82%8E?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/CoronavirusOutbreak?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/%E5%85%A8%E6%B0%91%E8%87%AA%E6%95%91?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/%E5%85%A8%E6%B0%91%E4%BA%92%E6%95%91?src=hash&ref_src=twsrc%5Etfw", "https://t.co/HqEvzSknz2", "https://twitter.com/jenniferatntd/status/1224551214756646914?ref_src=twsrc%5Etfw", "https://observers.france24.com/fr/20200211-intox-chine-coronavirus-chinoise-tuee-police-fuir-quarantaine-wuhan-hubei-wuzu", "https://observers.france24.com/fr/20200211-intox-chine-coronavirus-chinoise-tuee-police-fuir-quarantaine-wuhan-hubei-wuzu", "https://www.snopes.com/fact-check/people-collapsing-coronavirus/", "https://www.cdc.gov/coronavirus/index.html"], "imgs": ["https://www.snopes.com/tachyon/2020/02/JamesWoodsCoronavirusVidTweet.png", "https://www.snopes.com/tachyon/2020/02/armed-police-wuhan.png"]}