{"title": "Is This a Sand-Covered Highway to Dubai During the COVID-19 Pandemic?", "subtitle": "It's definitely difficult to photograph a place that doesn't exist.", "date": "26 May 2020", "claim": "A photograph shows a vacant, sand-covered highway to Dubai during COVID-19 stay-at-home orders.", "rating": "False", "true_part": "", "false_part": "", "content": "In May 2020, the image above circulated on social media supposedly showing a highway leading to Dubai covered with sand after weeks of inactivity due to lockdown orders put in place during the COVID-19 coronavirus pandemic.\nThis is not a genuine photograph. It’s a composite of at least two images, and the location it supposedly shows does not even exist. \nRoads near Dubai (and other desert locales) truly can get covered in sand after storms, which can lead to some spectacular images. Photographer Irenaeus Herok, for instance, has captured several aerial pictures of real sand-covered highways near Dubai, such as this one from 2016:\n\nA post shared by Irenaeus Herok (@iherok) on Dec 4, 2016 at 9:54am PST\n\nThe YouTube page “Drone Collective” has also posted several videos of such sand-covered roads in Dubai:\nHowever, the scene depicted in the viral photograph — a two-lane highway stretching unimpeded into the distance as the skyline of Dubai rests on the horizon — does not exist.\nFor starters, no such lengthy stretch of desert highway leading in and out of Dubai lines up perfectly with the Burj Khalifa, the tallest building in the world, as shown in the viral image. Secondly, while we have encountered a number of similar images supposedly showing a sand-covered highway leading to Dubai, these images were digital composites. In other words, they were created by taking at least two distinct images and then editing them together.\nThe trick apparently is to take a drone photograph of a long stretch of partially sand-covered desert highway and then to photoshop the skyline of Dubai into the background. A number of travel photographers have made their own versions of this scene, including Husain Ujjainwala, a photographer in the United Arab Emirates (UAE), who posted a “before and after” version of his edit. \nHere’s how this stretch of highway looked in Ujjainwala’s original photograph (left) and after it was edited (right) to include the Dubai skyline:\n\nUjjainwala captured these images: “Instagram Vs Reality. Not everything you see on Instagram is real.”\nThese fake Dubai skyline images often circulate on social media as if they are genuine photographs. This has inspired a few adventurous photographers, such as Ty Poland, a writer for the photography website FStoppers, to set out for Dubai in order to capture this tremendous view. Unfortunately, this scene can only be captured via photo-editing software. \nPoland wrote an article entitled “Discovering Fake Dubai: A Road That Led to Nowhere” on FStoppers in 2018 after an amazing, yet somewhat disappointing, visit to Dubai:\n“… I’ve seen photos like this so many times on my Instagram over the past three years or so. I said to myself that if I ever get to go to Dubai, I want to do my own version of this photo. When I got out there, I tried to do just that. After spending some time on Google maps looking for where this road could be, Martin and I decided to take it or leave it and head to the location we thought this one spot could be.\nAs we rolled up, we noticed the road was blocked off and the area seemed to be restricted. There was not a shot we would be able to get to that spot. We went back to check Google for more spots with this potential view, but soon discovered that we had been fooled by other photos of “fake” Dubai.\nEvery time I saw these pictures, I thought they were real. I’d always wonder how these people got onto these roads covered by this sand with such a beautiful iconic view. For me, it kind of hurt to find out it we’d been fooled, but it allowed me to create a scene of my own and actually plan to do it.\nPoland posted his version of this scene on Instagram along with the caption “Finding places that don’t exist” and the hashtag #photoshop:\n\nA post shared by Ty Poland (@typoland) on Oct 10, 2018 at 3:49pm PDT\n\nAs we investigated this photograph, we kept coming across comments that asked what city officials in Dubai did to clear the roads of sand after a storm. Did they have sand plows? An army of shovel-wielding sand clearers? The answer to both of those questions, generally speaking, is yes. In 2012, shortly after a sandstorm left many of Dubai’s roads covered in sand, The National in UAE reported that Dubai used road-sweeping machines and manual labor in order to clear the roads:\nMunicipal workers were kept busy all weekend shoveling tones of sand from choked highways and arterial roads.\n“We had to work like an emergency team to remove the sand in time,” said Yaqoob Al Ali, the head of Dubai Municipality’s cleaning section. “It was a big challenge to get the highways clear.\n“We cannot leave sand on the highways or accidents will happen. It is a danger zone. During a sandstorm people cannot control the car. It skids and slips because drivers cannot tell how deep the sand is.”", "links": ["https://twitter.com/AventuraObscura/status/1261954844887310337", "https://www.thenational.ae/uae/sandstorm-clear-up-begins-1.405933", "https://www.iherok.com/", "https://www.boredpanda.com/desert-aerial-drone-photography-irenaeus-herok-dubai", "https://www.instagram.com/p/BNmrUWoAodZ/?utm_source=ig_embed&utm_campaign=loading", "https://fstoppers.com/aerial/discovering-fake-dubai-road-led-nowhere-306165", "https://www.instagram.com/p/BoxRsApHQtS/?utm_source=ig_embed&utm_campaign=loading"], "imgs": ["https://www.snopes.com/tachyon/2020/05/before-and-after.jpg"]}