{"author": {}, "clicked": false, "created_utc": 1584623019.0, "distinguished": null, "edited": 1584623949.0, "id": "fl9od5", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_fl9od5", "num_comments": 197, "over_18": false, "score": 1222, "downs": 0, "title": "What's the best way to shut down people who say that coronavirus is caused by 5G and the vaccine for coronavirus will be harmful? My mom (who is at high risk) is on the fence about this and believes YouTube and Facebook videos.", "view_count": null, "media": null, "url": "https://www.reddit.com/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/", "permalink": "/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/", "selftext": "So my mom is kind of on the fence about this. I studied biology, chemistry and physics in college.\n\nShe says since 5G was introduced, this virus came along. \n\nI told her all 5G is is very weak beams of light and light can't cause viruses to pop into existence. I said ''coincidences are a thing.'' \n\nShe showed me a Facebook video of a man going on a rant about this. He said the vaccine will cause us to become disabled and get things like cancer. I told my mom that all a vaccine is is a dead virus. A dead virus isn't going to magically give you cancer.\n\nThe guy said coronaviruses have been around for decades and it's only because of 5G that this virus is now harming people because 5G causes aluminum metals to fall out of the sky. I told my mom that coronavirus is not a single virus but a family of viruses and this new strain is a completely new species.\n\nI did say ''where is this guy's evidence?'' ''if vaccines are bad, what happened to smallpox?'' and compared him to people who believe the Earth is flat (I said ''how is this any different to saying the Earth is flat? If a guy was constantly swearing saying ''wake up'' because you can't see a curved horizon at sea level and then concluded Earth is flat, would you believe Earth is flat?'') because it runs against the narrative and uses similar conclusions that aren't backed by any evidence, but is there anything I should say if something similar comes up? Thanks", "stickied": false}