{"author": {"comment_karma": 30246, "created_utc": 1403486559.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_0DD3BB.png", "id": "h3b9h", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 220, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#0DD3BB", "user_is_muted": null, "display_name": "u_Recklesslettuce", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_0DD3BB.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Recklesslettuce", "key_color": "", "name": "t5_au0e4", "is_default_banner": true, "url": "/user/Recklesslettuce/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Recklesslettuce"}, "clicked": false, "created_utc": 1580941877.0, "distinguished": null, "edited": 1580942328.0, "id": "ezhtki", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_ezhtki", "num_comments": 5, "over_18": false, "score": 3, "downs": 0, "title": "Wuhan coronavirus could be an ethnic bioweapon targeting unpure Han people.", "view_count": null, "media": null, "url": "https://www.reddit.com/r/conspiracytheories/comments/ezhtki/wuhan_coronavirus_could_be_an_ethnic_bioweapon/", "permalink": "/r/conspiracytheories/comments/ezhtki/wuhan_coronavirus_could_be_an_ethnic_bioweapon/", "selftext": "The Chinese Communist Party hates muslim Chinese. Their rhetoric is han-centric to the extreme, and this is mirrored [by han people.](https://youtu.be/v7AYyUqrMuQ?t=335) The CCP is putting Chinese muslims in concentration camps. Even their children are put into \"daycare\" child camps. The CCP is as racist as Hitler ever was.\n\nIt is not outlandish to believe the CCP wants to eradicate any ethnic group within China that is not Han Chinese. An ethnic bioweapon is ideal for this. [Israel is already developing one such \"ethno-bomb\" that affects Arabs but not Jews.](https://www.wired.com/1998/11/israels-ethnic-weapon/) Many other countries are likely doing the same. \n\nSo there are two possible scenarios for this Wuhan coronavirus should it be an ethno-bomb: \n\n* 1 The virus is working as intended, affecting only those that do NOT have the Han mitochondrial DNA inherited from the [\"true\" Han people who lived along the Yagtze, Pearl, and Yellow rivers.](https://www.inkstonenews.com/society/beyond-yellow-river-dna-records-tell-new-story-han-chinese-origins/article/3011457) This does not explain why the virus has not spread, especially to places such as Urumqi where you would expect the CCP to \"accidentally\" introduce the virus to kill all those non-Han separatists they like to hate so much. Or maybe it has and the data is not being released. This also does not explain the virus' lack of virulence outside of china, unless the virus only attacks those without the Han mitochondrial DNA but with a certain Han characteristic. Basically, only those that are over X% Han but under Y% Han. This would contain it quite effectively to China.\n\n* 2 The virus mis-functioned. [The study](https://www.inkstonenews.com/society/beyond-yellow-river-dna-records-tell-new-story-han-chinese-origins/article/3011457) quoting only very small genetic variations between Han Chinese was wrong (likely due to the researchers not wanting to get into trouble by contradicting the Han-centric rhetoric of the CCP), meaning the virus can affect a lot of Han Chinese in addition to all the \"non-pure\" Han people. Or perhaps the virus mutated more than expected. This means we are in for a pandemic (affecting the whole world, not just China). Contingency measures put in place before the release of the virus means the authorities managed to contain the virus before it spread.\n\nI think a mix of the two scenarios is the most possible: it mainly affects non pure han people, but it has mutated, likely when a human infected a snake/bat at a wet market. \n\nBONUS CONSPIRACY: to combat the spread of the mutated virus, [it is not outrageous](https://msphere.asm.org/content/3/1/e00552-17.abstract) to think they are spraying the city down with a non-mutated version of the virus.\n\nPREDICTIONS: The virus will spread along the Yangtze river, which passes through Wuhan. Assuming this is an engineered ethno-bomb, people along the Yangtze share the most common DNA with the people of Wuhan and will thus be the logical direction for the CCP to spread the virus. It is also harder to stop transit of people/bodies down a river. Internationally, Koreans and Japanese could be hit pretty bad, especially Koreans. \n\nFurther reading on how Coronaviruses attack mitochondria: \n\n[https://www.nature.com/articles/s41598-019-44922-9](https://www.nature.com/articles/s41598-019-44922-9)\n\n[https://www.jimmunol.org/content/193/6/3080](https://www.jimmunol.org/content/193/6/3080)", "stickied": false}