{"author": {"comment_karma": 22146, "created_utc": 1380679548.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_A06A42.png", "id": "dcqhf", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 459, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_welcometotheregime", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/welcometotheregime", "key_color": "", "name": "t5_b3ba8", "is_default_banner": true, "url": "/user/welcometotheregime/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "welcometotheregime"}, "body": "&#x200B;\n\n>There is zero evidence for a lab leak, most scientists don't think it's the case\n\nMost scientists admit that they have no clue where it originated, per the article you posted. Some say a lab leak is possible, some say wet markets were possible, but no one knows. I do agree with you that we should stick with facts.\n\nIt's just the way that you dismissed it as a possibility which is why I felt the need to reply. By saying that Boris does not believe in genetics, which has absolutely nothing to do with the post. Whether it leaked from a lab or not does not imply that it was or was not engineered. It is known that the lab studies naturally occurring coronaviruses, so a leak of a bat-origin virus from a lab does not make it genetically engineered.\n\n&#x200B;\n\n>I think believing in conspiracy theories is ignorant.\n\nRight now almost everything is a theory. Going around calling every scientist who is trying to solve a worldwide pandemic a conspiracy theorist because there is not enough data is just stupid.  It could have originated in a wet market, we don't know, but suggesting that it's possible is not a conspiracy theory.\n\nJust because you personally don't believe something to be true does not mean you should dismiss it as fake and insult people who are working to find out more. This is the same attitude climate deniers and flat earthers use, it's stupid.\n\nI am not suggesting it did leak from the lab, but to deny that it's even possible when it's happened multiple times already is ignorant. Just my opinion though.\n\n&#x200B;\n\n>And pinpoint where I called anyone names.\n\nYou claimed that he must believe in 5G conspiracy theories, which is a backhanded attack on their credibility, associating their opinion which is based in sound science and historical events with some nutty theory that has nothing to do with what they said. Maybe not calling them names directly, but it was an attack on their character because you disliked what they had to say.  \n\n\nWe know that a lead researcher at the lab has been studying coronaviruses that originated in bats.  We also have heard numerous stories that \"Patient 0\" was an employee of the lab. But to suggest that it's possible the virus leaked from the lab is a conspiracy theory. I stand by my claim of ignorance or straight up denial because it conflict with your world view.", "created_utc": 1586306301.0, "distinguished": null, "id": "fmqstxs", "is_submitter": false, "link_id": "t3_fwqxiu", "parent_id": "t1_fmqk8un", "score": 8, "stickied": false, "subreddit_id": "t5_2dar36", "downs": 0, "total_awards_received": 0, "edited": 1586307097.0, "name": "t1_fmqstxs", "collapsed": false, "permalink": "/r/China_Flu/comments/fwqxiu/boris_johnsons_government_reportedly_believes_the/fmqstxs/"}