{"author": {"comment_karma": 4361, "created_utc": 1543417187.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_rzt12/styles/profileIcon_8i9z7amcffg31.jpg?width=256&height=256&crop=256:256,smart&s=579cbd6632d238f7f0c4354342734b22ae42218f", "id": "2ompimdb", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 26118, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_rzt12/styles/profileBanner_zg6b5r56efg31.jpg?width=1280&height=384&crop=1280:384,smart&s=7653b5cd16cc249676b5dc0720daba42ef7ad99f", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_SR-71A_Blackbird", "header_img": null, "title": "SR-71A Blackbird", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_rzt12/styles/profileIcon_8i9z7amcffg31.jpg?width=256&height=256&crop=256:256,smart&s=579cbd6632d238f7f0c4354342734b22ae42218f", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/SR-71A_Blackbird", "key_color": "", "name": "t5_rzt12", "is_default_banner": false, "url": "/user/SR-71A_Blackbird/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "SR-71A_Blackbird"}, "body": ">The 2019-nCoV coronavirus has caused an epidemic of 28,060 laboratory-confirmed infections in human including 564 deaths in China by February 6, 2020. Two descriptions of the virus published on Nature this week indicated that the genome sequences from patients were 96% or 89% identical to the Bat CoV ZC45 coronavirus originally found in Rhinolophus affinis.^1,2 It was critical to study where the pathogen came from and how it passed onto human.\n\n>An article published on The Lancet reported that 41 people in Wuhan were found to have the acute respiratory syndrome and 27 of them had contact with Huanan Seafood Market.^3 The 2019-nCoV was found in 33 out of 585 samples collected in the market after the outbreak. The market was suspicious to be the origin of the epidemic, and was shut down according to the rule of quarantine the source during an epidemic.\n\n>The bats carrying CoV ZC45 were originally found in Yunnan or Zhejiang province, both of which were more than *900 kilometers away from the seafood market.* Bats were normally found to live in caves and trees. But the seafood market is in a densely-populated district of Wuhan, a metropolitan of ~15 million people. The probability was very low for the bats to fly to the market. According to municipal reports and the testimonies of 31 residents and 28 visitors, *the bat was never a food source in the city, and no bat was traded in the market.* There was possible natural recombination or intermediate host of the coronavirus, yet little proof has been reported.\n\n>Was there any other possible pathway? We screened the area around the seafood market and identified two laboratories conducting research on bat coronavirus. Within ~280 meters from the market, there was the Wuhan Center for Disease Control & Prevention (WHCDC) ([Figure 1, from Baidu and Google maps](https://i.imgur.com/wnj9k9p.png)). WHCDC hosted animals in laboratories for research purpose, one of which was specialized in pathogens collection and identification.^4-6 In one of their studies, 155 bats including Rhinolophus affinis were captured in Hubei province, and other 450 bats were captured in Zhejiang province.^4 The expert in collection was noted in the Author Contributions (JHT). Moreover, he was broadcasted for collecting viruses on nation-wide newspapers and websites in 2017 and 2019.^7,8 He described that he was once by attacked by bats and the blood of a bat shot on his skin. He knew the extreme danger of the infection so he quarantined himself for 14 days.^7 In another accident, he quarantined himself again because bats peed on him. He was once thrilled for capturing a bat carrying a live tick.^8\n\n>Surgery was performed on the caged animals and the tissue samples were collected for DNA and RNA extraction and sequencing.^4,5 The tissue samples and contaminated trashes were source of pathogens. They were only ~280 meters from the seafood market. The WHCDC was also adjacent to the Union Hospital (Figure 1, bottom) where the first group of doctors were infected during this epidemic. It is plausible that the virus leaked around and some of them contaminated the initial patients in this epidemic, though solid proofs are needed in future study.\n\n>The second laboratory was ~12 kilometers from the seafood market and belonged to Wuhan Institute of Virology, Chinese Academy of Sciences.^1,9,10 This laboratory reported that the Chinese horseshoe bats were natural reservoirs for the severe acute respiratory syndrome coronavirus (SARS-CoV) which caused the 2002-3 pandemic.^9 The principle investigator participated in a project which generated a chimeric virus using the SARS-CoV reverse genetics system, and reported the potential for human emergence.^10 A direct speculation was that SARS-CoV or its derivative might leak from the laboratory.\n\n>In summary, somebody was entangled with the evolution of 2019-nCoV coronavirus. In addition to origins of natural recombination and intermediate host, *the killer coronavirus probably originated from a laboratory in Wuhan.* Safety level may need to be reinforced in high risk biohazardous laboratories. Regulations may be taken to relocate these laboratories far away from city center and other densely populated places.\n\n>https://img-prod.tgcom24.mediaset.it/images/2020/02/16/114720192-5eb8307f-017c-4075-a697-348628da0204.pdf (archived [here](https://files.catbox.moe/xzbr3n.pdf))", "created_utc": 1586101092.0, "distinguished": null, "id": "fmi2lzx", "is_submitter": true, "link_id": "t3_fu7rqh", "parent_id": "t3_fu7rqh", "score": 1, "stickied": false, "subreddit_id": "t5_22h1fj", "downs": 0, "total_awards_received": 0, "edited": 1586102501.0, "name": "t1_fmi2lzx", "collapsed": false, "permalink": "/r/ChrisKyleAmSniper/comments/fu7rqh/did_coronavirus_originate_in_chinese_government/fmi2lzx/"}