{"author": {"comment_karma": 70, "created_utc": 1571433038.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_26tz0p/styles/profileIcon_5ro8gk448dt31.jpg?width=256&height=256&crop=256:256,smart&s=345ea2c382b6d108ea0647ac3b485584bf55b197", "id": "4dm2hwci", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 1886, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_26tz0p/styles/profileBanner_s5dtca63zet31.jpg?width=1280&height=384&crop=1280:384,smart&s=0690cbe39a88d2c95db84acb75703451fcfd3f48", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_AdultingRX", "header_img": null, "title": "Adulting Deficit Disorder", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_26tz0p/styles/profileIcon_5ro8gk448dt31.jpg?width=256&height=256&crop=256:256,smart&s=345ea2c382b6d108ea0647ac3b485584bf55b197", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/AdultingRX", "key_color": "", "name": "t5_26tz0p", "is_default_banner": false, "url": "/user/AdultingRX/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "AdultingRX. Your prescription for Adulting Deficit Disorder-when mental health makes adulting extra hard. \n\n60mg Humor \n10mg Inspiration \n30mg Coping www.adultingdeficitdisorder.com (coming soon!)", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "AdultingRX"}, "body": "Was curious what else she said in her book after seeing this and found the prediction below on a page not too far past the page in the post image. It’s a pretty interesting way to consider reconstructing how our government functions.\n\nExcerpt from book, “End of Days” by Sylvia Browne\n\n“The year 2020 will mark the end of the U.S. presidency and the executive branch of the government. Let’s just say the American public will finally be fed up by then and leave it at that.\n\nThe legislative branch will essentially absorb the responsibilities of the executive branch, with a streamlined body of elected representatives, an equal number from each state, forming the new legislature, which will be known simply as the Senate. The “party” system of Democrats, Republicans, Independents, et al., will un-complicate itself into Liberals and Conservatives, who will debate and vote on each proposed bill and law in nationally televised sessions.\n\nRequirements for Senate candidates will be stringent and continuously monitored. For example, senators will be prohibited from having any past or present salaried position with any company that has ever had or might ever have a professional or contractual connection to federal, state, or local government, and each senator must submit to random drug and alcohol testing throughout his or her term.\nThe long-term effects of this reorganized government and closely examined body of lawmakers will be a return of legislative accountability and public trust, and state\ngovernments will follow suit no later than 2024 by becoming smaller mirror images of the national Senate.\n\nAmong the laws that will be enacted during the Senate’s first six-year term will be:\n• the flat tax\n• tax bonuses for those with careers in the arts, education, law enforcement, and public service\n• national observance of all major holidays celebrated by all major religions, as well as a Day of Remembrance for Holocaust survivors, victims, and their descendants\n• “neutering” of all male and female pedophiles proved guilty by irrefutable evidence as a mandated part of their prison sentence\n• a public health system\n• driving under the influence of drugs or alcohol, even on the first offense, will result in mandated inpatient rehab and detox, and the immediate seizure and auctioning of the vehicle to defray the rehab and detox expenses.”", "created_utc": 1584405576.0, "distinguished": null, "id": "fkpakyh", "is_submitter": false, "link_id": "t3_feqv93", "parent_id": "t3_feqv93", "score": 2, "stickied": false, "subreddit_id": "t5_2qmhd", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkpakyh", "collapsed": false, "permalink": "/r/Psychic/comments/feqv93/in_2008_a_psychic_named_sylvia_browne_wrote_a/fkpakyh/"}