{"author": {"comment_karma": 559, "created_utc": 1367350735.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_FF585B.png", "id": "bilhp", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 205, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_mrgreengenes42", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/mrgreengenes42", "key_color": "", "name": "t5_ajp52", "is_default_banner": true, "url": "/user/mrgreengenes42/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "mrgreengenes42"}, "body": "It also may suggest that they were abducted by aliens or it may suggest that they were really crab people posing as humans driven back underground by the virus.  I have as much proof for those explanations as they do for their implication that anywhere near 21 million people died from this virus.\n\nI saw people all the time with multiple cell phones in China.  From taxi drivers, to the people I worked with in auto plants.\n\n>Tang Jingyuan, a U.S.-based China affairs commentator, told The Epoch Times on March 21.\n\nTang Jingyuan appears to work in some capacity for The Epoch Times.  Googling his name, I can only find references to him in other Epoch Times articles all describing him the same way, as a US-based China affairs commentator, and an article he wrote for the Epoch Times.\n\nThe article is nothing more than a series of reasonable explanations for why the cell phone numbers are down followed by the author asserting that they're not good explanations without proving why.\n\n>The 2020 decrease in landline users may be due to the nationwide quarantine in February, during which small businesses were shut down. But the decrease in cellphone users can’t be explained in this way.\n\nWhy not?  Small businesses don't use cell phones?  What are they basing this claim on?\n\n>However, because there is a basic monthly fee to hold a cellphone account in China, the majority of migrant workers—the lowest income group—are likely to only have one cellphone account.\n\nCell phone plans in China are cheap as hell.  You can get a basic monthly plan for as low as 10-20RMB a month (less than $5).\n\n>A comparison with the situation in Italy also suggests the Chinese death toll is significantly underreported. Italy adopted similar measures to those used by the Chinese regime. The CCP virus death toll in Italy of 4,825 translates to a death rate of 9 percent. In China, where a much larger population was exposed to the virus, the reported death toll of 3,265 translated to a death rate of only 4 percent, less than half that reported in Italy.\n\n[Based on the numbers we have available to us](https://www.worldometers.info/coronavirus/#countries) Germany is .6%, the US is 1.5% (4.5% in WA, 4.3% in LA, 1.1% in NY), Spain is 7.7%, South Korea is 1.5%, France is 6%.  I think the only thing we can know based on these numbers is that we don't know what the real death toll of this virus is.  We won't know until more research can be done after it's over.  The fact that the death toll was higher somewhere else does not imply that the death toll should be the same everywhere.\n\n>Lacking data, the real death toll in China is a mystery.\n\n\"So we're exploiting the mystery of it to support whatever narrative that we want!\"\n\nI'm sure the numbers are higher than what the CCP has reported and I have no respect for their corrupt authoritarian nightmare of a government and the way they've warped Chinese culture into worshiping authority, but this article is baseless, speculative conspiracy mongering.", "created_utc": 1585339337.0, "distinguished": null, "id": "floj7jv", "is_submitter": false, "link_id": "t3_fpwlqp", "parent_id": "t3_fpwlqp", "score": 5, "stickied": false, "subreddit_id": "t5_2qh63", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_floj7jv", "collapsed": false, "permalink": "/r/Libertarian/comments/fpwlqp/21_million_fewer_cellphone_users_in_china_may/floj7jv/"}