{"author": {"comment_karma": 10, "created_utc": 1520976284.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_gtll2/styles/profileIcon_zpczx8sid5s41.jpg?width=256&height=256&crop=256:256,smart&s=14d24eb9761ac42f69856a6b91a86ae83b8ce2da", "id": "yae81x1", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 152, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_gtll2/styles/profileBanner_otd045pvh4s41.jpg?width=1280&height=384&crop=1280:384,smart&s=c7e93b79351a2bee175a629fae371c061da4c5d8", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_linkgostar", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_gtll2/styles/profileIcon_zpczx8sid5s41.jpg?width=256&height=256&crop=256:256,smart&s=14d24eb9761ac42f69856a6b91a86ae83b8ce2da", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/linkgostar", "key_color": "", "name": "t5_gtll2", "is_default_banner": false, "url": "/user/linkgostar/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "I'll see you again, when pigs fly.", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "linkgostar"}, "clicked": false, "created_utc": 1584613275.0, "distinguished": null, "edited": false, "id": "fl7rj4", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_fl7rj4", "num_comments": 0, "over_18": false, "score": 6, "downs": 0, "title": "People with blood type A may be more vulnerable to infection by the new coronavirus", "view_count": null, "media": null, "url": "https://www.reddit.com/r/english_articles/comments/fl7rj4/people_with_blood_type_a_may_be_more_vulnerable/", "permalink": "/r/english_articles/comments/fl7rj4/people_with_blood_type_a_may_be_more_vulnerable/", "selftext": " People with blood type A may be more vulnerable to infection by the new coronavirus, while those with type O seem more resistant, according to a preliminary study of patients in China who contracted the disease known as Covid-19.\n\nMedical researchers in China took blood group patterns of more than 2,000 patients infected with the virus in Wuhan and Shenzhen and compared them to local healthy populations. They found that blood type A patients showed a higher rate of infection and they tended to develop more severe symptoms.\n\nWhile the researchers said the study was preliminary and more work was needed, they did urge governments and medical facilities to consider blood type differences when planning mitigation measures or treating patients with the virus, known as Sars-CoV-2.\n\n“People of blood group A might need particularly strengthened personal protection to reduce the chance of infection,” wrote the researchers led by Wang Xinghuan with the Centre for Evidence-Based and Translational Medicine at Zhongnan Hospital of Wuhan University.\n\n“Sars-CoV-2-infected patients with blood group A might need to receive more vigilant surveillance and aggressive treatment,” Wang wrote.\n\nIn contrast, “blood group O had a significantly lower risk for the infectious disease compared with non-O blood groups”, according to a paper they published on Medrxiv.org on March 11.\n\nOf 206 patients who had died from Covid-19 in Wuhan, 85 had type A blood, which was 63 per cent more than the 52 with type O. The pattern existed across different age and gender groups.\n\n“It might be helpful to introduce ABO blood typing in both patients and medical personnel as a routine part of the management of Sars-CoV-2 and other coronavirus infections, to help define the management options and assess risk exposure levels of people,” Wang wrote in the paper.\n\nThe study was conducted by scientists and doctors from cities across China including Beijing, Wuhan, Shanghai and Shenzhen. It has not been peer reviewed, and the authors cautioned that there could be risks involved in using the study to guide current clinical practice.\n\nGao Yingdai, a researcher with the State Key Laboratory of Experimental Haematology in Tianjin who was not involved in the study, said it could be improved with a larger sample size. Though 2,000 was not small, it is dwarfed by the total number of patients infected by the coronavirus, now exceeding 180,000 globally.\n\nAnother limitation of the study was that it did not provide a clear explanation about the phenomenon, such as the molecular interaction between the virus and different types of red blood cells, Gao said.\n\nBlood types are determined by a so-called antigen, a material on the surface of red blood cells that can trigger an immune response. Austrian biologist Karl Landsteiner discovered the main blood groups in 1901, naming them type A, B, AB and O. The discovery allowed for safe blood transfusions by matching blood types in patients.\n\nBlood types vary in a population. In the United States, about 44 per cent of the population is type O, while about 41 per cent is type A. In Wuhan, which has a population of about 11 million, type O is 32 per cent, while A is 34 per cent among healthy people. Among Covid-19 patients, it was about 38 and 25 per cent.\n\nScientists are still unsure how different blood groups evolved, though one theory is that they are a genetic memory of plagues. Others argue that environmental factors such as altitude, temperature or humidity might have played a role to favour the increase of certain blood type populations.\n\nBlood type difference has been observed in other infectious diseases including Norwalk virus, hepatitis B and severe acute respiratory syndrome (Sars), according to previous studies.\n\nGao at the Tianjin lab said the new study “may be helpful to medical professionals, but ordinary citizens should not take the statistics too seriously”. “If you are type A, there is no need to panic. It does not mean you will be infected 100 per cent,” she said.\n\n“If you are type O, it does not mean you are absolutely safe, either. You still need to wash your hands and follow the guidelines issued by authorities.”\n\nsource: [scmp](https://www.scmp.com/news/china/society/article/3075567/people-blood-type-may-be-more-vulnerable-coronavirus-china-study) | [hiwamag](http://www.hiwamag.com/health/blood-type-coronavirus/)", "stickied": false}