{"author": {"comment_karma": 579, "created_utc": 1531288645.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_DB0064.png", "id": "1qz60pmn", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 781, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DB0064", "user_is_muted": null, "display_name": "u_Luckynumba2", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_DB0064.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Luckynumba2", "key_color": "", "name": "t5_lm50g", "is_default_banner": true, "url": "/user/Luckynumba2/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Luckynumba2"}, "body": "Its rough hommie. Everytime i go to work or get off of work, i have to fill out 2 pages. One for work, and one to say why you are outside. It includes: full name, date of birth, address, which direction your going, today's date, what city you signed the documents and a signature. The options on the paper that says why you are outside are as follow: going on a quick walk (500 meters max from residence), going grocerie shopping, seeing a familly member ONLY of absolute emergency and finally, going to work.\n\nI seen this coming since January. I kept telling everyone around me that shit was going to hit the fan. They all laughed at me and told me that it was impossible. I went to do my groceries a month ago and last saturday right before the lock down, because i knew it was coming. My wife was pissed off because of all the food i was buying. She thought I was going nuts. Now she understands why i acted that way. She currently is working from home. I told her I was not ok with her going to work physically. I, sadly can not work from home, because of my job. I work in a warehouse that delivers food under 24H. The government here does not want business like ours to close our doors because we are essential for hospital, retirement houses and local bakeries. At my job, we have lost 80% of our clients. We went from 450,000 euros to 80,000 euros of profit on one day of work. Its bad.. We might be put on partial time with the government paying the other half that we stay at home for. I think this decision will be made next week.\n\nOn another note, we have 5 employees since the beginning of this week that stopped showing up to work. One of them is sick with a cough but no fever...   Yet... If i go to work tomorrow and i find out he has a fever, I'm going straight back home because FUCK that shit. On top of that, the direction is not understanding the severity of the situation. I starting wearing a mask at work. Not really handy when you work in - 25 degrees all day.\n\nOther than that, all good for now. I smell the grass on the side of the road while being outside. I hear birda chirp. Its absolutly insane. At first, your brain doesn't understand what is going on. You'll see.", "created_utc": 1584583031.0, "distinguished": null, "id": "fkw44ci", "is_submitter": false, "link_id": "t3_fl0wzx", "parent_id": "t1_fkw195o", "score": 35, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 1, "edited": false, "name": "t1_fkw44ci", "collapsed": false, "permalink": "/r/Coronavirus/comments/fl0wzx/advice_from_france_to_avoid_ibuprofen_for_covid19/fkw44ci/"}