{"author": {"comment_karma": 31344, "created_utc": 1566383311.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_94E044.png", "id": "4f1prcuk", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 19541, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_Siddhant_17", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Siddhant_17", "key_color": "", "name": "t5_23htnz", "is_default_banner": true, "url": "/user/Siddhant_17/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Siddhant_17"}, "body": "India has less than a million doctors. \n\nIt's not hard to slowly stockpile over the years. more than that. People lives are more important than anything else. Resources are finite and what we're they spent on? The military. They were spent on giving tax cuts to billionaires. \n\nWe have enough resources to fees whole world but we don't. We should have been preparing for decades. slowly putting resources until we built a large cache. It's not hard to have every hospital stockpile masks. Why we're governments so slow in putting up travel restrictions? \n\nTaiwan acted preemptively and they are doing great. India and US are doing very little and millions will end up dead. \n\nI am not even in this field. I was training to be a Neurosurgeon and I volunteered still to test people because we literally don't have enough people.\n\nNo measure can be too great. Hospitals are lying about number of cases to prevent panic. We are reusing old masks. Putting our lives at risk. If situation in Italy gets worse. we will have to let hopeless cases just die. \n\nThis happened because governments cared more about stocks, more about rich people, more about their dick measuring contest in military and now here we are with a second great depression on our heads. \n\nCongrats. \n\nIt is easy to put some money every year into pandemic prevention. Over decades it would be become a robust system. \n\nYour talk about bunkers is stupid. Nations like Switzerland did built bunkers over decades. Slowly and now if a nuclear war happens. They will survive fine. And there economy did not suffer either. \n\nIf you have a million euros. You can easily put a thousand  of them into a savings account for emergency. Same should have been done here. \n\nPeople are dying. It will get a lot worse. Most optimistic estimates for roll out of vaccines is 18 months. Millions could die all over the world in that time frame. \n\nLook at NHS, it barely worked as it was and it is just gonna die when UK goes to shit. India is just doomed. \n\nWe had such a long time to prepare and we didn't. SARS and Ebola should have been a wakeup call but it wasn't.", "created_utc": 1584277765.0, "distinguished": null, "id": "fkk983v", "is_submitter": false, "link_id": "t3_fisiy7", "parent_id": "t1_fkk8ix7", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkk983v", "collapsed": false, "permalink": "/r/worldnews/comments/fisiy7/italians_over_80_will_be_left_to_die_as_country/fkk983v/"}