{"author": {"comment_karma": 2799, "created_utc": 1504316467.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_7ubpr/styles/profileIcon_neb98gr2e9521.jpg?width=256&height=256&crop=256:256,smart&s=614ac141cbb32b194e244e08084f32c09825d8f0", "id": "blll4z4", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 170, "subreddit": {"default_set": false, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_DiegoMaxIT", "header_img": null, "title": "Diego", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_7ubpr/styles/profileIcon_neb98gr2e9521.jpg?width=256&height=256&crop=256:256,smart&s=614ac141cbb32b194e244e08084f32c09825d8f0", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/DiegoMaxIT", "key_color": "", "name": "t5_7ubpr", "is_default_banner": true, "url": "/user/DiegoMaxIT/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "DiegoMaxIT"}, "body": " [http://www.ansa.it/lombardia/notizie/2020/02/28/coronavirus-ospedali-lombardi-al-limite\\_e10e69de-a76d-498d-8060-93700bba7570.html](http://www.ansa.it/lombardia/notizie/2020/02/28/coronavirus-ospedali-lombardi-al-limite_e10e69de-a76d-498d-8060-93700bba7570.html)   \n\n\n  (ANSA) - MILANO, 28 FEB - Gli ospedali della Lombardia alle prese con l'emergenza coronavirus sono \"ai limiti della tenuta\".  \n    Lo afferma il professor Massimo Galli, infettivologo dell'ospedale Sacco di Milano, nel corso di una conferenza stampa nella sede della Regione Lombardia. \"Gran parte dei letti, nei reparti di Rianimazione, sono occupati da questa patologia - aggiunge - Alcuni ospedali sono in grave crisi, come Lodi e Cremona, dove registriamo un sovraccarico di pazienti\".  \n    Per contenere il coronavirus, secondo Galli, è necessario limitare il numero dei contagi, al momento ancora troppo alto.  \n    \"Dobbiamo ridurre il numero riproduttivo del virus da 2-2,5 a 1\", ha spiegato il professore. \n\nTranslated:\n\n (ANSA) - MILAN, FEBRUARY 28 - The hospitals in Lombardy facing the coronavirus emergency are \"about to be full\". This was stated by Professor Massimo Galli, infectious disease specialist at the Sacco hospital in Milan, during a press conference in the Lombardy Region headquarters. \"Most of the beds in the intensive care units are occupied by this pathology - he adds - Some hospitals are in serious crisis, such as Lodi and Cremona, where we are experiencing an overload of patients\". To contain the coronavirus, according to Galli, it is necessary to limit the number of infections, currently still too high. \"We have to reduce the reproductive number of the virus from 2-2.5 to 1,\" explained the professor. \n\nYou may add the hospital of Bergamo (lately a lot of new cases there) but for example in Veneto, where there are a lot of cases too, there is no emergency (at the moment) (source I live in Veneto and have some nurse friends from Verona, Padua and Venice that are more or less keeping me upgraded)\n\n&#x200B;\n\n [https://www.reddit.com/r/askscience/comments/fguheu/why\\_have\\_so\\_few\\_people\\_died\\_of\\_covid19\\_in\\_germany/](https://www.reddit.com/r/askscience/comments/fguheu/why_have_so_few_people_died_of_covid19_in_germany/) \n\nIn the comments you can easily find why. I don't really remember if in one comment someone says that it depends on the way every government count the deaths.\n\nNevertheless I'm absolutely sure that here in Italy we are counting as a Sars-CoV-2 death every person that is positive to the kit. Nevermind found it.\n\n( [https://www.agi.it/fact-checking/news/2020-03-12/coronavirus-bilancio-morti-contagi-guariti-dati-7447972/](https://www.agi.it/fact-checking/news/2020-03-12/coronavirus-bilancio-morti-contagi-guariti-dati-7447972/)  in italian but you can easily translate this)\n\n \n\n***Morti “per” o morti “con”?***\n\nCome [ha spiegato](http://www.protezionecivile.gov.it/web/guest/media-comunicazione/comunicati-stampa/-/content-view/view/1227761) la Protezione civile in un comunicato stampa, il numero dei decessi «potrà essere confermato solo dopo che l’Istituto Superiore di Sanità avrà stabilito la causa effettiva del decesso».\n\n«Ci tengo a precisare che non si tratta di decessi “da” coronavirus», [ha poi detto](https://youtu.be/q0SsN6MtVeI?t=97) Borrelli il 10 marzo in conferenza stampa. «Sono persone che sono decedute e tra le diverse patologie avevano anche il coronavirus».\n\nIn parole semplici, non è ancora possibile sapere se le morti presenti nei bollettini della Protezione civile siano morti direttamente causate dal coronavirus, oppure “indirette”, in cui il coronavirus ha contribuito a creare ulteriori complicazioni in un quadro clinico già compromesso.\n\nTranslate into: (only a part of it)\n\n   \nDead \"for\" or dead \"with\"?  \n\nAs Civil Protection explained in a press release, the number of deaths \"can only be confirmed after the Istituto Superiore di Sanità has established the actual cause of the death\".  \"I want to clarify that these are not\" coronavirus \"deaths,\" said Borrelli on March 10 at a press conference. \"They are people who have died and among the various pathologies they also had coronavirus\".  In simple words, it is not yet possible to know whether the deaths present in the Civil Protection bulletins died directly from the coronavirus, or \"indirect\", in which the coronavirus contributed to create further complications in an already compromised clinical picture. \n\n&#x200B;\n\nFound one even in english  [https://abcnews.go.com/Health/number-coronavirus-cases-rises-italy-hit-hard/story?id=69513697](https://abcnews.go.com/Health/number-coronavirus-cases-rises-italy-hit-hard/story?id=69513697) \n\nthat add:\"If asymptomatic or minimally symptomatic patients are not being tested, this will also skew the numbers we are seeing and increase the rates of adverse outcomes,\" she said.\" (a thing I forgot to point out before but right now we are starting to test everybody so hopefully even someone like you will understand when the statistics will be better)\n\n&#x200B;\n\nSo again man, if you don't know something just don't talk about it as if you know everything about it.\n\nAll you said is yet crap and will become more crap in a couple of weeks when better data will come avaible (higher number of test done and, hopefully, the number of cases will lower so even that 3 hospitals will be in fine condition)\n\nJust found a new one: https://www.open.online/2020/03/15/coronavirus-ultime-notizie-15-marzo/\n\nNon c’è più tempo. Prima l’allarme lanciato dal medico anestesista di Bergamo, ora è tornato a ribadirlo anche il governatore della Lombardia Attilio Fontana: «I numeri continuano a crescere: siamo vicini al momento in cui non avremo letti di rianimazione». In un’intervista a Sky TG24 il presidente della regione ha spiegato che il problema principale è recuperare respiratori. Elemento essenziale per la costruzione di un ospedale da 500 posti nei padiglioni della Fiera di Milano. Nel frattempo, ha aggiunto, si cerca di recuperare altri letti negli ospedali. «E spero che riescano ancora per qualche giorno – ha aggiunto – a compiere questi miracoli». Per creare nuovi posti di rianimazione «abbiamo diversi progetti alternativi – ha aggiunto – ma per metterli in pratica abbiamo bisogno di macchinari per ventilare i polmoni».\n\nTranslated:\n\nThere is no more time. Before the alarm launched by the anesthetist doctor from Bergamo, now the governor of Lombardy Attilio Fontana has also reiterated this: \"The numbers keeps growing: we are close to the moment when we will have no resuscitation beds\". In an interview with Sky TG24, the president of the region explained that the main problem is to recover respirators. Essential element for the construction of a 500-seat hospital in the pavilions of the Fiera di Milano. Meanwhile, he added, efforts are being made to recover more beds in hospitals. \"I hope they still manage to do for a few days - he added - these miracles\". To create new resuscitation places \"we have several alternative projects - he added - but to put them into practice we need machinery to ventilate the lungs\".\n\nAs you can see we are about to reach that point but, again, hopefully with the first week of quarantine almost gone we have to stay strong for two more weeks (maybe only 10 days) to see the result.\n\nWe are not fucked up as the OP source or the two sources you linked describe us. We are close to that but we are already doing the right things and we will see the end of the tunnel (not the virus just the healtcare shortage) soon.", "created_utc": 1584270159.0, "distinguished": null, "id": "fkk1zwm", "is_submitter": false, "link_id": "t3_fisiy7", "parent_id": "t1_fkji09k", "score": 3, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1584300667.0, "name": "t1_fkk1zwm", "collapsed": false, "permalink": "/r/worldnews/comments/fisiy7/italians_over_80_will_be_left_to_die_as_country/fkk1zwm/"}