{"author": {"comment_karma": 3176, "created_utc": 1506567069.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_6g3lo/styles/profileIcon_imzud291jw121.jpg?width=256&height=256&crop=256:256,smart&s=c76c163f75594c4de1d1de197efccd9cb0786cf3", "id": "fbf4qnc", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 3776, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_6g3lo/styles/profileBanner_ms0m0c0tiw121.jpg?width=1280&height=384&crop=1280:384,smart&s=13ff7a2f529371cbf237d8de8a848c8ffbd309b1", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_dc_gay_man", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_6g3lo/styles/profileIcon_imzud291jw121.jpg?width=256&height=256&crop=256:256,smart&s=c76c163f75594c4de1d1de197efccd9cb0786cf3", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/dc_gay_man", "key_color": "", "name": "t5_6g3lo", "is_default_banner": false, "url": "/user/dc_gay_man/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "dc_gay_man"}, "body": "Title: Italians over 80 'will be left to die' as country overwhelmed by coronavirus \n\nHardest-hit region drafts new proposals saying who will live and who will die \n\nCoronavirus victims in Italy will be denied access to intensive care if they are aged 80 or more or in poor health should pressure on beds increase, a document prepared by a crisis management unit in Turin proposes.\n\nSome patients denied intensive care will in effect be left to die, doctors fear.\n\nThe unit has drawn up a protocol, seen by The Telegraph, that will determine which patients receive treatment in intensive care and which do not if there are insufficient spaces. Intensive care capacity is running short in Italy as the coronavirus continues to spread.\n\nThe document, produced by the civil protection deparment of the Piedmont region, one of those hardest hit, says: \"The criteria for access to intensive therapy in cases of emergency must include age of less than 80 or a score on the Charlson comorbidity Index [which indicates how many other medical conditions the patient has] of less than 5.\"\n\nThe ability of the patient to recover from resuscitation will also be considered.\n\nOne doctor said: \"[Who lives and who dies] is decided by age and by the [patient's] health conditions. This is how it is in a war.\"\n\nThe document says: \"The growth of the current epidemic makes it likely that a point of imbalance between the clinical needs of patients with COVID-19 and the effective availability of intensive resources will be reached.\n\n\"Should it become impossible to provide all patients with intensive care services, it will be necessary to apply criteria for access to intensive treatment, which depends on the limited resources available.\"\n\nIt adds: \"The criteria set out guidelines if the situation becomes of such an exceptional nature as to make the therapeutic choices on the individual case dependent on the availability of resources, forcing [hospitals] to focus on those cases in which the cost/benefit ratio is more favorable for clinical treatment.\"\n\nLuigi Icardi, a councilor for health in Piedmont, said: \"I never wanted to see such a moment. It [the document] will be binding and will establish in the event of saturation of the wards a precedence code for access to intensive care, based on certain parameters such as potential survival.\"\n\nThe document is already complete and only approval from a technical-scientific committee is needed before it is sent to hospitals. The criteria are expected to apply throughout Italy, government sources said.\n\nMore than 1,000 people in Italy have now died from the virus and the number is growing every day. More than 15,000 are infected.\nItaly has 5,090 intensive care beds, which for the moment exceeds the number of patients who need them. It is also working to create new bed capacity in private clinics, nursing homes and even in tents. However, the country also needs also doctors and nurses - the government wants to hire them - and equipment.\n\nLombardy remains the most critical region. However, the situation is also serious in neighboring Piedmont. Here, in just one day, 180 new cases were recorded, while deaths numbered 27. The trend suggests that the situation is not about to improve.\n\nRoberto Testi, president of the coranavirus technical-scientific committee for Piedmont, told The Telegraph: \"Here in Piedmont we aim to delay as long as possible the use of these criteria. At the moment there are still intensive care places available and we are working to create more.\n\n\"We want to arrive as late as possible at the point where we have to decide who lives and who dies. The criteria relate only to access to intensive care - those who do not get access to intensive care will still receive all the treatment possible. In medicine we sometimes have to make difficult choices but it's important to have a system about how to make them.\"", "created_utc": 1584414083.0, "distinguished": null, "id": "fkpn24t", "is_submitter": true, "link_id": "t3_fjxux3", "parent_id": "t3_fjxux3", "score": 1, "stickied": false, "subreddit_id": "t5_2go0cj", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkpn24t", "collapsed": false, "permalink": "/r/NorthCarolinaCOVID/comments/fjxux3/italy_must_include_age_of_less_than_80_to_gain/fkpn24t/"}