{"author": {"comment_karma": 361476, "created_utc": 1520285869.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_EA0027.png", "id": "102rcftk", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 479101, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#EA0027", "user_is_muted": null, "display_name": "u_SamDumberg", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_EA0027.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/SamDumberg", "key_color": "", "name": "t5_gixbo", "is_default_banner": true, "url": "/user/SamDumberg/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "SamDumberg"}, "body": ">The abrupt departure of Rear Adm. Timothy Ziemer from the National Security Council means no senior administration official is now focused solely on global health security. Ziemer’s departure, along with the breakup of his team, comes at a time when many experts say the country is already underprepared for the increasing risks of a pandemic or bioterrorism attack.\n\n>Ziemer’s last day was Tuesday, the same day **a new Ebola outbreak was declared in Congo. He is not being replaced**.\n\nWTF\n\n>**The personnel changes, which Morrison and others characterize as a downgrading of global health security, are part of Bolton’s previously announced plans to streamline the NSC.** Two members of Ziemer's team have been merged into a unit in charge of weapons of mass destruction, and another official's position is now part of a unit responsible for international organizations. White House homeland security adviser Tom Bossert, who had called for a comprehensive biodefense strategy against pandemics and biological attacks, is out completely. He left the day after Bolton took over last month.\n\n>NSC spokesman Robert Palladino said Wednesday the administration “remains committed to global health, global health security and biodefense, and will continue to address these issues with the same resolve under the new structure.”\n\n>Another administration official, who spoke on the condition of anonymity because he was not authorized to discuss the issue publicly, acknowledged it was only one of many administration priorities. **“In a world of limited resources, you have to pick and choose,” he said. “We lost a little bit of the leadership, but the expertise remains.”**\n\n...\n\n>This week, the administration released a list of $15 billion in spending cuts it wants Congress to approve. Among the targets is $252 million in unused funds remaining from the 2014-2015 Ebola epidemic in West Africa that killed more than 11,000 people, far exceeding the combined total cases reported in about 20 previous outbreaks since the 1970s.\n\n...\n\n>The day before news of Ziemer’s exit became public, one of the officials on his team, Luciana Borio, director of medical and biodefense preparedness at the NSC, spoke at a symposium at Emory University to mark the 100th anniversary of the 1918 influenza pandemic. That event killed an estimated 50 million to 100 million people worldwide.\n\n>**“The threat of pandemic flu is the number one health security concern,” she told the audience. “Are we ready to respond? I fear the answer is no.”**\n\n\n\n", "created_utc": 1525989426.0, "distinguished": null, "id": "dys1axa", "is_submitter": true, "link_id": "t3_8iin85", "parent_id": "t3_8iin85", "score": 87, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": 1525990305.0, "name": "t1_dys1axa", "collapsed": false, "permalink": "/r/politics/comments/8iin85/top_white_house_official_in_charge_of_pandemic/dys1axa/"}