{"author": {"comment_karma": 2242, "created_utc": 1328290060.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_15_FF4500.png", "id": "6twmu", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 8270, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_ZeroHealth", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_15_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ZeroHealth", "key_color": "", "name": "t5_cd7yj", "is_default_banner": true, "url": "/user/ZeroHealth/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ZeroHealth"}, "body": "Abraar Karan MD, MPH, DTM&H\n\nI may be repeating myself, but I want to fight this sense of security that I see outside of the epicenters, as if nothing was going to happen \"here\". The media in Europe are reassuring, politicians are reassuring, while there's little to be reassured of. This is the English translation of a post of another ICU physician in Bergamo, Dr. Daniele Macchini.\n\n[https://www.ecodibergamo.it/stories/bergamo-citta/con-le-nostre-azioni-influenziamola-vita-e-la-morte-di-molte-persone\\_1344030\\_11/](https://www.ecodibergamo.it/stories/bergamo-citta/con-le-nostre-azioni-influenziamola-vita-e-la-morte-di-molte-persone_1344030_11/)\n\n>«With our actions we influence the life and death of many people»  \nDr. Daniele Macchini  \n>  \n>\"After much thought about whether and what to write about what is happening to us, I felt that silence was not responsible. I will therefore try to convey to people far from our reality what we are living in Bergamo in these days of Covid-19 pandemic. I understand the need not to create panic, but when the message of the dangerousness of what is happening does not reach people I shudder.  \n>  \n>I myself watched with some amazement the reorganization of the entire hospital in the past week, when our current enemy was still in the shadows: the wards slowly \"emptied\", elective activities were interrupted, intensive care were freed up to create as many beds as possible. All this rapid transformation brought an atmosphere of silence and surreal emptiness to the corridors of the hospital that we did not yet understand, waiting for a war that was yet to begin and that many (including me) were not so sure would ever come with such ferocity.  \n>  \n>I still remember my night call a week ago when I was waiting for the results of a swab. When I think about it, my anxiety over one possible case seems almost ridiculous and unjustified, now that I've seen what's happening. Well, the situation now is dramatic to say the least. The war has literally exploded and battles are uninterrupted day and night. But now that need for beds has arrived in all its drama. One after the other the departments that had been emptied fill up at an impressive pace.  \n>  \n>The boards with the names of the patients, of different colours depending on the operating unit, are now all red and instead of surgery you see the diagnosis, which is always the damned same: bilateral interstitial pneumonia.  \n>  \n>Now, explain to me which flu virus causes such a rapid drama. \\[post continues comparing covid19 to flu\\].  \n>  \n>And while there are still people who boast of not being afraid by ignoring directions, protesting because their normal routine is\"temporarily\" put in crisis, the epidemiological disaster is taking place. And there are no more surgeons, urologists, orthopedists, we are only doctors who suddenly become part of a single team to face this tsunami that has overwhelmed us.  \n>  \n>Cases are multiplying, we arrive at a rate of 15-20 admissions per day all for the same reason. The results of the swabs now come one after the other: positive, positive, positive. Suddenly the E.R. is collapsing.  \n>  \n>Reasons for the access always the same: fever and breathing difficulties, fever and cough, respiratory failure. Radiology reports always the same: bilateral interstitial pneumonia, bilateral interstitial pneumonia, bilateral interstitial pneumonia. All to be hospitalized.  \n>  \n>Someone already to be intubated and go to intensive care. For others it's too late... Every ventilator becomes like gold: those in operating theatres that have now suspended their non-urgent activity become intensive care places that did not exist before.  \n>  \n>The staff is exhausted. I saw the tiredness on faces that didn't know what it was despite the already exhausting workloads they had. I saw a solidarity of all of us, who never failed to go to our internist colleagues to ask \"what can I do for you now?\"  \n>  \n>Doctors who move beds and transfer patients, who administer therapies instead of nurses. Nurses with tears in their eyes because we can't save everyone, and the vital parameters of several patients at the same time reveal an already marked destiny.  \n>  \n>There are no more shifts, no more hours. Social life is suspended for us. We no longer see our families for fear of infecting them. Some of us have already become infected despite the protocols.  \n>  \n>Some of our colleagues who are infected also have infected relatives and some of their relatives are already struggling between life and death. So be patient, you can't go to the theatre, museums or the gym. Try to have pity on the myriad of old people you could exterminate.  \n>  \n>We just try to make ourselves useful. You should do the same: we influence the life and death of a few dozen people. You with yours, many more. Please share this message. We must spread the word to prevent what is happening here from happening all over Italy.\"\n\nI finish by saying that I really don't understand this war on panic. The only reason I see is mask shortages, but there's no mask on sale anymore. We don't have a lot of studies, but is it panic really worse than neglect and carelessness during an epidemic of this sort?", "created_utc": 1583753725.0, "distinguished": null, "id": "fk0dyhk", "is_submitter": true, "link_id": "t3_fft7jt", "parent_id": "t3_fft7jt", "score": 21, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 0, "edited": 1583754545.0, "name": "t1_fk0dyhk", "collapsed": false, "permalink": "/r/Coronavirus/comments/fft7jt/english_translation_of_a_facebook_post_of_a/fk0dyhk/"}