{"author": {"comment_karma": 4611, "created_utc": 1575664949.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_C18D42.png", "id": "565rhnjy", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 265, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_Unhappy-Satisfaction", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Unhappy-Satisfaction", "key_color": "", "name": "t5_29ut16", "is_default_banner": true, "url": "/user/Unhappy-Satisfaction/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Unhappy-Satisfaction"}, "body": "It hasn't morphed, however there are some reports of it potentially causing inflammation in blood cells in children. What CNN is doing is undefendable, however there is at least some truth to the story.  Basically, children showing signs of Kawasaki-like syndrome have a far, far higher rate than the base population for COVID-19 infection - up to 90% infection rates in the 85 children who presented with the syndrome during the past couple months); there is also some concerning reports out of Italy, which showed three years worth of Kawasaki-like cases in children in the two months of their peak. \n\nIt is still likely fairly uncommon, but there is compelling evidence for a link to exist, and the going thinking is that the differences in immune response between children and adults causes this sort of blood-vessel inflamation, which is also why Kawasaki is pretty much entirely seen in children in the first place (while blood vessel infections*can* happen in adults, they don't have adverse inflamation to the same degree as children have).\n\nAgain, not defending this nonsense, but it's not actually a false occurence. There is very good reason to believe that Kawasaki-like syndromes might result from COVID-19 infections in children, albeit likely rarely.\n\nFor a bit more info, Kawasaki isn't a disease in and of itself, but rather a rare inflammatory reaction to blood vessel infection. Any disease that can infect blood vessels, which COVID-19 is thought to be able to, can lead to this reaction is rare circumstances. Kawasaki is almost entirely a syndrome associated with children, even with diseases that do infect adults.\n\nThere are actually pretty large differences between how a child's immune system responds to infection and an adult's; it's sort of like how Chicken Pox is mostly harmless to children, but crippling to an adult but in reverse.", "created_utc": 1590371184.0, "distinguished": null, "id": "frq6jly", "is_submitter": false, "link_id": "t3_gpv45x", "parent_id": "t1_frpjk09", "score": 8, "stickied": false, "subreddit_id": "t5_2qh6p", "downs": 0, "total_awards_received": 0, "edited": 1590371484.0, "name": "t1_frq6jly", "collapsed": false, "permalink": "/r/Conservative/comments/gpv45x/they_did_it_again_cbs_caught_using_photo_from/frq6jly/"}