{"title": "Did Corona Beer Sales Drop Sharply Due to Fear About the Coronavirus?", "subtitle": "A trope that suggests people are so dumb they think the beer and virus are related played out in some news reports.", "date": "2 March 2020", "claim": "Sales of Corona beer dropped sharply in early 2020 because consumers mistakenly associated the brand name with the new coronavirus.", "rating": "False", "true_part": "", "false_part": "", "content": "In February 2020, as fears of a world-wide COVID-19 pandemic caused by a new coronavirus from China spread across the globe, many Western news outlets began running stories suggesting that consumers were shunning the popular Mexican brand of beer called Corona due to their mistakenly connecting it with the coronavirus.\nTake, for example, the following article, whose headline and subhead misleadingly implied that the Corona brand had experienced a steep drop-off in sales because potential buyers were being scared off by its putative link to the coronavirus:\n\nHowever, what the text of the article actually reported was not that consumers had suddenly become “afraid” of Corona beer, but that multiple brands of beer (not just Corona) were experiencing relative sales slumps in China because the spread of the coronavirus had generally dampened public activities there, at a time of year (i.e., during Chinese New Year celebrations) when sales were typically high:\nThe world’s biggest brewing giant, which is behind the Corona, Budweiser and Stella Artois brands, forecast first quarter earnings will tumble by about 10% after the virus outbreak saw demand slump in China as it also coincided with the Chinese New Year, sending its shares 8% lower.\nAB InBev estimates the earnings hit across China after seeing around £221 million of lost sales in the first two months of 2020 alone due to coronavirus – also known as Covid-19. The Belgium-based group said: “The impact of the Covid-19 virus outbreak on our business continues to evolve.\n“The outbreak has led to a significant decline in demand in China in both on-premise and in-home channels. Additionally, demand during the Chinese New Year was lower than in previous years as it coincided with the beginning of this outbreak.”\nBut the trope that “people are so dumb they’re shunning Corona beer because they think it’s connected to the coronavirus” was too tempting for many news outlets to eschew, even though little or no evidence backed it up. Many of them based their articles on a survey that supposedly documented that “38% of Beer-Drinking Americans Wouldn’t Buy Corona Now,” again suggesting people were being scared off the brand due to mistaken associations between the name of the brand and a virus.\nHowever, that poll was conducted and published by the 5W public relations firm, and it did not find what many news reports gleefully claimed it did. The PR piece stated that a phone survey of 737 American beer drinkers had determined that “38% of Americans would not buy Corona under any circumstances now,” and by offering that statistic in conjunction with other information about the coronavirus, the piece again misleadingly suggested that consumers were being frightened away from Corona beer merely because of its name. But it didn’t provide readers with the questions that the poll’s subjects were asked, nor did it offer any context explaining why respondents answered the way they did. Or, as The Atlantic noted of the issue:\nBy presenting this finding in the context of other questions that are explicitly about the coronavirus, the press release creates the impression that Americans’ reluctance to drink the beer is due to the coronavirus. “There is no question that Corona beer is suffering because of the coronavirus,” Ronn Torossian, the CEO of 5WPR, says in the press release. “Could one imagine walking into a bar and saying ‘Hey, can I have a Corona?’ or ‘Pass me a Corona.’”\nBut this connection is manufactured, and Torossian is ignoring far more mundane reasons Americans might not buy a Corona, including that they don’t like the taste. Of those Americans who did report regularly drinking Corona, only 4 percent said they would now stop drinking the beer.\nA number of major news outlets appear to have walked right into the trap. Because they did not understand that the original press release was walking a fine line between deeply misleading claims and outright lies, their articles have inadvertently fallen on the side of the lie. As a viral tweet by CNN put it, the survey supposedly found that 38 percent of Americans would not drink Corona, “because of the coronavirus.”\nHuffington Post did obtain a list of the questions that were put to the poll’s respondents and observed how the results could be used to create misleading impressions:\nHere are the questions that were asked, according to The Dispatch’s Declan Garvey, combined with the results 5WPR chose to include in its press release:\nAre you a beer drinker?\nAre you a Corona drinker?\nIs Corona related to the coronavirus? (16% of beer-drinkers were “confused” about this.)\nIn light of the coronavirus, do you plan to stop drinking Corona? (4% who “usually drink Corona” said they planned to stop.)\nWould you buy Corona in a store?\nWould you order a Corona in a restaurant/bar/public venue? (14% who “usually drink Corona” said they would not.)\nWould you buy Corona under any circumstances now? (38% of “beer-drinking Americans” said they would not.)\nThere are any number of ways a careful market researcher might attempt to tease out how, if at all, coronavirus has affected perceptions of the beer. This isn’t one of them. Instead, these questions manage to fail simultaneously in two different directions. On one hand, some of the phrasing (“In light of the coronavirus …”) implies a queasy connection between the virus and the beer that people might not have considered until they were polled.\nOn the other hand, the final three questions ― including the one responsible for that startling 38% statistic ― don’t explicitly mention coronavirus as a motivation at all. In other words, drinkers who said they wouldn’t buy Corona might simply have meant that they prefer to order a different brand of beer.\nThe much less eye-catching but entirely more plausible statistic is that, even “in light of the coronavirus,” just 4% of Americans who “usually drink Corona” say they “plan to stop” drinking it. Even here, the framing of the question is sloppy: If respondents “plan to stop,” doesn’t that imply they haven’t given it up yet?\nA different poll by YouGov reported that “Corona’s Buzz score — a net score based on whether US adults have heard anything negative or positive about the brand” had decreased sharply since the beginning of January 2020, and that “purchase intent for the brand is at the lowest it’s been in two years.” But again, the poll didn’t document any actual decrease in Corona sales due to consumer confusion over a supposed link between the beer and the virus.\nIn fact, CNN reported that Constellation Brands, Corona’s producer, had reported an uptick in sales of the Corona Extra brand in the U.S.:\nConstellation Brands (STZ), which brews several variations of the popular lager, said in a statement that its customers “understand there is no link between the virus and our business.”\n“Sales of Corona remain very strong and we appreciate the continued support from our fans,” Constellation Brands spokesperson Stephanie McGuane told CNN Business. “Our advertising with Corona is consistent with the campaign we have been running for the last 30 years and is based off strong consumer sentiment.”\nConstellation said Corona Extra sales grew 5% in the United States in the four weeks that ended February 16. That’s nearly double the trend of the past 52 weeks. Corona’s sales are heavily dependent on the US market, unlike some of its far-more-international rivals.\nReuters similarly reported Constellation Brands as declaring that “all units supporting its beer business are seeing positive sales trends for the brand thus far in 2020 despite claims about the impact of the coronavirus on its business.”\nNonetheless, the trope that “people are dumb enough to believe you can get the coronavirus by drinking Corona beer” caught on with the press because, as legends often do, it validated something many readers were willing to believe, according to the Atlantic:\nThe real question is why this obscure poll would, even if it had been true, be able to capture the imagination of so many people. And the answer is as obvious as it is saddening: Clearly, a lot of Americans already think that their fellow citizens are stupid. The real reason a fake finding could have spread so far so quickly is that it confirmed prejudices about the world that many have held all along.", "links": ["https://www.snopes.com/collections/new-coronavirus-collection/", "https://www.prnewswire.com/news-releases/5wpr-survey-reveals-38-of-beer-drinking-americans-wouldnt-buy-corona-now-301012225.html", "https://www.theatlantic.com/ideas/archive/2020/02/about-corona-poll/607240/", "https://www.huffpost.com/entry/corona-beer-coronavirus-poll_n_5e598955c5b6450a30be6b33", "https://today.yougov.com/topics/food/articles-reports/2020/02/26/first-it-was-joke-corona-beer-really-suffering-cor", "https://amp.cnn.com/cnn/2020/02/28/business/corona-beer-marketing/index.html", "https://hamodia.com/2020/03/01/corona-beer-maker-u-s-sales-remain-strong-despite-virus-outbreak/"], "imgs": []}