{"title": "Was a Rare Malabar Civet Spotted During COVID-19 Lockdown?", "subtitle": "Shelter-in-place orders amid the coronavirus pandemic may have given wildlife ⁠— and our imaginations ⁠— a little extra room to roam.", "date": "27 March 2020", "claim": "A critically endangered Malabar civet was seen for the first time since the 1990s during a COVID-19 lockdown in India.", "rating": "Mostly False", "true_part": "A video shows an animal that resembles a civet crossing the street in March 2020 in India.", "false_part": "", "content": "On March 26, 2020, a short video clip supposedly showing the first sighting of a critically endangered “spotted Malabar civet” since the 1990s started to circulate on social media. This video was widely shared along with comments connecting this rare sighting to a reduction in outdoor human activity due to various lockdown and shelter-in-place orders that were implemented during the COVID-19 pandemic.\nSpotted Malabar civet… A critically endangered mammal not seen until 1990 resurfaces for the first time in calicut town.. seems mother earth is rebooting! #COVID2019 pic.twitter.com/oG6Kg8Opoi\n— Dón Grieshnak (@DGrieshnak) March 26, 2020\n\nThis is a genuine video of an animal in India that was spotted in March 2020, when many people were practicing social distancing to help slow the spread of the COVID-19 coronavirus disease. However, this video likely shows the more common small Indian civet, not the critically endangered Malabar civet. \nThis video was reportedly taken in Meppayur, a town in the Kozhikode district of the Kerala state in southern India. \nParveen Kaswan, a member of the India Forest Service, identified the animal as a “Small Indian Civet” on Twitter. Kalyan Varma, a wildlife photographer, also identified it as the small Indian civet, not the Malabar civet:\n\nConservation India writes that the small Indian civet and the Malabar civet are similar in appearance. They both have a banded tail and similar markings on their bodies:\nUntil recently, few people have known of the existence or distinguishing characters of the Malabar civet. Among the civets seen in the Western Ghats, the small Indian civet is somewhat similar in appearance to the Malabar civet due to its banded tail and black-and-white markings, but is smaller in size. Both these civet species are mainly ground-dwelling in habit.\nAt most, there are only a few hundred Malabar civets in the world, according to the International Union for Conservation of Nature. The small Indian civet, on the other hand, has a much healthier population. \nHere’s a photograph of a small Indian civet:\n\nAlthough the video above likely shows the relatively common small Indian civet, this is still an unusual sight given it is a nocturnal animal. Some social media users suggested that the animal could be sick as it appears to be moving a bit awkwardly and slow. \nThis is not the first time that we’ve seen a rumor about rare animals emerging due to various shelter-in-place orders put in place during the COVID-19 pandemic. For the most part, these rumors have been exaggerated. You can read our previous fact check about dolphins and swans “returning” to the waterways of Italy here.", "links": ["https://twitter.com/hashtag/COVID2019?src=hash&ref_src=twsrc%5Etfw", "https://t.co/oG6Kg8Opoi", "https://twitter.com/DGrieshnak/status/1243077554224787457?ref_src=twsrc%5Etfw", "https://twitter.com/ParveenKaswan/status/1243495014879166465", "https://twitter.com/KalyanVarma/status/1243138976413675520", "https://www.iucnredlist.org/species/23036/45202281#population", "https://en.wikipedia.org/wiki/Small_Indian_civet#/media/File:Small_Indian_Civet,_Silchar,_Assam,_India.jpg", "https://www.snopes.com/fact-check/dolphins-swans-italy-lockdown/"], "imgs": ["https://www.snopes.com/tachyon/2020/03/small-indian-civet.png", "https://www.snopes.com/tachyon/2020/03/Small_Indian_Civet_Silchar_Assam_India-1.jpg"]}