{"title": "Did 7 Children Die in Senegal from COVID-19 Vaccine?", "subtitle": "This is the false rumor you get when you mix a door-to-door salesman, a health ministry T-shirt, and growing concern over the COVID-19 pandemic.", "date": "10 April 2020", "claim": "Seven children in Senegal died after being administered a COVID-19 coronavirus disease vaccine in April 2020.", "rating": "False", "true_part": "", "false_part": "", "content": "In April 2020, a rumor started to circulate on social media holding that seven children in Senegal had died after being administered a COVID-19 coronavirus disease vaccine.\n\nThere is no truth to this rumor. Seven children did not die in Senegal in April 2020 after they were administered a vaccine for COVID-19.  A spokeswoman for Senegal’s health ministry told the AFP news site that these claims were “fake news.”\nThe spokesperson said:\n“There is no vaccine … We have medical experts at the Institut Pasteur (a medical research institute, editor’s note) in Dakar working to create and certify a vaccine according to procedure. They will be completely transparent about their findings.”\nThis rumor was largely based on a piece of footage from March that showed a somewhat chaotic scene in Senegal. One version of the video that was widely circulated on social media contained narration from a man speaking in French.\nIn that video, the narrator says: “There is a big scandal in Senegal. There is a guy who came into a house to get kids vaccinated for coronavirus. He vaccinated seven children who died on the spot.”\nHowever, this is not the original audio that accompanied this footage. The French news outlet Les Observateurs France 24 found a version of the video in Wolof, the most common language in Senegal, and found that while the Wolof narration also mentioned a COVID-19 vaccine, the claim about seven dead children was absent.\nIn the Wolof version, the narrator says:\n“He’s a guy who came to the neighborhood today with injections supposedly against the coronavirus. He entered the house of the Mbodji family. He said he is there to administer vaccines. The family members told him that this is not true. He fled to go to the neighborhood chief. He was finally neutralized right here with the neighborhood chief. We are currently there and the gendarmerie is there too. Everyone is there for that ”.\nThis version of events matches up with news stories from local Senegal publications. On March 26, the website Senego reported that two people were arrested in the country after they claimed to have a vaccine for COVID-19.\nThe AFP confirmed with local police that a man (not two men) was briefly arrested. However, this incident appears to have been the result of a misunderstanding. The man was apparently selling cosmetics door-to-door, but he was also wearing a health ministry T-shirt. When the word “coronavirus” was mentioned, people started to panic, thinking that he was there to forcibly administer vaccines.\nA spokeswoman for the Senegal health ministry told the AFP:\n“He never wanted to vaccinate people. He was passing by a house, and the resident’s aunt started causing panic when she heard the word ‘coronavirus’. A crowd of people gathered outside, thinking this man wanted to vaccinate people by force.”\nA spokesperson for the armed forces ministry said that no medical equipment was found at the scene, adding:\n“There was just one man who was a Senegalese national selling cosmetics door to door … During the discussion, a member of the family asked him if he had any vaccines. He jokingly replied that he did. The aunt rounded up the whole neighbourhood. Officers attended and found only cosmetic products in the man’s bag. The drama was caused by the fact he was wearing a health ministry t-shirt.”\nFrance 24 managed to contact the woman living in the house where this fiasco took place. Alassane Mbodji told the news outlet that “everything that is said on social networks is false. No one died of any vaccine. Our children are healthy.”\nMbodji explained:\nAbout two weeks ago, a man came home around noon. He introduced himself as an agent of the Ministry of Health who came to raise awareness about the threat of coronavirus and the precautions to be taken to avoid it, such as regular hand washing.\nHe had worn a t-shirt flanked by a logo from the Department of Health. But in the discussions, we quickly realized that he was not an agent of the Ministry of Health. He did not have a badge. He had cosmetic products for sale in his bag.\nOutside people are prohibited from entering homes to prevent the spread of the coronavirus. But this person pretended to be a public agent to be able to sell his articles. So we sent him back to the neighborhood chief. And from there, the gendarmerie took him.\nTo sum up: The claim that seven children died after being administered a vaccine for COVID-19 is false. This rumor is largely based on video showing a somewhat chaotic scene in Senegal involving a door-to-door salesman, a health ministry T-shirt, and growing concern about the COVID-19 pandemic. ", "links": ["https://factcheck.afp.com/senegalese-children-did-not-die-coronavirus-vaccine-which-does-not-yet-exist", "https://senego.com/dalifort-ils-pretendaient-vacciner-contre-le-coronavirus-et-se-font-arreter-video_1064161.html"], "imgs": ["https://www.snopes.com/tachyon/2020/04/Copy-of-Copy-of-Copy-of-Untitled.jpg"]}