{"title": "Was Coronavirus Predicted in a 1981 Dean Koontz Novel?", "subtitle": "A speculative anticipation of a possibility is very different than a 'prediction.'", "date": "18 February 2020", "claim": "Author Dean Koontz predicted the 2020 new coronavirus outbreak in his 1981 novel \"The Eyes of Darkness.\"", "rating": "Mostly False", "true_part": "An image shows a genuine page from Dean Koontz's novel \"The Eyes of Darkness\" containing the words \"Wuhan-400.\"", "false_part": "Dean Koontz did not predict an outbreak of a new coronavirus. Other than the name, his fictional biological weapon had little in common with the virus that caused a real outbreak in 2020.", "content": "When readers first came across a biological weapon named “Wuhan-400” in Dean Koontz’s novel “The Eyes of Darkness,” we doubt anyone had the notion that the famous thriller author was “predicting” a real-world outbreak of COVID-19, coronavirus disease. But in February 2020, after such an outbreak had occurred, eagle-eyed Koontz fans shared this passage as if the famous thriller author was a prognosticator. \n\nThis is a genuine page from the novel “The Eyes of Darkness.” The passage can be seen in Amazon’s preview of a mass market paperback edition of this novel that was released in December 2008.\nIt’s true that Koontz named a fictional biological weapon “Wuhan-400” in this novel. It’s also true that Wuhan, China, is the city at the center of the 2020 coronavirus outbreak. However, that’s pretty much where the similarities end. \nHere are a few things this “prediction” gets wrong:\nBut there’s more bad news for this prediction. \nWhile the page from Koontz’s novel displayed above is genuine, other iterations of this book used a different name for the fictional biological weapon. In fact, when we searched a 1981 edition of this book available via Google Books we found no references to “Wuhan.” In that edition, this biological weapon is called “Gorki-400” after the Russian city where it was created. \n\nWe’re not entirely sure when or why this change occurred. From what we can tell, the biological weapon was originally called “Gorki-400” when this book was published in 1981. But by 2008, the name had been changed to “Wuhan-400.”\nRegardless of when “Wuhan-400” made its way into Koontz’ novel, this is not a prediction. Koontz did not claim that the events that took place in his novel would later come to fruition, and the similarities between “Wuhan-400” and COVID-19 are minimal. Furthermore, readers only noticed this “prediction” after an outbreak of coronavirus was reported in Wuhan, China, which makes this “prediction” nothing more than a coincidence. \nAnother image supposedly showing a second page from Koontz’ novel “The Eyes of Darkness” was also circulated on social medias as further evidence that the author had “predicted” the COVID-19 pandemic:\n\nThis page does not come from Koontz’ novel “The Eyes of Darkness.” This actually comes from a book called “End of Days” by self-described psychic Sylvia Browne. You can read more about Browne’s “prediction” here.", "links": ["https://twitter.com/NickHintonn/status/1228896027987660800", "https://www.amazon.com/Eyes-Darkness-Thriller-Dean-Koontz/dp/0425224864", "http://Screenshot-2020-02-18-at-3.03.34-PM.png", "https://www.google.com/books/edition/The_Eyes_of_Darkness/U270yU756JoC?hl=en&gbpv=0&bsq=gorki-400", "https://www.snopes.com/fact-check/sylvia-browne-coronavirus/"], "imgs": ["https://www.snopes.com/tachyon/2020/02/Screenshot-2020-02-18-at-2.22.50-PM.png", "https://www.snopes.com/tachyon/2020/02/gorki-400.png", "https://www.snopes.com/tachyon/2020/02/miscaptioned-koontz.png"]}