{"title": "Did Johns Hopkins Publish This ‘Excellent Summary’ of COVID-19 Advice?", "subtitle": "If you're looking for reliable COVID-19 information from Johns Hopkins University, please check the university's website.", "date": "30 March 2020", "claim": "Johns Hopkins University published this \"excellent summary\" on avoiding COVID-19.", "rating": "Misattributed", "true_part": "", "false_part": "", "content": "In late March 2020, a letter supposedly published by Johns Hopkins University containing an “excellent summary” of advice on how to avoid catching COVID-19 was widely circulated via email and on social media:\nBut this content did not originate with Johns Hopkins, a spokesperson confirmed:\nThis is not something produced by Johns Hopkins Medicine (JHM). We have seen rumors and misinformation about COVID-19 citing our experts and circulating on social media, and we have received several inquiries from the general public about these posts. We do not know their origin, and they lack credibility.\nThe spokesperson also noted that people seeking verified information from Johns Hopkins University should check the university’s COVID-19 Resource Center.\nWe have not been able to definitively determine the origins of the list displayed above. Some iterations claim that this “excellent summary to avoid contagion” was sent out by Johns Hopkins University itself, but others involve a more convoluted attribution. For instance, some versions attribute the information to “Irene Ken,” an alleged physician, who received the information from her unnamed daughter, an assistant professor in infectious diseases at Johns Hopkins University.\nWe also found versions that promote different advice. For instance, the Facebook post shown above from the “Gomes Football Club” claims that Listerine mouthwash can be used to fight COVID-19 (this is false). But this bad advice is not included in other versions of this message posted to Facebook. This indicates to us that the list evolved as it circulated on social media to include a hodgepodge of unverified advice. \nRegardless of who penned the list, Johns Hopkins University told us such posts “lack credibility.” We won’t go through each point, but we did find a few items on this list to be factually inaccurate. \nFor starters, this list starts with the claim that COVID-19 is a “protein molecule (DNA).” DNA is not a protein, and coronaviruses are RNA viruses which contain no DNA.\nThe list also claims that Listerine contains more alcohol than Vodka. This is not true. Most Listerine products contain 27% alcohol, resulting in an approximately 54-proof product. Vodka on the other hand typically contains 40% alcohol, which results in an 80-proof product. Neither of these items will effectively sanitize your hands. Soap should be your first choice, but the Centers for Disease Control and Prevention (CDC) writes that if soap and water are not available, an alcohol-based sanitizer containing at least 60% alcohol (120 proof) can be used. Then wash with soap and water as soon as you can.\nThis list also states COVID-19 needs “moisture to stay stable, and especially darkness. Therefore, dehumidified, dry, warm and bright environments will degrade it faster.” But this has not been definitively proven. Although there is still a lot to learn about this new strain of coronavirus, the World Health Organization states that “the COVID-19 virus can be transmitted in ALL AREAS, including areas with hot and humid weather.”\nTo sum up: This viral “advice” did not originate with Johns Hopkins University and the information contained within lacks credibility. \nPlease keep yourself informed about COVID-19. If you have a question about the disease or a related matter, you can contact us here. You can also read previous Snopes fact checks about the coronavirus here. The websites of the World Health Organization and the Centers for Disease Control and Prevention are also full of crucial information. Readers can also reference information that has been vetted by Johns Hopkins University using the university’s COVID-19 Resource Center.", "links": ["https://www.hopkinsmedicine.org/coronavirus/index.html", "https://www.facebook.com/jeff.curtis.14/posts/10216052000318982", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4369385/", "https://www.listerine.com/mouthwash/antiseptic/listerine-original-mouthwash#inactive-ingredients", "https://www.cdc.gov/handwashing/pdf/hand-sanitizer-factsheet.pdf", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public/myth-busters", "https://www.snopes.com/covid-19-survey/", "https://www.snopes.com/tag/covid-19/", "https://www.who.int/news-room/q-a-detail/q-a-coronaviruses", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public/myth-busters", "https://www.hopkinsmedicine.org/coronavirus/index.html"], "imgs": ["https://www.snopes.com/tachyon/2020/03/not-from-hopkins.png"]}