{"title": "Did Trump Say He ‘Tested Very Positively’ for COVID-19, Meaning Negative?", "subtitle": "Is the president trying to confuse us?", "date": "22 May 2020", "claim": "U.S. President Donald Trump said he \"tested very positively\" for COVID-19, meaning his test results came back negative, and he did not have the coronavirus disease.", "rating": "Correct Attribution", "true_part": "", "false_part": "", "content": "In late May 2020, readers searched the Snopes.com website questioning the veracity of a statement attributed to U.S. President Donald Trump, as quoted in a widely shared tweet posted by Washington Post journalist Felicia Sommez:\n\nSommez’s tweet accurately captures Trump’s statement regarding his diagnostic test result amid the COVID-19 coronavirus pandemic. \nTrump made the remark on May 21, 2020, on the South Lawn of the White House, as he was about to depart on Marine One for Michigan, where he toured a Ford manufacturing facility. Trump was responding to a reporter who asked how long the president expected to take hydroxychloroquine, a drug that Trump has been promoting as a potential treatment for COVID-19 without medical evidence for its safety or efficacy.\nHere is a transcription of the exchange between the reporter and Trump, per WhiteHouse.gov:\nQ Sir, how long do you expect take hydroxychloroquine?\nTHE PRESIDENT: I think it’s another day. I had a two-week regimen of hydroxychloroquine. And I’ve taken it, I think, just about two weeks. I think it’s another day. And I’m still here. I’m still here. And I tested very positively in a — in another sense.\nSo, this morning —\nQ Negatively?\nTHE PRESIDENT: Yeah. I tested positively toward negative, right? So, no, I tested perfectly this morning, meaning — meaning I tested negative.\nQ Have you taken the antibody test yet?\nTHE PRESIDENT: But that’s a way of saying it: positively toward the negative.\nQ Have you taken the antibody test yet, sir?\nTHE PRESIDENT: No, I have not.\nBecause Trump did make the comment and it was reflected accurately by the tweet in question, we rate this claim “Correct Attribution.”", "links": ["https://twitter.com/feliciasonmez/status/1263514808109989890", "https://www.whitehouse.gov/briefings-statements/remarks-president-trump-marine-one-departure-92/", "https://www.cnbc.com/2020/05/21/trump-doesnt-wear-coronavirus-mask-to-ford-plant.html", "https://www.washingtonpost.com/world/2020/05/22/trump-is-not-only-leader-pushing-unproven-coronavirus-cures/"], "imgs": ["https://www.snopes.com/tachyon/2020/05/tweet-2.jpg"]}