{"title": "Was COVID-19 Discovered in the US and South Korea on the Same Day?", "subtitle": "These two countries took different approaches in the early days of the pandemic and saw vastly different results.", "date": "23 March 2020", "claim": "The first cases of COVID-19 were reported in the United States and South Korea on the same day.", "rating": "True", "true_part": "", "false_part": "", "content": "In March 2020, as the daily rate of new cases of the COVID-19 coronavirus disease was increasing in the United States and decreasing in South Korea, a message started to circulate on social media claiming that these two countries had seen their first confirmed cases of infection by the novel coronavirus on the same day:\n\nSouth Korea and the United States did indeed confirm their first cases of COVID-19 on the same day, Jan. 20, 2020. According to the World Health Organization (WHO), the first South Korean case of COVID-19 was detected in a 35-year-old woman who had been living in Wuhan, China:\nOn 20 January 2020, National IHR Focal Point (NFP) for Republic of Korea reported the first case of novel coronavirus in the Republic of Korea. The case is a 35-year-old female, Chinese national, residing in Wuhan, Hubei province in China.\nThat same day, a 35-year-old man who had recently returned to the United States from Wuhan, China, was also diagnosed with the disease. The New England Journal of Medicine reported:\nOn January 20, 2020, the CDC [Centers for Disease Control and Prevention] confirmed that the patient’s nasopharyngeal and oropharyngeal swabs tested positive for 2019-nCoV by real-time reverse-transcriptase–polymerase-chain-reaction (rRT-PCR) assay. In coordination with CDC subject-matter experts, state and local health officials, emergency medical services, and hospital leadership and staff, the patient was admitted to an airborne-isolation unit at Providence Regional Medical Center for clinical observation, with health care workers following CDC recommendations for contact, droplet, and airborne precautions with eye protection.\nThe CDC announced that it had confirmed the first U.S. case of COVID-19 in a press release the following day, and a CDC spokesperson told Snopes.com that the patient tested positive for the novel coronavirus on the evening of Jan. 20. The press release came the following morning to give health officials time to notify the patient and discuss the special circumstances of the case. \nWhile these countries both detected their first cases of COVID-19 on the same day, they took different approaches to treating the disease and have so far seen vastly different results. At the time of this writing on March 23, 2020, the number of cases in the U.S. had topped 35,000. South Korea had less than 9,000 cases and reported its lowest number of new cases since rates peaked at the end of February.\nOne possible explanation as to why South Korea was relatively successful in combating the disease, while the United States struggled to keep it contained during its initial weeks, may have to do with how each country reacted in the earliest days of the impending pandemic. In brief, South Korea’s first action to fight the spread of COVID-19 was to aggressively start testing people for the disease and quarantine those who tested positive. The United States’ first actions were aimed at restricting travel from China. \nA special report from Reuters noted that South Korean health officials gathered in late January 2020 and decided that the need for testing was urgent. South Korea’s CDC approved its first diagnostic test the following week, and by the end of February, drive-thru testing facilities that screened thousands of people a day were in operation. \nThe United States took a different approach. \nWhen the first patient was diagnosed with COVID-19 in the United States in January 2020, President Donald Trump announced a set of travel restrictions on Jan. 31, 2020, that prohibited travelers from arriving from China, the epicenter of the outbreak. The restrictions also required American citizens returning home from China to be screened at airports and monitored for 14 days after their arrival. \nWhile the Trump administration did take action to combat the spread of COVID-19 shortly after the first patient was diagnosed in the U.S., the country did not, as South Korea did, immediately ramp up diagnostic testing. According to Reuters, South Korea conducted nearly 300,000 tests within two months of diagnosing their first COVID-19 patient. By contrast, the U.S. only conducted about 60,000 tests in that same time period.\nReuters reported (on March 18):\nSouth Korea’s swift action stands in stark contrast to what has transpired in the United States. Seven weeks after the train station meeting, the Koreans have tested well over 290,000 people and identified over 8,000 infections. New cases are falling off: Ninety-three were reported Wednesday, down from a daily peak of 909 two weeks earlier.\nThe United States, whose first case was detected the same day as South Korea’s, is not even close to meeting demand for testing. About 60,000 tests have been run by public and private labs in a country of 330 million, federal officials said Tuesday.\nThe spread of COVID-19 will undoubtedly be studied in greater detail, but we may not know the specific reasons as to why the disease spread the way it did in different locations for some time. However, the fact remains that while the United States and South Korea both confirmed their first cases of COVID-19 on the same day (Jan. 20, 2020), but the United States struggled to slow the spread of the disease in the same time period that South Korea was largely successful at mitigating its spread. ", "links": ["https://www.cnbc.com/2020/03/19/coronavirus-live-updates.html", "https://www.sciencemag.org/news/2020/03/coronavirus-cases-have-dropped-sharply-south-korea-whats-secret-its-success", "https://twitter.com/Mikel_Jollett/status/1240417970666369024", "https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200121-sitrep-1-2019-ncov.pdf?sfvrsn=20a99c10_4", "https://www.nejm.org/doi/full/10.1056/NEJMoa2001191?fbclid=IwAR3S_N46-ZVzrFPawAM7cap_QnZCArDV11kM5SoucnEiqyFQB-O9wxFiin4", "https://www.cdc.gov/media/releases/2020/p0121-novel-coronavirus-travel-case.html", "https://www.snopes.com/uploads/2020/03/john-hopkins-us-cases-march-22.png", "https://www.bbc.com/news/world-asia-52001837", "https://www.reuters.com/article/us-health-coronavirus-testing-specialrep/special-report-how-korea-trounced-u-s-in-race-to-test-people-for-coronavirus-idUSKBN2153BW", "https://www.npr.org/sections/health-shots/2020/01/31/801686524/trump-declares-coronavirus-a-public-health-emergency-and-restricts-travel-from-c", "https://www.reuters.com/article/us-health-coronavirus-testing-specialrep/special-report-how-korea-trounced-u-s-in-race-to-test-people-for-coronavirus-idUSKBN2153BW"], "imgs": ["https://www.snopes.com/tachyon/2020/03/mike-jollett.jpeg"]}