{"title": "Did Dr. Fauci Say There Was ‘Nothing to Worry About’ in Regards to COVID-19?", "subtitle": "Accusations that Dr. Anthony Fauci said it was \"safe\" to go to the movies and gym in late February 2020 ignored key facts about the coronavirus outbreak at that time.", "date": "14 April 2020", "claim": "Dr. Anthony Fauci said there was \"nothing to worry about\" in late February 2020 in regards to COVID-19 and it was \"safe\" to do things like go to the movies and the gym.", "rating": "Mixture", "true_part": "During a Feb. 29, 2020, interview, Dr. Fauci said that at that time and under the circumstances pertaining to that date, Americans didn't need to change their behavior patterns.", "false_part": "However, Fauci did not say there was \"nothing to worry about,\" and although he stated that Americans did not yet need to change their behaviors, he noted that what was then classified as the COVID-19 outbreak could require that to change.", "content": "In early April 2020, the Trump administration was facing strong criticism for its response to the COVID-19 coronavirus disease pandemic. Against that backdrop, social media users shared posts critical of National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci, one of the leaders of the administration’s ongoing COVID-19 response. The posts accused Fauci of throwing U.S. President Donald Trump under the bus for a belated response to the growing public health crisis, while failing himself to adequately warn the American public of the looming disease threat.\nSocial media posts by Trump’s supporters highlighted an April 12, 2020, interview on CNN in which host Jake Tapper asked Fauci, “Do you think lives could have been saved if social distancing, physical distancing, stay-at-home measures had started third week of February, instead of mid-March?”\nTo that question, Fauci gave the answer that earned him the ire of Trump’s supporters:\nYou know, Jake, again, it’s the what would have, what could have. It’s — it’s very difficult to go back and say that. I mean, obviously, you could logically say, that if you had a process that was ongoing, and you started mitigation earlier, you could have saved lives. Obviously, no one is going to deny that.\nBut what goes into those kinds of decisions is — is complicated. But you’re right. I mean, obviously, if we had, right from the very beginning, shut everything down, it may have been a little bit different. But there was a lot of pushback about shutting things down back then.\nIn rebuttal to this perceived criticism of the Trump administration, social media users accused Fauci of himself minimizing the threat in a Feb. 29 television interview.\nOne such tweet, bearing the hashtag #FireFauci was retweeted by Trump on April 12, 2020, raising speculation that the president was preparing to fire the doctor.\n\nAnother tweet complained that Fauci had said it was “safe” to do things like go to the movies and the gym in early February and March but “dropped Trump in the grease on CNN,” or let the president take the blame.\nThese criticisms ignore the context of Fauci’s Feb. 29 commentary and the rapidly evolving nature of the COVID-19 situation.\nOn Feb. 29, Fauci gave an interview on the NBC morning talk show “Today,” during which he stated that at that moment in time, “the risk is still low, but this could change.”\n“I’ve said that many times even on this program,” Fauci stated in that interview. “You’ve got to watch out because although the risk is low now, you don’t need to change anything you’re doing. When you start to see community spread, this could change and force you to become much more attentive to doing things that would protect you from spread.”\nThe situation with COVID-19 in the United States was indeed drastically different on Feb. 29 than it was in mid-April.\nOn Feb. 29, news reports indicated there were 70 known cases in the U.S., and officials were reporting the first known death from the novel coronavirus on American soil. That day also saw the first few reports of “community spread,” or transmission of the disease from an unknown source.\nFauci did say on Feb. 29 that Americans did not need to change their routines for the time being, but he also noted that depending on how the COVID-19 outbreak played out, that could all change, and in the coming weeks, it did.\nSince that day, COVID-19 has been declared a pandemic, more than half a million cases have been reported in the United States, and the death toll has rapidly climbed past 20,000 with most of the American public under guidance to stay home in order to slow the spread of the virus.\nFauci later clarified that in the April 12 interview, he was responding to a “hypothetical” question about the administration’s response but noted that his wording choice was “poor” and that administration officials had in fact heeded his early recommendations about social distancing guidelines.\nFauci also noted that his comments in a CNN interview were interpreted by some to mean that the Trump administration gave medical experts “push back” that cost lives at the beginning of the outbreak. He acknowledged that his answer was not worded well and largely misconstrued. We therefore rate this claim “Mixture.”", "links": ["https://www.nytimes.com/2020/04/11/us/politics/coronavirus-trump-response.html", "http://transcripts.cnn.com/TRANSCRIPTS/2004/12/sotu.01.html", "https://archive.is/4IGWn", "https://archive.is/H1Gm8", "https://www.today.com/video/dr-fauci-on-coronavirus-fears-no-need-to-change-lifestyle-yet-79684677616", "https://abcnews.go.com/US/high-school-student-washington-latest-coronavirus-community-spread/story?id=69301655", "https://www.cdc.gov/media/releases/2020/s0229-COVID-19-first-death.html", "https://www.npr.org/sections/goatsandsoda/2020/03/11/814474930/coronavirus-covid-19-is-now-officially-a-pandemic-who-says", "https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/cases-in-us.html"], "imgs": ["https://www.snopes.com/tachyon/2020/04/tweet-1.jpg"]}