{"title": "Did Ohio Man Who Called COVID-19 a ‘Political Ploy’ Die from the Disease?", "subtitle": "John W. McDaniel of Ohio passed away at the age of 60 in April 2020.", "date": "22 April 2020", "claim": "An Ohio man died from complications related to the COVID-19 coronavirus disease weeks after he downplayed the virus on social media.", "rating": "True", "true_part": "", "false_part": "", "content": "In April 2020, a set of screenshots supposedly showing comments from a “John McDaniels,” in which he called COVID-19 a “political ploy” and social-distancing measures “bullshit,” started to circulate on social media. Along with the posts were articles claiming he died from complications of the coronavirus disease. \nHere’s a screenshot supposedly showing a post from McDaniel on March 15 and a snippet from his obituary a month later:\n\nMcDaniel truly died from complications related to COVID-19 in April 2020 after he downplayed the seriousness of the disease on social media. \nThe New York Daily News wrote: \nAn Ohio man has tragically died from COVID-19 after criticizing his state’s coronavirus lockdown.\nJohn W. McDaniel, 60, died Wednesday in Columbus, exactly one month after reportedly calling Gov. Mike DeWine’s stay-at-home order “madness.”\n“If what I’m hearing is true, that DeWine has ordered all bars and restaurants to be closed, I say bullshit! He doesn’t have the authority,” McDaniel reportedly wrote in a since-deleted social media post circulated widely on social media.\nAs screenshots of McDaniel’s posts went viral, many social media users took the opportunity to criticize McDaniel, saying he had received his comeuppance for calling the virus a political ploy. \nMcDaniel’s wife, Lisa, acknowledged that her husband had made some “early assumptions” about the virus on social media, but added that social media users were also making unfair assumptions about him. \nIn a statement posted to the Snyder Funeral Homes Facebook page that announced services for McDaniel would not be live-streamed due to concerns about unwanted, negative social media reactions, she explained that McDaniel, like many others, was initially not fully aware of the severity of the pandemic. However, she wrote that he ordered the employees at his company O&M to work from home on March 16 (the day after the above-displayed Facebook post). Furthermore, according to her Facebook message, he self-isolated as soon as he was made aware that he had been in contact with someone who tested positive for COVID-19.\nLastly, she wrote that if he were still alive, he would have abided by the state’s stay-at-home order and would have encouraged others to do the same. \nHere’s her statement from April 22, 2020 (emphasis ours):\nWords do not describe all of the emotions we, John W. McDaniel’s family, are experiencing right now. We are overwhelmed with grief for the loss of our believed husband, father, soon to be father-in-law, son, brother, uncle, and dear friend to many. Similar to thousands of people, we are suffering from an unexpected and untimely loss due to the effects of COVID-19, the likes of which we never could have imagined. During this time of mourning, John’s story, along with early assumptions that he stated on Twitter and Facebook have turned into national news. The news has opened the flood gates for people to share their own misguided anger and unfounded assumptions about a man they don’t know. Wanting to protect my family and John’s legacy, we have decided not to live stream his funeral services via Facebook today. We will be privately recording his services today and we will be sharing it directly with his family and friends. We have not come to this decision lightly and we hope everyone will honor and respect this decision.  \nAs each day passes, we all are learning more about this “invisible enemy.” We have all learned that the early actions taken by our National and State government were indeed the right action to take. Quarantine and social distancing have been effective in flattening the curve. John, President of O&M, ordered the company to work from home on March 16. In addition, it is important to note that John immediately self-isolated as soon as he learned he had been in contact with someone who had tested positive. Many, like John, made statements early on not fully aware of the severity of COVID-19; many have retracted their statements knowing now the effects of this pandemic. We know if John was still here with us he would acknowledge the national crisis we’re are in, abide by the stay-at-home order, and encourage family and friends to do the same. But sadly he is not with us and we will forever have to live and cope with how his life ended far too soon. Further, we will never be able to erase from our hears and minds the negative posts that have been made and shared about John this past week.\nTo all of our family and friends, my sons and I will never be able to appropriately say “thank you” for all the love and support you have given us throughout this entire process. From the bottom of our hearts we will forever be grateful for you and the special relationship we share.\nWhile some may cast aspersions on McDaniel for not treating COVID-19 with the seriousness it deserved in March 2020, it should be noted that misinformation has been rampant during this pandemic.\nWe’ve debunked scores of rumors over several months that have touted bad medical advice and promoted conspiracy theories. U.S. President Donald Trump, too, has been criticized for downplaying the seriousness of COVID-19 and has repeatedly called the news outlets outlets covering this pandemic “fake news.” On Feb. 28, just two weeks before McDaniel posted on social media that COVID-19 was a “political ploy,” Trump said during a rally that “Democrats are politicizing the coronavirus” as their “new hoax.” ", "links": ["https://www.snyderfuneralhomes.com/obituary/john-w-mcdaniel/?fbclid=IwAR2kLXtF0joyAF0zixQ5RFCTnMequIi98_n9-Y76HCfclY3FPe594viczug", "https://www.nydailynews.com/news/national/ny-ohio-man-dies-coronavirus-after-calling-it-political-ploy-20200421-7zqadxgxancendpzuqu5wc4lii-story.html", "https://www.snyderfuneralhomes.com/obituary/john-w-mcdaniel/?fbclid=IwAR2kLXtF0joyAF0zixQ5RFCTnMequIi98_n9-Y76HCfclY3FPe594viczug", "https://www.facebook.com/DenzerChapelSFH/photos/a.796930937080947/2843370599103627/?type=3&theater", "https://www.snopes.com/collections/new-coronavirus-collection/", "https://www.snopes.com/collections/coronavirus-collection-prevention-treatments/", "https://www.snopes.com/collections/coronavirus-conspiracy-theories/", "https://www.miamiherald.com/article241537166.html", "https://www.nbcnews.com/politics/donald-trump/trump-calls-coronavirus-democrats-new-hoax-n1145721"], "imgs": ["https://www.snopes.com/tachyon/2020/04/Copy-of-Copy-of-Untitled-1.jpg"]}