{"title": "Can You Get a Free Coronavirus Test by Donating Blood?", "subtitle": "It's not the case that all blood banks are performing coronavirus tests on donors.", "date": "13 March 2020", "claim": "Donating blood requires that you be administered a free test for the COVID-19, a disease caused by the coronavirus.", "rating": "False", "true_part": "", "false_part": "", "content": "In early March 2020, as the availability and cost of testing members of the public for the COVID-19 coronavirus disease sweeping the globe was a hot issue, a widely-shared tweet offered a supposed “loophole” for obtaining such testing for free. Just volunteer to donate blood, it asserted, and the agency taking your donation would have to test you for free:\n\nHowever, it’s not the case that all blood banks are performing coronavirus tests on donors — as news reports have noted, “blood donation centers do not have test kits on hand to check for the coronavirus.” \nMoreover, as the American Red Cross declared in a statement, conducting such tests on donors is unnecessary because “there is no data or evidence that COVID-19 can be transmitted by blood transfusion, and there have been no reported cases of transmissions for any respiratory virus, including this coronavirus, worldwide.”\nThe Associated Press likewise reported of the subject that:\n\nBlood banks said they do not test for the novel coronavirus as part of the donation process. […]\n“We do a whole range of testing on blood donations as required by the FDA, but screening or testing for coronavirus is not happening,” said Kate Fry, chief executive officer of America’s Blood Centers, a North American network of nonprofit blood centers. The network oversees more than 600 blood collection sites.\nDr. Pampee Young, chief medical officer of the American Red Cross, told the AP that screeners do not test for the coronavirus as part of the process.\n“The last thing we would want is for people who are not healthy coming just to try to get tested,” she said.\n\nHowever, organizations such as the American Red Cross do advise that people should not donate blood now if they know or suspect they have been exposed to the coronavirus:\n\n[T]he American Red Cross has implemented new blood donation deferrals out of an abundance of caution. We are now asking that individuals postpone their donation for 28 days following:\no Travel to China and its special administrative regions, Hong Kong and Macau, as well as Iran, Italy and South Korea.\no Diagnosis of COVID-19, contact with a person who has the virus, or is suspected to have it.\n\nThe American Red Cross does advise that, “Right now, eligible and healthy donors are strongly urged to make an appointment to prevent shortages.”", "links": ["https://www.winknews.com/2020/03/11/blood-donation-centers-are-not-testing-for-covid-19-but-still-need-donations/", "https://www.redcross.org/about-us/news-and-events/press-release/2020/red-cross-media-statement-on-2019-novel-coronavirus.html", "https://apnews.com/afs:Content:8655910030"], "imgs": ["https://www.snopes.com/tachyon/2020/03/MemeOverlay_Twitterpost1.png"]}