{"title": "Did ‘The Simpsons’ Predict the Coronavirus Outbreak?", "subtitle": "It might be time to raise our standards for \"predictions.\"", "date": "3 February 2020", "claim": "\"The Simpsons\" TV show predicted the 2020 new coronavirus outbreak in a 1993 episode.", "rating": "False", "true_part": "", "false_part": "", "content": "In January 2020, a rumor started circulating on social media that the long-running sitcom “The Simpsons” had “predicted” the outbreak of the new coronavirus:\n\nThe first three panels of this image going counter clock-wise (i.e., all but the bottom-right panel) are unaltered and originate with a 1993 episode (Season 4, Episode 21) entitled “Marge in Chains.” The episode shows the residents of Springfield dealing with an outbreak of “Osaka Flu,” which spreads after a factory worker coughs into a box.\nThose three panels can be seen in the video below:\nThe fourth panel in this graphic (bottom right) is doctored and actually comes from a different episode of “The Simpsons.” That panel, featuring Springfield reporter Kent Brockman, comes from the episode “The Fool Monty” (Season 22, Episode 6). The words “Corona Virus” were added on top of this image, which originally read “Apocalypse Meow.”\nHere’s the original image:\n\nWhile it’s true that a 1993 episode of “The Simpsons” focused on a viral outbreak, this is hardly a prediction. After all, the  world has seen a number of pandemics. The Spanish Flu, the Hong Kong Flu, and the Asian Flu are just a few historical examples. As is the case with most of these “prediction” claims, “The Simpsons” was commenting on past events, not predicting future ones. \nYou can read more articles about what “The Simpsons” didn’t predict here. ", "links": ["https://twitter.com/ashakiiii/status/1222903869639778304", "https://www.cdc.gov/flu/pandemic-resources/1918-pandemic-h1n1.html", "https://www.cdc.gov/flu/pandemic-resources/1968-pandemic.html", "https://www.cdc.gov/flu/pandemic-resources/1957-1958-pandemic.html", "https://www.snopes.com/collections/the-simpsons-didnt-predict-that/"], "imgs": ["https://www.snopes.com/tachyon/2020/02/simpsons-image.jpg", "https://www.snopes.com/tachyon/2020/02/House_Cat_Flu.png"]}