{"title": "Did Experts and Officials Warn in 2018 US Couldn’t Respond Effectively to a Pandemic?", "subtitle": "Such individuals have made repeated warnings about U.S. readiness in the event of a pandemic.", "date": "1 April 2020", "claim": "Experts and officials warned in 2018 that the U.S. government would be unable to respond effectively to a pandemic.", "rating": "True", "true_part": "", "false_part": "", "content": "In late March and early April 2020, social media users revisited a 2018 tweet posted by Bulletin of the Atomic Scientists Senior Fellow Stephen Schwartz, in which he paraphrased a Washington Post article that reported the Trump administration had disbanded the National Security Council’s pandemic response team.\nThe tweet, dated May 10, 2018, read, “When the next pandemic occurs (and make no mistake, it will) and the federal government is unable to respond in a coordinated and effective fashion to protect the lives of US citizens and others, this decision by John Bolton and Donald Trump will be why.”\n\nSome who shared the tweet amid the ongoing COVID-19 coronavirus pandemic in early 2020 pointed to the date of the tweet and noted its apparent prescience. But Schwartz followed up on March 15, 2020, by thanking the experts quoted in the article, who themselves raised the alarm that the actions of U.S. President Donald Trump and his administration regarding pandemic preparedness left the United States vulnerable:\n\nThe people tagged in Schwartz’ tweet are global health and development advocate Carolyn Reynolds; Jeremy Konyndyk, who led foreign disaster assistance for the U.S. Agency for International Development (USAID) under President Barack Obama; and Luciana Borio, former director for the National Security Council’s Medical and Biodefense Preparedness under Trump.\nThose three were quoted in the Post’s 2018 report in the following passage:\nThis week, the administration released a list of $15 billion in spending cuts it wants Congress to approve. Among the targets is $252 million in unused funds remaining from the 2014-2015 Ebola epidemic in West Africa that killed more than 11,000 people, far exceeding the combined total cases reported in about 20 previous outbreaks since the 1970s.\nThe White House proposal “is threatening to claw back funding whose precise purpose is to help the United States be able to respond quickly in the event of a crisis,” said Carolyn Reynolds, a vice president at PATH, a global health technology nonprofit.\nCollectively, warns Jeremy Konyndyk, who led foreign disaster assistance at the U.S. Agency for International Development during the Obama administration, “What this all adds up to is a potentially really concerning rollback of progress on U.S. health security preparedness.”\n“It seems to actively unlearn the lessons we learned through very hard experience over the last 15 years,” said Konyndyk, now a senior policy fellow at the Center for Global Development. “These moves make us materially less safe. It’s inexplicable.”\nThe day before news of [Senior Director for Global Health Security and Biodefense Timothy] Ziemer’s exit became public, one of the officials on his team, Luciana Borio, director of medical and biodefense preparedness at the NSC, spoke at a symposium at Emory University to mark the 100th anniversary of the 1918 influenza pandemic. That event killed an estimated 50 million to 100 million people worldwide.\n“The threat of pandemic flu is the number one health security concern,” she told the audience. “Are we ready to respond? I fear the answer is no.”", "links": ["https://twitter.com/AtomicAnalyst/status/994696175575068672", "https://thebulletin.org/biography/stephen-i-schwartz/", "https://www.washingtonpost.com/news/to-your-health/wp/2018/05/10/top-white-house-official-in-charge-of-pandemic-response-exits-abruptly/", "https://twitter.com/AtomicAnalyst/status/994696175575068672", "https://twitter.com/AtomicAnalyst/status/1239256643126333442", "https://www.washingtonpost.com/business/economy/trump-calls-on-congress-to-pull-back-15-billion-in-spending-including-on-childrens-health-insurance-program/2018/05/07/9427de18-5216-11e8-a551-5b648abe29ef_story.html", "https://www.washingtonpost.com/news/retropolis/wp/2018/01/27/the-flu-can-kill-tens-of-millions-of-people-in-1918-thats-exactly-what-it-did/"], "imgs": ["https://www.snopes.com/tachyon/2020/04/schwartz.jpg", "https://www.snopes.com/tachyon/2020/04/tweet.jpg"]}