{"title": "Has Italy Stopped Treating the Elderly in the COVID-19 Pandemic?", "subtitle": "A viral social media post claimed Italian doctors were not treating older patients with coronavirus due to \"socialized medicine.\"", "date": "16 March 2020", "claim": "Italy has stopped treating elderly coronavirus patients due to \"socialized medicine.\"", "rating": "Mixture", "true_part": "Italian health care workers who are overwhelmed with COVID-19 cases could be faced with decisions about allocating limited life-saving treatment to those with the most likelihood to live longest upon survival.", "false_part": "However, Italy hasn't abandoned elderly patients to die. Instead, Italian health care workers, when faced with more patients than available equipment and capacity to treat them, may possibly be forced to prioritize treatment of those with the highest likelihood of surviving long-term.", "content": "As the COVID-19 new coronavirus disease spread across the United States in early 2020, so did anxiety, as people looked to how the virus had affected Italy, already deep in the throes of the pandemic. A social media meme exacerbated the anxiety with the claim that Italian doctors had “decided NOT to treat the elderly,” and that that was the result of “socialized medicine.”\nAs of mid-March, Italy was the hardest-hit nation outside of Asia and had become the new epicenter for the global pandemic. As in China, where the virus was initially detected in the winter of 2019, the Italian health care system was overwhelmed by the disease. Amid fears that the United States could end up in a similar situation, a viral Facebook meme pointed the finger at Italy’s government-run health care system.The meme appears to represent both an exaggeration and distortion of news reports and events in Italy regarding the coronavirus. Readers also inquired about an article published by the British news publication The Telegraph, headlined, “Italians over 80 ‘will be left to die’ as country overwhelmed by coronavirus.” The article references a document drawn up by health officials in Turin, a city in Northern Italy hit hard by the virus, with guidelines for if and when “It becomes impossible to provide all patients with intensive care service.” In such a case, the document says, “It will be necessary to apply criteria for access to intensive treatment, which depends on the limited resources available.”\nThe Telegraph reported that the document “produced by the civil protection department of the Piedmont region, one of those hardest hit, says: ‘The criteria for access to intensive therapy in cases of emergency must include age of less than 80 or a score on the Charlson comorbidity Index [which indicates how many other medical conditions the patient has] of less than 5.'”\nThe guidelines were expected to affect the whole country and go into effect, according to the Telegraph, “‘If the situation becomes of such an exceptional nature as to make the therapeutic choices on the individual case dependent on the availability of resources, forcing [hospitals] to focus on those cases in which the cost/benefit ratio is more favorable for clinical treatment.'”\nIn other words, it is not true that Italy as a whole had “decided not to treat their elderly” for the coronavirus. What is true per news reports is that overwhelmed Italian health systems that have more patients than available equipment could face “catastrophe” triage decisions not seen since World War II. That has nothing to do the fact that Italy, like other European countries, has a public health care system, or what some people call “socialized medicine.” It is instead the result of the sheer volume of cases flooding the hospitals.\nAs of March 12, 2020, The New York Times reported that Italian officials had maintained that everyone who needed care was entitled to it. In a public statement on the matter, Italian Prime Minister Giuseppe Conte stated, “We live in a system in which we guarantee health and the right of everyone to be cured. It’s a foundation, a pillar, and I’d say a characteristic of our system of civilization. And thus we can’t allow ourselves to let our guard down.”\nThe Times also reported that Flavia Petrini, president of the Italian College of Anesthesia, Analgesia, Resuscitation and Intensive Care, had issued “catastrophe medicine” guidelines:\n“In a context of grave shortage of health resources,” the guidelines say, intensive care should be given to “patients with the best chance of success” and those with the “best hope of life” should be prioritized.\nThe guidelines also say that in “in the interests of maximizing benefits for the largest number,” limits could be put on intensive care units to reserve scarce resources to those who have, first, “greater likelihood of survival and secondly who have more potential years of life.”\n“No one is getting kicked out, but we’re offering criteria of priority,” Dr. Petrini said. “These choices are made in normal times, but what’s not normal is when you have to assist 600 people all at once.”\nGiulio Gallera, the Lombardy official leading the emergency response, said on Thursday that he hoped the guidelines never needed to be applied.\nIn sum, Italy did not announce it would abandon elderly patients with COVID-19 wholesale. Instead, health care workers in various circumstances and locales might be forced to ration treatment and make judgments based on who is expected to live longest, if treated. Chinese doctors have faced this situation, and some fear it may be in store for the U.S. health care system if the number of active coronavirus cases in the United States isn’t successfully controlled. We therefore rate this claim a “Mixture” of true and false.", "links": ["https://fortune.com/2020/02/21/coronavirus-cases-china-hospitals-turn-away-patients/", "https://www.telegraph.co.uk/news/2020/03/14/italians-80-will-left-die-country-overwhelmed-coronavirus/?li_source=LI&li_medium=liftignit", "https://www.nytimes.com/2020/03/12/world/europe/12italy-coronavirus-health-care.html", "http://www.governo.it/it/media/dichiarazioni-alla-stampa-del-presidente-conte/14274", "https://www.washingtonpost.com/health/2020/03/15/coronavirus-rationing-us/"], "imgs": ["https://www.snopes.com/tachyon/2020/03/meme.jpg"]}