{"title": "Were Ventilators Found ‘Stashed’ in a Warehouse in New York?", "subtitle": "Social media posts painted a misleading picture about the plan for distributing ventilators amid the coronavirus pandemic.", "date": "31 March 2020", "claim": "Democrats in New York stashed ventilators in a warehouse in an effort to make the COVID-19 pandemic worse.", "rating": "False", "true_part": "", "false_part": "", "content": "In late March 2020, Facebook users shared a misleading meme that suggested “Democrats” in New York, which had been hard hit by the COVID-19 coronavirus disease pandemic, were hiding ventilators in storage even as officials there begged the federal government to send them thousands in preparation for an onslaught of patients struck by the illness.\nCOVID-19 can lead to serious illness and hospitalization, and in the most severe cases, patients are left unable to breathe on their own. States with rising numbers of COVID-19 cases were scrambling to supply hospitals with enough ventilators to meet expected need.\nThe Facebook meme claimed that Democrats were purposely trying to make the pandemic worse by stashing ventilators in a warehouse instead of distributing them to hospitals, where they were needed.\nThe posts, in part, echoed a tweet from U.S. President Donald Trump that suggested New York wasn’t acting quickly enough to distribute ventilators delivered by the federal government:\n\nHowever, both the above-displayed Facebook meme and Trump’s tweet contained misleading information.\nVentilators were not “found” in a New York warehouse. Officials were storing them there so they can be sent out to hospitals as the need arose. The photograph used in the Facebook meme was taken by Gothamist photographer Scott Lynch on March 24, 2020. According to Lynch’s caption, it depicts 400 ventilators that were “set to be transported to hospitals.” Officials in New York had requested 30,000 ventilators for when cases were expected to peak in subsequent weeks. As of March 24, officials reported only having a fraction of that number.\nNew York Gov. Andrew Cuomo responded to Trump’s tweet during a March 27 interview on CNN by calling it “incorrect and grossly uninformed.” Cuomo said that while state officials had projected they would imminently need 30,000 at the peak of escalating hospitalizations, those ventilators were not needed yet. Cuomo stated:\n“That is incorrect and grossly uninformed. The point is, we have ventilators in a stockpile, and we didn’t send them to the hospitals yet. Of course we didn’t. That’s the whole point. The hospitals don’t need them yet. The hospitals aren’t at their apex. The hospitals have enough ventilators today. But the numbers (of hospitalizations from COVID-19) are going up. We’re planning for an apex, a high point in about 21 days. That’s when we need the 30,000 ventilators, not today. Right now we’re putting them in a stockpile. So the point is, well they’re in a stockpile, you must not need them. It’s just ignorant. Of course you don’t need them today. You need them when you hit the apex, which is 30,000 (patients needing ventilators). We’re not there yet.”\nBecause meme contains a false description of the photograph of ventilators about to be sent to hospitals in New York, and because it states, contrary to all evidence, that Democrats were “trying to extend the virus instead of stopping it,” we rate this claim “False.”", "links": ["https://archive.is/ZvQAs", "https://gothamist.com/news/coronavirus-updates-new-york-state-attack-rate-virus-italy", "https://gothamist.com/news/coronavirus-updates-new-york-state-attack-rate-virus-italy", "https://www.youtube.com/watch?v=UXDimuOshS8", "https://www.youtube.com/watch?v=UXDimuOshS8"], "imgs": ["https://www.snopes.com/tachyon/2020/03/tweet.jpg"]}