{"title": "Did a Chinese Intelligence Officer Reveal the ‘Truth About the Coronavirus Outbreak’?", "subtitle": "A piece of horror fiction was a little too believable for some readers.", "date": "20 February 2020", "claim": "A Chinese intelligence officer revealed that a new coronavirus was developed in a lab as a bioweapon.", "rating": "False", "true_part": "", "false_part": "", "content": "A 2020 outbreak of COVID-19, caused by a new coronavirus, stirred up plenty of fears, concerns, and conspiracy theories on the internet. One of the most prominent (and unfounded) theories alleged that coronavirus was created in a government lab as a bioweapon and then released on the people of China. There is no evidence to support this claim and several researchers have disputed this theory as illogical.\nStill, that hasn’t stopped the rumor from spreading. In February 2020 the website The UFO Spotlight On… published an article revealing the “truth” about the disease:\nI am a senior Chinese military intelligence officer and I know the truth about the “corona virus” outbreak. It is far worse than the media are telling you.\n[…]\nI have information that I believe could lead to the overthrow of my government. It is also relevant to billions of people outside of China, all of whom are now in existential peril.\n[…]\nBy now you will be familiar with the recent outbreak of 2019-nCoV, also known as NCP, or simply “coronavirus”. You will have heard that it originated in Wuhan, an industrial city in China, and that it came from an animal — most likely a bat or a pangolin — that was sold in a wild animal market. You will have been told that it is an influenza-like illness that can in severe cases cause pneumonia, respiratory failure and death.\nFinally, you may have heard that although the disease is highly infectious, it is dangerous only to the elderly or to those who have a compromised immune system. The official lethality rate is approximately 2% or so.\nAll of that is a bunch of lies concocted by the Chinese state with the tacit support of the U.S. deep state and its friends in the European Union, Russia and Australia, and spread by the docile media in all of those countries.\nThe article went on to claim that China, unhappy with massive protests erupting in Hong Kong, decided to make a biological agent that could make protesters more docile. This bioweapon, the article claims, proved to be more deadly than intended and resulted in the deaths of many people. China decided that the program was too dangerous (the author of the article writes “we wanted the population of Hong Kong to submit to us; we did not want to exterminate it”) and stopped using the bioweapon. But the United States, according to the article, realized the power of this weapon and wanted it for their own. A deal was set up for the U.S. to acquire the bioweapon, but before the exchange could happen a group of Chinese agents, the author included, rushed in to stop the deal. This resulted in a shootout, the article claims, which led the bioweapon to be accidentally released near Wuhan, China.\nIf that all sounds like a fantastical bit of fiction fit for a spy novel or a horror movie, that’s because it is. This story was originally published on r/NoSleep, a section of Reddit dedicated to scary fiction stories. The story on The UFO Spotlight On… did contain a link back to the original author. However, this link may have been hard for some readers to find as it was written in Chinese. \nPosts on r/NoSleep are designed to be realistic horror stories and the commentators often treat them as if they were real. In fact, that’s one of the sub’s rules:\nUsers are to act as though everything is true on r/nosleep and treat it as such in posts and comments.\nNo debunking, disbelief, or criticism (constructive or otherwise). If the formatting is off, report the post and mods will address it.\nDo not ask for proof or tl;dr’s.\nThis may create an immersive horror environment for fans of the genre, but it can also lead to confusion for anyone unfamiliar with the subreddit. And when one of these stories escapes the confines of its original platform, readers may mistakenly believe that they are reading a genuine report about a real-world incident. \nWe’ve previously been asked to debunk r/NoSleep stories about a town in Kansas that disappeared in the 1950s and zombie ants that infiltrated a package of tampons.", "links": ["http://archive.ph/TLdfy", "https://www.reddit.com/r/nosleep/comments/f2b07y/i_am_a_senior_chinese_military_intelligence/", "https://www.snopes.com/fact-check/the-disappearance-of-ashley-kansas/", "https://www.snopes.com/fact-check/recalled-tampons-zombie-ants/"], "imgs": []}