{"title": "Did CBS News Use a 2016 Ukraine Photo in COVID-19 Coverage?", "subtitle": "Unverified, random tweets are not regarded as reliable sources by real journalists.", "date": "26 May 2020", "claim": "CBS News tried to pass off a photograph taken in Ukraine in 2016 as a picture of a U.S. child afflicted with a coronavirus-related disease in 2020.", "rating": "False", "true_part": "", "false_part": "", "content": "On May 24, 2020, the notoriously unreliable Gateway Pundit website published an article claiming that a “CBS Evening News” report about a “mystery illness possibly tied to COVID-19” affecting children in the New York City area deceptively used a 2016 photograph showing a child from Ukraine suffering from a coxsackievirus infection:\n\nGateway Pundit’s claim was entirely wrong. The photograph that the site claimed was a 2016 picture depicting an infant in Ukraine suffering from a coxsackievirus infection had actually been posted online several years earlier, in a 2009 blog entry about the use of steroids in treating children with Kawasaki’s disease. That picture obviously wasn’t taken in 2016, and the blog post in which it appeared made no reference to Ukraine or coxsackievirus:\n\nMoreover, the CBS News report did not in any way make deceptive use of this image by wrongly presenting it as a picture of a child being treated in New York City in 2020, as Gateway Pundit falsely suggested. The report simply used the photograph as a visual example of what Kawasaki symptoms look like by briefly displaying it while the narrator mentioned that the unknown illness currently “putting otherwise healthy children in the hospital” in New York City during the COVID-19 pandemic “resembles Kawasaki disease”:\n \nIt appears that, with their usual disregard for journalistic standards, Gateway Pundit relied upon an unverified third-party tweet to issue a baseless accusation, without making any attempt whatsoever to verify the content of that tweet or the source(s) on which it was based.", "links": ["https://www.snopes.com/news/2018/02/17/gotnews-disreputable-sites-sued-naming-innocent-teen-charlottesville-killer/", "https://rationalwiki.org/wiki/The_Gateway_Pundit", "http://americanloons.blogspot.com/2013/10/769-jim-hoft.html", "http://archive.is/p3Qeu", "https://www.cbsnews.com/video/kids-hospitalized-with-mystery-illness-possibly-tied-to-covid-19/", "https://www.mayoclinic.org/coxsackievirus/expert-answers/faq-20058531", "http://www.isteroids.com/blog/children-with-kawasakis-disease-can-benefit-from-steroids/", "https://www.cdc.gov/kawasaki/index.html", "https://twitter.com/FrogsForFriends/status/1264014674602811392"], "imgs": []}