{"title": "Did President Trump Cut the CDC Budget?", "subtitle": "As the new coronavirus spread in February 2020, so did concerns about the United States' readiness to respond to the outbreak.", "date": "27 February 2020", "claim": "U.S. President Donald Trump cut funding for the Centers for Disease Control and Prevention (CDC).", "rating": "Mixture", "true_part": "The Trump administration's proposed 2021 budget includes cuts to the CDC's activities related to chronic disease.", "false_part": "Congress hasn't approved the budget, so CDC funding in 2021 remains unclear.", "content": "As fears spread about a new coronavirus outbreak growing into a pandemic, so did concerns about the readiness of the United States to deal with the virus.\nAmid a flurry of rumors and news reports, Snopes readers’ attention turned to statements made by Democratic presidential candidates seeking to unseat U.S. President Donald Trump in 2020. Sen. Elizabeth Warren, former U.S. Vice President Joe Biden, and former New York City Mayor Mike Bloomberg claimed that the Trump administration had under-prepared the country to deal with a pandemic, and that his budget cuts had hobbled federal health agencies on the front lines of fighting the coronavirus.\nAlthough it’s true that Trump’s fiscal year 2021 budget proposal does propose a funding cut to the Centers for Disease Control and Prevention (CDC), that budget has not been enacted.\nAs The Washington Post explains, those funding cuts target the CDC’s chronic disease activities:\nThe budget request would trim funding for the Centers for Disease Control and Prevention by almost 16 percent. HHS officials said they want the CDC to focus on its core mission of preventing and controlling infectious diseases and on other emerging public health issues, such as opioid abuse.\nOfficials propose to take the money that would normally go to fund individual disease prevention activities and funnel it into a single block grant to states. The budget says chronic diseases such as heart disease, stroke and diabetes have common risk factors, and thus consolidating funds “can help magnify the public health impact.”\nAlthough the budget reduces overall funding for global health, from $571 million to $532 million in 2021, officials carved out an extra $50 million for global health security, which are measures aimed at disease detection and emergencies. That bump comes at the expense of international HIV/AIDS programs, which is being cut by about $58 million.\nThis is not the first time Trump’s administration has proposed cuts to the CDC budget. However, such proposals do not always amount to funds lost. As The Associated Press reported on Feb. 26, 2020:\nTrump’s budgets have proposed cuts to public health, only to be overruled by Congress, where there’s strong bipartisan support for agencies such as the CDC and NIH. Instead, financing has increased.\nIndeed, the money that government disease detectives first tapped to fight the latest outbreak was a congressional fund created for health emergencies.\nSome public health experts say a bigger concern than White House budgets is the steady erosion of a CDC grant program for state and local public health emergency preparedness — the front lines in detecting and battling new disease. But that decline was set in motion by a congressional budget measure that predates Trump.\nIt is also true that in 2018 the Trump administration fired key officials connected to the U.S. pandemic response, and they were not replaced.\nAlso in 2018, news reports circulated about an 80% reduction in the CDC’s program that worked in various countries to fight epidemics. That was the result of the anticipated depletion of previously allotted funding. But those budget cuts ultimately didn’t happen, CDC told FactCheck.org, because Congress provided other funding. For fiscal year 2021, President Trump has requested that CDC funding for global disease detection and other programs be increased further — to $225 million total, with $175 million going directly to global health security.”\nThe fact that epidemic prevention-efforts were scaled back in China gained new significance in February 2020 as coronavirus spread globally after it was first detected in Wuhan, China, in late 2019.\nU.S. legislators in late February were discussing billions of dollars in funding for coronavirus response.", "links": ["https://www.washingtonpost.com/world/2020/02/27/coronavirus-live-updates/", "https://www.nytimes.com/2020/02/27/us/politics/coronavirus-democrats.html", "https://www.whitehouse.gov/wp-content/uploads/2020/02/msar_fy21.pdf", "https://www.washingtonpost.com/science/trump-budget-cuts-funding-for-health-science-environment-agencies/2020/02/10/9c8dd784-4c2d-11ea-b721-9f4cdc90bc1c_story.html", "https://apnews.com/d36d6c4de29f4d04beda3db00cb46104", "https://www.snopes.com/fact-check/trump-fire-pandemic-team/", "https://web.archive.org/web/20200206210123/https://www.washingtonpost.com/news/to-your-health/wp/2018/02/01/cdc-to-cut-by-80-percent-efforts-to-prevent-global-disease-outbreak/", "https://www.factcheck.org/2020/03/false-claim-about-cdcs-global-anti-pandemic-work/", "https://www.cdc.gov/budget/documents/fy2021/FY-2021-CDC-congressional-justification.pdf#page=270&zoom=auto,-452,803", "https://www.washingtonpost.com/business/2020/02/26/congress-coronavirus-response/"], "imgs": []}