{"title": "Will Gargling with Salt Water or Vinegar ‘Eliminate’ the COVID-19 Coronavirus?", "subtitle": "What works for colds is unlikely to help an already-infected person stave off the COVID-19 coronavirus disease.", "date": "14 March 2020", "claim": "Gargling with salt water or Vinegar 'eliminate' the COVID-19 coronavirus from the throat of an infected person's system.", "rating": "False", "true_part": "", "false_part": "", "content": "The COVID-19 coronavirus disease pandemic of early 2020 brought a raft of dubious and false medical advice about the prevention and treatment of the illness to the internet, among which was one widely circulated graphic advocating that persons exposed to the virus try gargling various substance to ‘eliminate’ the virus and prevent it from reaching the lungs via the throat: \n“Corona virus before it reaches the lungs it remains in the throat for four days and at this time the person begins to cough and have throat pains. If he drinks water a lot and gargling with warm water & salt or vinegar eliminates the virus. Spread this information because you can save someone with this information.”\n\nWhile gargling some combination of warm water, salt, and vinegar has long been used as a means of relieving symptoms related to colds and flus, such as sore throats, there’s no evidence that it can help ward off or drive out infections from the COVID-19 coronavirus disease.  And although the virus is said to replicate in the nose and nasal secretions, we’ve found nothing documenting the notion that the current coronavirus “remains in the throat for four days” and can be effectively expelled at the conclusion of that time period to keep it from reaching the lungs.  (The incubation period for this virus, which is the time between when a person is exposed to the virus and when they start showing symptoms, has been estimated at about five days on average.)\nThe World Health Organization’s (WHO) website offers a page offering COVID-19 coronavirus disease advice for the public which addresses the substance of this rumor in an item about rinsing nasal passages (which are connected to the throat) with saline:\n\nThere is no evidence that regularly rinsing the nose with saline has protected people from infection with the new coronavirus. \nThere is some limited evidence that regularly rinsing the nose with saline can help people recover more quickly from the common cold. However, regularly rinsing the nose has not been shown to prevent respiratory infections.\n\n\n\n\n", "links": ["https://www.medicinenet.com/sore_throat_home_remedies_and_treatment/article.htm", "https://www.ncbi.nlm.nih.gov/pubmed/32150748", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public/myth-busters"], "imgs": []}