{"title": "Did Uninsured Teen Die of COVID-19 After Being Denied Treatment?", "subtitle": "A story that went viral was later clarified with regard to key details.", "date": "3 April 2020", "claim": "An uninsured 17-year-old boy died of COVID-19 symptoms after being refused care due to a lack of medical insurance.", "rating": "Mixture", "true_part": "A 17-year-old boy in Lancaster, California, died on his way to a hospital while suffering from COVID-19 coronavirus disease symptoms.", "false_part": "Contrary to widespread reports, the boy did have health insurance and was not turned away from an urgent-care clinic.", "content": "In late March 2020, social media users shared an article published by the website Mic with a headline that read, “An uninsured 17-year-old died after being denied care for coronavirus symptoms.” The headline was widely seen and caused outrage and anxiety over health care access amid an ongoing pandemic with a rising death toll.\nCiting an article posted by the technology website Gizmodo, as well as comments from a local official, Mic reported, “The teen reportedly felt ill and sought treatment at an urgent care clinic, but was denied. The staff at the facility told the teen to try the emergency room at the local public hospital, Antelope Valley (AV) Hospital,” but the boy died while in transit to the hospital. The Antelope Valley is a community about 45 miles north of the city of Los Angeles.\nThe claim that the boy was denied medical care for COVID-19 symptoms due to a lack of health coverage originated with comments from Rex Parris, the mayor of the Antelope Valley city of Lancaster, in a video uploaded to the city’s YouTube page. In the video, Parris said the boy had gone to an urgent-care facility for an HMO (health maintenance organization). “He didn’t have insurance, so they did not treat him, and sent him to A.V. (Antelope Valley) Hospital.” The boy went into cardiac arrest on the way to the hospital, Parris said in the video.\nAfter the story went viral, however, Parris clarified his comments in a Facebook post. In that March 29, 2020, post, Parris referred to the boy only as “William” and noted he was the only person to die of the illness in the city as of that writing.\n“We have learned more information about William’s death,” Parris wrote. “His family did have health insurance. When the family called his HMO, they were (correctly) told to take him to the emergency room. There was some initial confusion, possibly from language difficulties about the status of health insurance, but the family always had insurance. His family did everything possible to protect William, but this disease is fast and deadly.”\nHe reiterated much the same in an April 2 interview with Time Magazine. We reached out to Parris by email and have not yet received a response.", "links": ["https://gizmodo.com/teen-who-died-of-covid-19-was-denied-treatment-because-1842520539?utm_campaign=socialflow_gizmodo_twitter&utm_source=gizmodo_twitter&utm_medium=socialflow", "https://www.youtube.com/watch?v=NkhnAF7E5xw&feature=youtu.be", "https://www.facebook.com/photo.php?fbid=2925741084135736&set=a.123691534340719&type=3&theater", "https://time.com/5813731/teen-denied-insurance-coronavirus/"], "imgs": []}