{"title": "Did an Orangutan Start Hand-Washing During COVID-19 Pandemic?", "subtitle": "Sandra the orangutan loves to wash her hands. We should all be more like Sandra.", "date": "1 April 2020", "claim": "Sandra the orangutan started washing her hands after she noticed zookeepers doing so during the COVID-19 pandemic.", "rating": "Miscaptioned", "true_part": "", "false_part": "", "content": "On April 1, 2020, a short video supposedly showing an orangutan named Sandra washing her hands circulated on social media along with the claim that the ape had learned the practice after watching zookeepers during the COVID-19 coronavirus disease pandemic:\nSandra the orangutang started washing her hands because she saw all the zookeepers doing it repeatedly during the COVID-19 crisis.\nWash your hands. Be more like Sandra.🌎❤️🧼🌎 pic.twitter.com/t8TTizDGeD\n— Rex Chapman🏇🏼 (@RexChapman) April 1, 2020\n\nThis is a real video of an orangutan washing various objects in a tub. However, this video was not taken during the 2020 pandemic. \nIt was taken on Nov. 12, 2019 (before COVID-19 was widely spread in the United States) at the Center for Great Apes in Wauchula, Florida.\nThe video was originally shared on the Center for Great Apes’ Facebook page along with the following caption:\nSandra has daily pools of water and really likes to wash things — her toys, her surroundings, and her hands! Sandra loves to clean up! #orangutancaringweek\n#cleanhands #bubblesarebest\nThe original video can be seen below:\n\nThe Center for Great Apes writes:\nSandra was born on February 14, 1986, at the Rostock Zoologischer Garten in Germany. She and a young male named Max were sent to Buenos Aires in 1994. Sandra lived with other orangutans in the early years there and then spent a short time at the Cordoba Zoo before returning to the Buenos Aires Zoo in 2008. Since 2008, Sandra has lived alone at the Buenos Aires Zoo until it closed and when she was moved to the U.S. in September 2019.\nIn November 2019, Sandra arrived at the Center for Great Apes where she will have the opportunity to meet other orangutans and have permanent sanctuary care.\nWhile Sandra the orangutan did not learn to wash her hands by copying zookeepers during the COVID-19 pandemic, the Center for Great Apes has used this viral video of Sandra to encourage people to follow the Centers for Disease Control and Prevention’s guidelines and wash their hands for at least 20 seconds:\nShe definitely scrubbed her hands for longer than 20 seconds, good job Sandra! :)#washyourhands #CoronavirusOubreak #coronapocolypse pic.twitter.com/LvULumPRe5\n— CenterForGreatApes (@CFGA) March 15, 2020\n", "links": ["https://t.co/t8TTizDGeD", "https://twitter.com/RexChapman/status/1245382719242145794?ref_src=twsrc%5Etfw", "https://www.facebook.com/CenterForGreatApes/", "https://www.centerforgreatapes.org/meet-apes/orangutans/sandra/", "https://twitter.com/hashtag/washyourhands?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/CoronavirusOubreak?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/coronapocolypse?src=hash&ref_src=twsrc%5Etfw", "https://t.co/LvULumPRe5", "https://twitter.com/CFGA/status/1239203755226214400?ref_src=twsrc%5Etfw"], "imgs": []}