{"title": "Will Lemons and Hot Water Cure or Prevent COVID-19?", "subtitle": "As cures go, these ones are lemons.", "date": "26 March 2020", "claim": "Drinking hot water with lemons will cure or prevent COVID-19; drinking hot water with lemons and sodium bicarbonate will “alkalize the immune system” and cure or prevent COVID-19.", "rating": "False", "true_part": "", "false_part": "", "content": "A significant amount of COVID-19 coronavirus disease misinformation spreading across social media or chat apps takes the form of copied-and-pasted “advice” posts attributed to anonymous “experts”. These posts are usually riddled with scientific errors and/or promises of cures. Here we look at two such “cure” posts that involve hot water and lemons.\nOne claim, attributed to a Chinese researcher, implores readers to “use as much natural vitamin C” as possible and suggests lemons as a good source. To that point, the post claims that regular consumption of a drink made from three lemon slices and hot water helps “against the spread of [COVID-19]” and “destroys the virus.” While vitamin C does play a role in several immune system functions, its use as a treatment to prevent or cure viral infections is unsupported by science.\nA second, slightly modified claim is attributed to “information” that “comes from Israel” and includes the addition of sodium bicarbonate to the hot lemon water cure. Unlike the previous assertion, which rests largely on claims about vitamin C, this cure allegedly works because it can “alkalize the immune system.” The ubiquity of this concoction in Israel, the post additionally claims, is why the country has seen no cases of the disease. This is false. “Alkalizing the immune system” is an illogical pseudoscientific concept, and at this time of this reporting, Israel had over 2,300 confirmed COVID-19 cases.\nThis dubious claim, which now circulates in text form on social media platforms, has its origins in a video shared extensively on Facebook messenger and created by the owner of the YouTube channel “MrHealthyChannel.” Even before any medical information is presented, several red flags are apparent. “Hi, I am Jiao Shenme Mingzi from China, Researcher at the School of Medicine Zanjan University,” the post begins. Zanjan University is in Iran, and, as PolitiFact noted, this person’s alleged name closely resembles the phonetic spelling of “jiao shenme mingzi,” which is not a name but a phrase used to ask for someone’s name.\nThe video and posts derived from transcripts of that video falsely assert that the reason we lack a medical cure for COVID-19, and therefore need a natural remedy that contains vitamin C, is a result of the novel coronavirus’ unexpected or rapid genetic mutation (an issue Snopes addressed here). In reality, this virus is dangerous because of its ability, like other infection-causing viruses, to sustain and replicate in human cells, particularly those of the upper respiratory system.\nThough early work had suggested vitamin C as a treatment for the common cold, which is also a viral upper respiratory infection, later work has cast doubt on that notion. In general, no scientific research has shown an ability for vitamin C supplementation to “kill” any upper-respiratory system virus or to reduce its spread. As summarized by the National Institutes of Health (NIH), “the evidence to date suggests that regular intakes of vitamin C at doses of at least 200 mg/per day do not reduce the incidence of the common cold in the general population.” For reference, that single lemon cut into three slices and served with hot water contains about 30 milligrams of vitamin c.\nThe NIH does suggest that “vitamin C supplements might shorten the duration of the common cold and ameliorate symptom severity” as well as provide some potential benefit to certain populations of people with compromised immune systems. As Dr. Caroline Apovian, a professor of medicine and pediatrics at the Boston University School of Medicine, explained to USA Today, “The only impact that vitamins and supplements may have in any cold or flu is to lessen the severity.”  As such, the assertion that a single lemon served with hot water will “kill the spread of this virus in our body” is unsupported by science.\nThis iteration of the lemon and hot water cure comes from a viral copy-pasted-and-reshared bit of text on Facebook that usually begins with the false statement that the information comes “from Israel where this virus did not cause any deaths.” As previously noted, Israel has in no way been immune to the coronavirus pandemic, nor are they, as the post also asserts, “relaxed about the virus.” On March 25, the Israeli government announced — like other governments around the world — measures to limit the movement of its citizens in order to slow the disease’s spread.\nThe alleged science here is just as straightforward to debunk. The ability to “alkalize” one’s body was a popular claim promoted by scientists in the 1920s and by supplement peddlers and health gurus today. But unless you suffer from certain specific and medically catastrophic conditions like metabolic acidosis, it is effectively impossible to alter, through diet, the pH of the cellular environment that makes up the various tissues of your body, including those of the immune system. The body maintains these environments in a tightly controlled range: a pH between 7.36 and 7.44 in arteries, and around 7.2 in intracellular spaces. The only pH value in your body that you would be altering with your diet is the pH of your urine. Such a modification would provide no medical benefit to the fight against a viral infection.\nLemon and hot water used as a vitamin C therapy will not “kill” or “slow the spread” of COVID-19, nor would it provide a clinically significant amount of vitamin C to begin with. A buffered solution of hot lemon juice and sodium bicarbonate, similarly, will do nothing to change the pH of either your body or your immune system. For these reasons both lemon-related “cures” are rated “False.”", "links": ["https://www.snopes.com/news/2020/03/05/uncle-coronavirus/", "https://www.snopes.com/fact-check/taiwan-experts-self-check/", "https://www.snopes.com/news/2020/03/23/coronavirus-bigger-seasonal-flu/?collection-id=242217", "https://lpi.oregonstate.edu/mic/vitamins/vitamin-C#role-in-immunity", "http://archive.vn/hLlo7", "https://www.politifact.com/factchecks/2020/mar/24/chain-message/facebook-messenger-video-falsely-claims-hot-lemon-/", "http://archive.vn/wip/TUnme", "https://www.politifact.com/factchecks/2020/mar/24/chain-message/facebook-messenger-video-falsely-claims-hot-lemon-/", "https://www.snopes.com/news/2020/03/23/coronavirus-bigger-seasonal-flu/", "https://ods.od.nih.gov/factsheets/VitaminC-HealthProfessional/", "https://fdc.nal.usda.gov/fdc-app.html#/food-details/167746/nutrients", "https://ods.od.nih.gov/factsheets/VitaminC-HealthProfessional/", "https://www.usatoday.com/story/news/factcheck/2020/03/24/coronavirus-fact-check-could-vitamin-c-cure-covid-19/2904303001/", "https://www.snopes.com/uploads/2020/03/screencapture-facebook-search-2020-03-26-09_44_31.png", "https://www.haaretz.com/israel-news/coronavirus-cases-in-israel-surge-past-1-000-palestinian-pm-orders-lockdown-in-west-1.8700788", "https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.18.1.15", "https://www.snopes.com/fact-check/everyone-who-has-cancer-has-a-ph-that-is-too-acidic/", "https://www.cambridge.org/core/journals/british-journal-of-nutrition/article/div-classtitlenutritional-disturbance-in-acidbase-balance-and-osteoporosis-a-hypothesis-that-disregards-the-essential-homeostatic-role-of-the-kidneydiv/3EAD569004A55B4AEAA0DAFC30AB5BE6/core-reader", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4670772/", "https://www.cambridge.org/core/journals/british-journal-of-nutrition/article/div-classtitlenutritional-disturbance-in-acidbase-balance-and-osteoporosis-a-hypothesis-that-disregards-the-essential-homeostatic-role-of-the-kidneydiv/3EAD569004A55B4AEAA0DAFC30AB5BE6/core-reader"], "imgs": []}