{"title": "Did the TV Show ‘My Secret Terrius’ Predict Coronavirus?", "subtitle": "COVID-19 is caused by a coronavirus, but not all coronaviruses cause COVID-19.", "date": "2 April 2020", "claim": "The television show \"My Secret Terrius\" predicted the 2020 COVID-19 outbreak.", "rating": "False", "true_part": "", "false_part": "", "content": "In March 2020, social media users started sharing clips from the 2018 South Korean television show “My Secret Terrius,” which supposedly showed characters using the word “coronavirus.” \nThis is crazy . If you are home , go on Netflix now ……. Type “My Secret Terrius” and go to season -1 and episode 10 and move straight to 53 minutes point ! (P.S. this season was made in 2018 and we are in 2020) . This is shocking 😡😡😡 was it a plan ?? pic.twitter.com/KqTZwA1IO2\n— Harbhajan Turbanator (@harbhajan_singh) March 26, 2020\n\nThis is a real scene from a 2018 show. But while many people may have only heard the word “coronavirus” for the first time in 2020, it has been around for decades.\nScientists first identified human coronaviruses in humans in the 1960s. Since then, we’ve seen a few coronavirus outbreaks, such as the MERS (Middle East respiratory syndrome) outbreak in 2012 and the SARS (severe acute respiratory syndrome) outbreak in 2002. In a longer version of this clip, the TV doctor explains how these diseases all come from the same group of viruses:\nIn the drama My Secret Terrius that was released in 2018 (UNIQ's sungjoo was among the cast) they talked in details about the corona virus…. I had goosebumps… pic.twitter.com/nuQ3UYZlMR\n— 아리🦄 (@eoeoes) March 18, 2020\n\nThe fictional coronavirus in the show is also rather different from the strain of coronavirus (COVID-19) that was spreading around the globe in early 2020. In the show, someone “tweaked” the virus in order to make it more deadly. In reality, that simply isn’t possible. COVID-19 is not a human-made bioweapon. (You can read about that conspiracy theory’s origins and scientific failings here.)\nThe coronavirus in the show also has a 90% mortality rate. While we still have a lot to learn about COVID-19, the disease does not have a 90% mortality rate. The case fatality rate differs from country to country and can be influenced by various factors, such as the availability of supplies at hospitals. In places like Italy, where the outbreak has been severe, the fatality rate has climbed as high as 11%. In places like South Korea, where outbreaks were mitigated with a massive testing program, the fatality rate has been just over 1%. \nWe should also note that some social media users shared clips of “My Secret Terrius” along with the claim that this was a “Chinese” show. While that may play into the human-made bioweapon conspiracy theory (again, that is a false rumor), this show actually comes from South Korea. \nIn short: A 2018 show South Korean show called “My Secret Terrius” does mention the word “coronavirus.” However, this term predates the show by several decades. Furthermore, the fictional virus does not share the same traits as the strain of coronavirus (COVID-19) that was spreading around the world in early 2020. \nIn other words, while COVID-19 is caused by a coronavirus, not all coronaviruses cause COVID-19. ", "links": ["https://t.co/KqTZwA1IO2", "https://twitter.com/harbhajan_singh/status/1243184302336012292?ref_src=twsrc%5Etfw", "https://www.cdc.gov/coronavirus/types.html", "https://www.cdc.gov/coronavirus/mers/index.html", "https://www.cdc.gov/sars/index.html", "https://t.co/nuQ3UYZlMR", "https://twitter.com/eoeoes/status/1240320792547786752?ref_src=twsrc%5Etfw", "https://www.snopes.com/news/2020/04/01/covid-19-bioweapon/", "https://www.bbc.com/future/article/20200401-coronavirus-why-death-and-mortality-rates-differ", "https://www.snopes.com/fact-check/covid-19-discovered-us-south-korea/"], "imgs": []}