{"title": "Was Charles Lieber Arrested for Selling the COVID-19 Coronavirus to China?", "subtitle": "The arrest of a Harvard professor fueled conspiracy theories about the COVID-19 coronavirus disease outbreak in 2020.", "date": "18 February 2020", "claim": "Harvard professor Charles Lieber was arrested for concealing funding from a Chinese lab connected to the origin of the new coronavirus.", "rating": "Mostly False", "true_part": "Professor Charles Lieber was arrested in January 2020 for misleading federal authorities about funds he allegedly received from Wuhan University of Technology (WUT) and his connections to a Chinese government-sponsored recruitment program.", "false_part": "Lieber's arrest had nothing to do with the novel coronavirus, nor was that virus \"developed\" or \"manufactured\" by anyone (in China or elsewhere).", "content": "On Jan. 28, 2020, Harvard professor Charles Lieber was arrested and charged with making a materially false statement to federal authorities about receiving funding from China.\nLieber’s arrest was big news in academic circles; but after internet users noticed that the alleged funding was coming from a university in Wuhan, China, the center of an outbreak of a new coronavirus, wild speculation went viral and unfounded connections were drawn between Lieber and a conspiracy theory that the coronavirus was a lab-made bioweapon. \n   \nA viral Facebook post took it further, relaying more details about Lieber’s arrest and making use of some conveniently placed scare quotes:\nIn case you missed it, today, Federal Agents arrested Dr. Charles Lieber, chair of Harvard University’s Department of Chemistry and Chemical Biology, with lying to the Department of Defense about secret monthly payments of $50,000.00 paid by China and receipt of millions more to help set up a chemical/biological “Research” laboratory in China. Also arrested were two Chinese “Students” working as research assistants, one of whom was actually a lieutenant in the Chinese Army, the other captured at Logan Airport as he tried to catch a flight to China – smuggling 21 vials of “Sensitive Biological Samples” according to the FBI.\nOh, almost forgot. The research lab the good professor had helped set up? It’s located at the Wuhan University of Technology. Wuhan China is ground zero to the potentially global pandemic known as the “Coronavirus”which is both spreading rapidly and killing people.\nThis is Stephen Coonts international spy novel stuff happening in real life – and it has barely made the news.\nThe claims made in this Facebook post are generally true. Lieber was truly arrested in January 2020 for lying to federal agents about funding he had allegedly received from China. However, Lieber’s arrest was not connected to the coronavirus and there’s no evidence to support claims that this disease was a human-made bioweapon.\nLet’s take a closer look and separate the facts from the rumors in this case.\nIn short: Lieber was arrested for lying to authorities about his involvement with a Chinese government program to recruit and cultivate scientific talent. \nLieber was the Chair of the Department of Chemistry and Chemical Biology at Harvard University and the Principal Investigator of the Lieber Research Group. Because this group had received grant funding from National Institutes of Health (NIH) and Department of Defense (DOD), Lieber was required to disclose any funding he received from foreign governments or entities that could lead to a conflict of interest. \nThe Department of Justice (DOJ) alleges in its complaint that Lieber became a “strategic scientist” at Wuhan University in 2011 and that he was a contractual participant in China’s Thousand Talents Plan, a government program aimed at recruiting and cultivating high-level scientific talent.\nThe DOJ says that Lieber was arrested for lying to investigators about his involvement in this program and his affiliations with WUT:\nChina’s Thousand Talents Plan is one of the most prominent Chinese Talent recruit plans that are designed to attract, recruit, and cultivate high-level scientific talent in furtherance of China’s scientific development, economic prosperity and national security. These talent programs seek to lure Chinese overseas talent and foreign experts to bring their knowledge and experience to China and reward individuals for stealing proprietary information. Under the terms of Lieber’s three-year Thousand Talents contract, WUT paid Lieber $50,000 USD per month, living expenses of up to 1,000,000 Chinese Yuan (approximately $158,000 USD at the time) and awarded him more than $1.5 million to establish a research lab at WUT. In return, Lieber was obligated to work for WUT “not less than nine months a year” by “declaring international cooperation projects, cultivating young teachers and Ph.D. students, organizing international conference[s], applying for patents and publishing articles in the name of” WUT.\nThe complaint alleges that in 2018 and 2019, Lieber lied about his involvement in the Thousand Talents Plan and affiliation with WUT. On or about, April 24, 2018, during an interview with investigators, Lieber stated that he was never asked to participate in the Thousand Talents Program, but he “wasn’t sure” how China categorized him. In November 2018, NIH inquired of Harvard whether Lieber had failed to disclose his then-suspected relationship with WUT and China’s Thousand Talents Plan. Lieber caused Harvard to falsely tell NIH that Lieber “had no formal association with WUT” after 2012, that “WUT continued to falsely exaggerate” his involvement with WUT in subsequent years, and that Lieber “is not and has never been a participant in” China’s Thousand Talents Plan.\nIn short: The DOJ announced three separate arrests in January 2020. The first was Lieber. The second involved Yanqing Ye, a lieutenant in the Chinese army accused of stealing U.S. research. And third was Zaosong Zheng, who stole 21 vials of biological research. While these three arrests all involve people lying about their ties to China, they took place at different universities and are not related. \nOn Jan. 28, 2020, the DOJ announced the arrests of three different individuals in three separate cases related to China. \nDr. Charles Lieber, 60, Chair of the Department of Chemistry and Chemical Biology at Harvard University, was arrested this morning and charged by criminal complaint with one count of making a materially false, fictitious and fraudulent statement. Lieber will appear this afternoon before Magistrate Judge Marianne B. Bowler in federal court in Boston, Massachusetts.\nYanqing Ye, 29, a Chinese national, was charged in an indictment today with one count each of visa fraud, making false statements, acting as an agent of a foreign government and conspiracy. Ye is currently in China.\nZaosong Zheng, 30, a Chinese national, was arrested on Dec. 10, 2019, at Boston’s Logan International Airport and charged by criminal complaint with attempting to smuggle 21 vials of biological research to China. On Jan. 21, 2020, Zheng was indicted on one count of smuggling goods from the United States and one count of making false, fictitious or fraudulent statements. He has been detained since Dec. 30, 2019.\nYanqinq Ye, a lieutenant of the People’s Liberation Army (PLA), the armed forces of the People’s Republic of China and member of the Chinese Communist Party (CCP), reportedly lied about being a “student” on her visa in order to attend Boston University. The DOJ alleges that Ye conducted research and assessed military websites while studying at BU’s Department of Physics, Chemistry and Biomedical Engineering and sent U.S. documents and information to China.\nZaosong Zheng was arrested at Logan Airport as he was attempting to smuggle 21 vials of biological research that he allegedly stole from Beth Israel Deaconess Medical Center in Boston. \nIn short: Cancer cells. \nAs news of Zheng’s arrest circulated on social media, some made the unfounded claim that these vials of “biological research” were somehow connected to the coronavirus. According to The New York Times, however, these vials contained cancer cells:\nInside his checked luggage, wrapped in a plastic bag and then inserted into a sock, the officers found what they were looking for: 21 vials of brown liquid — cancer cells — that the authorities say Mr. Zheng, 29, a cancer researcher, took from a laboratory at Beth Israel Deaconess Medical Center.\nWhile some conspiracy theorists assumed that Zheng’s plan involved a bio-weapon, Zheng told authorities that he planned on using the samples to further his career:\nUnder questioning, court documents say, Mr. Zheng acknowledged that he had stolen eight of the samples and had replicated 11 more based on a colleague’s research. When he returned to China, he said, he would take the samples to Sun Yat-sen Memorial Hospital and turbocharge his career by publishing the results in China, under his own name.\nIn short: There is no evidence that coronavirus was human-made and several leading researchers have debunked this notion. \nWhile this conspiracy theory has started to receive some mainstream attention (it was even pushed by Republican Sen. Tom Cotton), there is no evidence to support this claim. \nIn fact, several researchers have debunked this claim, calling it illogical and noting that the current evidence indicates that the coronavirus mutated naturally.\nTrevor Bedford of the Fred Hutchinson Cancer Research Center in Seattle stated at the American Association for the Advancement of Science meeting in Seattle that “There is no evidence whatsoever of genetic engineering that we can find. The evidence we have is that the mutations [in the virus] are completely consistent with natural evolution.”\nTwo more researchers gave statements to The Washington Post:\n“There’s absolutely nothing in the genome sequence of this virus that indicates the virus was engineered,” said Richard Ebright, a professor of chemical biology at Rutgers University. “The possibility this was a deliberately released bioweapon can be firmly excluded.”\nVipin Narang, an associate professor at the Massachusetts Institute of Technology, said it is “highly unlikely” the general population was exposed to a virus through an accident at a lab.\n“We don’t have any evidence for that,” said Narang, a political science professor with a background in chemical engineering.\n“It’s a skip in logic to say it’s a bioweapon that the Chinese developed and intentionally deployed, or even unintentionally deployed,” Narang said\nIn short: No. Lieber’s arrest (as well as the two other cases) was related to economic and academic espionage. There’s no indication that Lieber’s research, arrest, or connection to China was related to the spread of the coronavirus.\nLieber was arrested in January 2020 for allegedly working with a university in China to further the country’s recruitment and development of scientific talent. While Lieber was reportedly working with a lab in Wuhan, China (it should be noted that Lieber allegedly started working with the Wuhan University of Technology 9 years before there would be an outbreak of coronavirus in the area), there’s no evidence to suggest that this is anything more than a coincidence. \nLieber’s arrest, as well as the two other cases brought by the DOJ in January 2020, dealt with an academic battle between the U.S. and China. Lieber was allegedly working with a Chinese recruitment program, Ye was allegedly attempting to steal United States research and documents, and Zheng’s was attempting to steal biological samples.\nFBI Boston Division Special Agent in Charge Joseph R. Bonavolonta said in a statement that all three of these cases dealt with “economic espionage” and China’s attempts to steal trade secrets:\nChina’s goal, simply put, is to replace the United States as the world’s leading superpower, and they’re breaking the law to get there.\nMassachusetts is a target-rich environment with world-class academic institutions, research facilities, hospitals, cleared defense contractors, and start-ups. And each and every one of them are in danger of having their research, development, and investments stolen right out from under them.\nThe ruling Communist Party of the PRC wants what we have so they can get the upper hand on us.\nAnd while we are still confronted with traditional spies seeking our state secrets, often working under diplomatic cover, or posing as everyday citizens, I can tell you China is also using what we call “non-traditional collectors” such as professors, researchers, hackers and front companies.\nAll three individuals charged today are manifestations of the China threat …\nMake no mistake, the ruling Communist Party of the People’s Republic of China is highly strategic in their approach, and we are deeply concerned about American innovation, research, and cutting-edge technologies ending up in the wrong hands …\nEconomic espionage and the theft of trade secrets significantly hurts our academic institutions, businesses, jobs, and consumers, resulting in hundreds of billions of dollars in losses every year.\nWhile some may find these arrests to be suspect, the Department of Justice made no mention of coronavirus or biological warfare in their complaints.", "links": ["https://www.justice.gov/opa/pr/harvard-university-professor-and-two-chinese-nationals-charged-three-separate-china-related", "https://twitter.com/MrChrisGwynne/status/1227324554055487489", "https://twitter.com/Kit84138262/status/1226381440578916353", "https://twitter.com/WorldwebL/status/1226592104392142849", "https://twitter.com/aperiozar/status/1229783750042624000", "http://archive.ph/ljQZ8", "https://www.justice.gov/opa/pr/harvard-university-professor-and-two-chinese-nationals-charged-three-separate-china-related", "https://www.justice.gov/opa/pr/harvard-university-professor-and-two-chinese-nationals-charged-three-separate-china-related", "https://www.nytimes.com/2019/12/31/us/chinese-scientist-cancer-research-investigation.html", "https://www.washingtonpost.com/politics/2020/02/16/tom-cotton-coronavirus-conspiracy/", "https://www.ft.com/content/a6392ee6-4ec6-11ea-95a0-43d18ec715f5", "https://www.washingtonpost.com/politics/2020/02/16/tom-cotton-coronavirus-conspiracy/", "https://www.fbi.gov/contact-us/field-offices/boston/news/press-releases/remarks-delivered-by-fbi-boston-special-agent-in-charge-joseph-r-bonavolonta-announcing-charges-against-harvard-university-professor-and-two-chinese-nationals"], "imgs": ["https://www.snopes.com/tachyon/2020/02/Screenshot-2020-02-18-at-10.16.37-AM.png", "https://www.snopes.com/tachyon/2020/02/Screenshot-2020-02-18-at-10.16.18-AM.png", "https://www.snopes.com/tachyon/2020/02/Screenshot-2020-02-18-at-10.15.53-AM.png", "https://www.snopes.com/tachyon/2020/02/Screenshot-2020-02-18-at-10.15.34-AM.png"]}