{"title": "Will Warm Weather Kill Coronavirus?", "subtitle": "U.S. President Donald Trump said he hoped the virus would go away in April 2020 because the \"heat generally speaking kills this kind of virus.\"", "date": "3 March 2020", "claim": "Warmer weather will inhibit the spread of the new coronavirus.", "rating": "Unproven", "true_part": "Some viral strains, such as those that cause common cold and influenza, are less likely to spread during warmer seasons.", "false_part": "However, according to the World Health Organization, COVID-19 “can be transmitted in ALL AREAS, including areas with hot and humid weather.” This disease will not “go away” due to warmer weather.", "content": "On Feb. 10, 2020, U.S. President Donald Trump told the crowd at his rally in Manchester, New Hampshire, that the new coronavirus, which causes the disease COVID-19, could, in theory, miraculously go away in April when it gets a little warmer.\nTrump said: “The virus, they’re working hard, looks like by April you know in theory when it gets a little warmer it miraculously goes away. I hope that’s true.”\nTrump has repeated this claim a few times. On Twitter, for instance, he wrote that as “the weather heats up” the virus will hopefully become weaker. And during a meeting with various state governors in February, he said “a lot of people think that goes away in April with the heat — as the heat comes in. Typically, that will go away in April.”\nIt is simply too early to tell how warm weather will impact the spread of COVID-19. What we do know is that this strain of coronavirus can spread during warm weather, and that it won’t just “go away” in April.\nSome strains of coronavirus, such as those that cause the common cold or influenza, typically spread during cold weather and then subside as the weather heats up. Elizabeth McGraw, director of the Center for Infectious Disease Dynamics at Pennsylvania State University, explained to Time Magazine: “The droplets that carry viruses do not stay suspended in humid air as long, and the warmer temperatures lead to more rapid virus degradation.”\nAnother reason why some diseases flourish during colder months is because people spend a lot of time indoors and in crowded, poorly ventilated public places. As Auda Fares, a researcher at the University Hospital Bochum, Germany, put it: “Pathogens like crowded environments. With the onset of cooler weather, people spend most of their time indoors. Inadequate and poorly designed ventilation in crowded public places and urban transit systems may boost exposure to air-borne pathogens.”\nHowever, health experts do not know how the spread of COVID-19 will be impacted by warm weather. The World Health Organization (WHO) reported that all the evidence so far shows that COVID-19 “can be transmitted in ALL AREAS, including areas with hot and humid weather.”\nWHO writes:\nFrom the evidence so far, the COVID-19 virus can be transmitted in ALL AREAS, including areas with hot and humid weather. Regardless of climate, adopt protective measures if you live in, or travel to an area reporting COVID-19. The best way to protect yourself against COVID-19 is by frequently cleaning your hands. By doing this you eliminate viruses that may be on your hands and avoid infection that could occur by then touching your eyes, mouth, and nose.\nWHO also produced an infographic explaining that people should take precautionary measures (such as washing their hands) regardless of the current season or where they live:\n\nThe fact that cases of COVID-19 have been reported all around the globe also shows this disease can spread regardless of the temperature outside. Here’s a map from John Hopkin’s Center for Systems Science and Engineering (CSSE) showing “Countries and Territories with Confirmed Cases of Coronavirus” as of March 12, 2020:\n\nThis strain of coronavirus can spread during warm weather. However, it is possible that warm weather will help to slow the spread of this disease.\nThe Centers for Disease Control and Prevention (CDC) writes:\nIt is not yet known whether weather and temperature impact the spread of COVID-19. Some other viruses, like the common cold and flu, spread more during cold weather months but that does not mean it is impossible to become sick with these viruses during other months. At this time, it is not known whether the spread of COVID-19 will decrease when weather becomes warmer. There is much more to learn about the transmissibility, severity, and other features associated with COVID-19 and investigations are ongoing.\nMarc Lipsitch, an epidemiologist at Harvard University, said that while we may “expect modest declines in the contagiousness” of this disease during warmer, wetter weather, it will not completely stop the spread of the disease.\nLipsitch wrote:\nSeveral people, including the US president, have suggested that the novel coronavirus SARS-CoV-2 and the disease it causes, COVID-19, will go away on its own in the warmer weather that will come in the Northern Hemisphere in coming months. Some have even suggested that the experience with SARS in 2003 provides evidence for this assertion.\nThe short answer is that while we may expect modest declines in the contagiousness of SARS-CoV-2 in warmer, wetter weather and perhaps with the closing of schools in temperate regions of the Northern Hemisphere, it is not reasonable to expect these declines alone to slow transmission enough to make a big dent.\nTo sum up: There’s still a lot we don’t know about COVID-19. While it’s possible that the spread of this disease will be dampened by warm weather, it won’t simply go away due to a change of season. COVID-19 can spread in all climates and in various regions of the world, and people should take precautions regardless of the current temperature.", "links": ["https://twitter.com/realDonaldTrump/status/1225728756456808448", "https://www.whitehouse.gov/briefings-statements/remarks-president-trump-white-house-business-session-nations-governors/", "https://www.newsweek.com/trump-says-chinese-president-xi-told-him-coronavirus-will-killed-heat-april-1486571", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3604842/", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public/myth-busters", "https://coronavirus.jhu.edu/map.html", "https://www.cdc.gov/coronavirus/2019-ncov/faq.html", "https://ccdd.hsph.harvard.edu/will-covid-19-go-away-on-its-own-in-warmer-weather/"], "imgs": ["https://www.snopes.com/tachyon/2020/03/52.png", "https://www.snopes.com/tachyon/2020/03/ConfirmedCoronavirusCases031220_v02_BV_hpEmbed_16x9_992.jpg"]}