{"title": "Is Italy Calling for Bill Gates’ Arrest?", "subtitle": "While an Italian politician truly did call for Bill Gates to be arrested, this position has not been endorsed by the Italian government.", "date": "18 May 2020", "claim": "The government of Italy is calling for the arrest of Bill Gates.", "rating": "Mostly False", "true_part": "While giving a speech, a single Italian politician called for former Microsoft CEO Bill Gates to be arrested.", "false_part": "This position has not been endorsed by the Italian government as a whole.", "content": "In May 2020, a video started to circulate online that supposedly showed an Italian politician calling for the arrest of Bill Gates, the former Microsoft CEO who has been at the center of several conspiracy theories due to his foundation’s work to develop a vaccine for the COVID-19 coronavirus disease pandemic. This video was frequently shared on social media with the caption, “Italian Government call for arrest of Bill Gates”:\nThis is a genuine video of an Italian politician calling for Gates’ arrest. However, a single politician’s opinion does not equate to the entire Italian government calling for action. In fact, this view has been condemned by Italian government officials (you can hear this politician being told “enough” and to be quiet during the video).\nThe politician in this video is Italian Parliament Member Sara Cunial. She’s part of Italy’s “5 Star Movement,” a political party that has been blamed for a rise of measles in Italy after pushing an anti-vaccination agenda. Cunial, who was briefly suspended from the party in 2018 after likening vaccines to “free genocide” in a Facebook post, was fined in April 2020 for violating one of the country’s shelter-in place policies to visit a beach. (Cunial claims she was never fined.)\nCunial’s speech before the Italian Parliament hit on a number of popular (and discredited) conspiracy theories regarding COVID-19. For instance, she linked the spread of the disease to the rise of 5G technology, claimed that Gates was working to de-populate the world, and said that the “ID2020” coalition was working to secretly implement digital microchips via mandatory vaccines.\nCunial also fabricated a quote from Gates. After claiming that this was an “exact quote” from a Gates’ speech, Cunial falsely said that the former Microsoft CEO once stated, “If we do a good job on vaccines, health and reproduction, we can reduce the world population by 10-15%. Only a genocide can save the world.” Not only is this a fabricated quote, it illustrates a common misconception about Gates’ work related to global population.\nThe former Microsoft CEO is working to lower child mortality, improve the health of poorer populations, and give people better access to contraceptives. In other words, Gates is not trying to use vaccines to kill children. Rather, he is hoping that a lower child mortality rate and better supportive programs will reduce the need for parents to have more children. \nGates articulated his goals in a 2009 letter from the Bill & Melinda Gates Foundation:\nA surprising but critical fact we learned was that reducing the number of deaths actually reduces population growth. […] Contrary to the Malthusian view that population will grow to the limit of however many kids can be fed, in fact parents choose to have enough kids to give them a high chance that several will survive to support them as they grow old. As the number of kids who survive to adulthood goes up, parents can achieve this goal without having as many children.\nNot only was Cunial’s speech littered with conspiracy theories, the politician also blamed Italy’s leadership for allowing dogmatic scientism to become the “true cultural epidemic” of this country.  This comment created some blowback (Cunial curiously claimed that she was not referring to Italian Prime Minister Giuseppe Conte) and some politicians urged her to apologize for the remark.\nVice President of the Chamber of Deputies Mara Carfagna wrote on Twitter: “Connecting phantom plots to the Head of State is unworthy of an institutional representative.”\nSostenere teorie assurde e infondate a @Montecitorio è grave, soprattutto in una emergenza sanitaria.Collegare fantomatici complotti al Capo dello Stato è indegno di un rappresentante istituzionale.Il Presidente Mattarella è un solido presidio di libertà e democrazia.#Cunial\n— Mara Carfagna (@mara_carfagna) May 14, 2020\n\nIn sum, it is true that an Italian politician spouted a number of conspiracy theories and called for the arrest of Gates during an address to Parliament. However, this viewpoint was not widely endorsed by the Italian government.  ", "links": ["https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine", "https://www.nytimes.com/2017/05/02/opinion/vaccination-populism-politics-and-measles.html", "https://www.repubblica.it/politica/2020/04/14/news/coronavirus_la_deputata_no_vax_vaccinarmi_contro_il_covid-19_perche_dovrei_-253966487/", "https://www.repubblica.it/cronaca/2020/04/13/news/_vado_al_mare_sono_una_parlamentare_l_ex_grillina_no_vax_multata_sulla_strada_per_ostia-253937570/", "https://www.repubblica.it/politica/2020/04/14/news/coronavirus_la_deputata_no_vax_vaccinarmi_contro_il_covid-19_perche_dovrei_-253966487/", "https://www.snopes.com/news/2020/04/09/5g-conspiracy-theories-prosper-during-the-coronavirus-pandemic/", "https://www.snopes.com/fact-check/bill-gates-vaccinations-depopulation/", "https://www.snopes.com/fact-check/bill-gates-id2020/", "http://www.gatesfoundation.org/who-we-are/resources-and-media/annual-letters-list/annual-letter-2009", "https://twitter.com/Montecitorio?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Cunial?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/mara_carfagna/status/1260905772030087172?ref_src=twsrc%5Etfw"], "imgs": []}