{"title": "Did CDC Issue Strict Rules for Reopening Schools in Pandemic?", "subtitle": "A widely shared graphic paraphrased CDC recommendations that can be voluntarily adopted by schools during the COVID-19 pandemic.", "date": "22 May 2020", "claim": "The CDC issued a stringent set of rules that U.S. schools must follow before reopening amid the COVID-19 coronavirus pandemic.", "rating": "Mixture", "true_part": "The CDC published a set of guidelines that schools can adopt when feasible as they consider reopening amid the COVID-19 coronavirus pandemic.", "false_part": "The guidelines are not mandatory, and they are not meant to be uniformly applied to all schools nationwide. Schools are encouraged to abide by state and local health mandates and apply any recommendations that make sense to them to keep students and staff members safe.", "content": "In late May 2020, social media users circulated a graphic purportedly containing recommendations from the U.S. Centers for Disease Control and Prevention (CDC) for reopening schools amid the COVID-19 coronavirus pandemic. The graphic, containing a blue background and the words “Here we go,” went viral on Facebook. A slightly different version of the graphic was posted on the blog KidsActivities.com.\nThe stringent list prompted some anxiety, and readers asked Snopes.com to verify whether it was real. Below is a screenshot of it circulating on Facebook:\n\nAlthough the text on the graphic is drawn from CDC guidance for school re-openings that was issued on May 19, 2020, the CDC did not produce the graphic. The actual wording of the CDC guidance is couched a bit more gently and notes that the precautions should only be taken into consideration and implemented to the extent feasible for schools. In other words, the recommendations are not mandatory:\nAs some communities in the United States open K-12 schools, CDC offers the following considerations for ways in which schools can help protect students, teachers, administrators, and staff and slow the spread of COVID-19. Schools can determine, in collaboration with state and local health officials to the extent possible, whether and how to implement these considerations while adjusting to meet the unique needs and circumstances of the local community. Implementation should be guided by what is feasible, practical, acceptable, and tailored to the needs of each community. School-based health facilities may refer to CDC’s Guidance for U.S. Healthcare Facilities and may find it helpful to reference the Ten Ways Healthcare Systems Can Operate Effectively During the COVID-19 Pandemic. These considerations are meant to supplement — not replace — any state, local, territorial, or tribal health and safety laws, rules, and regulations with which schools must comply.\nBelow, we compare what the graphic states (we combined some of the similar bulleted items) and what the CDC guidelines say verbatim and in context:\nUnder the heading, “Promoting Behaviors that Reduce Spread,” the CDC notes that “Schools may consider implementing several strategies to encourage behaviors that reduce the spread of COVID-19.” Those behaviors include staying home when one feels sick or has had contact with someone diagnosed with COVID-19, washing hands regularly for at least 20 seconds, and using cloth face coverings, which are meant to protect others in the event that the wearer unknowingly has COVID-19. Under the bullet point “Cloth Face Coverings,” the CDC states:\nTeach and reinforce use of cloth face coverings. Face coverings may be challenging for students (especially younger students) to wear in all-day settings such as school. Face coverings should be worn by staff and students (particularly older students) as feasible, and are most essential in times when physical distancing is difficult. Individuals should be frequently reminded not to touch the face covering and to wash their hands frequently. Information should be provided to staff, students, and students’ families on proper use, removal, and washing of cloth face coverings.\nThe CDC directs that cloth face masks should not be placed on children under the age of 2, along with anyone who is incapacitated and can’t remove it without help or anyone who has trouble breathing.\nThe CDC states that school children should avoid sharing each other’s items:\nThe CDC recommends modified layouts in classrooms and spaced seating in school buses:\nThe CDC recommends partitions be installed along with tape markers to guide people to remain a safe distance apart:\nThe CDC recommends that communal spaces be closed if possible, or that use be staggered and the area be cleaned between use:\nThe CDC recommends that children bring their own food if feasible and, if not, that children be served individual, pre-packaged meals.\nThe CDC recommends pursuing virtual learning events in lieu of physical fields trips and limiting non-essential visitors to campuses:\nThe CDC recommends putting students and staff in “cohorts” and limiting them to small cohorts to the extent possible:\nThe CDC recommends policies that allow for staggered schedules or telework to allow for social distancing, but defers to state and local health care authorities:\nThe CDC recommends daily health screenings, i.e., temperature and symptom checks, “if feasible.”\nAlthough it’s true the CDC’s guidelines contain several pointers about personal hygiene and disinfecting common-use areas, none is a “rule.” As we noted above, the CDC’s guidance states that the recommendations can be implemented on a voluntary basis and only when feasible. They are not nationwide mandates for reopening schools. Overall, the CDC recommends school administrators to obey state and local authorities and assess their schools’ abilities to protect staff and children from contracting the disease, but these recommendations are not mandatory.\nBecause the bullet points in the graphic did accurately represent recommendations laid out by the CDC guidance issued on May 19, but led some to falsely believe they were mandatory and meant to be applied uniformly everywhere, we rate the veracity of this claim as “Mixture.”", "links": ["https://archive.is/vHCgz", "https://www.cdc.gov/coronavirus/2019-ncov/community/schools-childcare/schools.html", "https://www.cdc.gov/publichealthgateway/healthdirectories/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/us-healthcare-facilities.html", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/ways-operate-effectively.html", "https://www.cdc.gov/coronavirus/2019-ncov/community/schools-childcare/schools.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/diy-cloth-face-coverings.html", "https://www.cdc.gov/handwashing/when-how-handwashing.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/diy-cloth-face-coverings.html", "https://www.cdc.gov/coronavirus/2019-ncov/community/schools-childcare/Schools-Decision-Tree.pdf"], "imgs": ["https://www.snopes.com/tachyon/2020/05/cdc-1.jpg"]}