{"title": "Will Garlic Water Cure Coronavirus?", "subtitle": "On the plus side, this \"treatment\" might help keep away others who could potentially infect you.", "date": "10 March 2020", "claim": "Drinking boiled garlic water will cure COVID-19.", "rating": "False", "true_part": "", "false_part": "", "content": "In early 2020 the global spread of COVID-19, a disease caused by the new coronavirus, saw the internet flooded with dubious medical advice about how to avoid or cure the illness. One such example — supposedly originating with the medical sage known as “old Chinese doctor” — held that consuming a bowl of boiled garlic water would “improve and cure” persons afflicted with the malady overnight:\n\nGarlic has long been claimed as possessing qualities that aid in the prevention and treatment of various illnesses, including colds and flu, but scientific evidence supporting such claims is weak or lacking.\nThe World Health Organization (WHO) specifically addressed this rumor in reference to COVID-19 and noted that although “garlic is a healthy food that may have some antimicrobial properties,” there’s no evidence that “eating garlic has protected people from the new coronavirus”:\n\nBBC News similarly reported of this rumor that:\nIn lots of cases, these kinds of remedies aren’t harmful in themselves, as long as they aren’t preventing you from following evidence-based medical advice. But they have the potential to be.\nThe South China Morning Post reported a story of a woman who had to receive hospital treatment for a severely inflamed throat after consuming 1.5kg of raw garlic.\nWe know, in general, that eating fruit and vegetables and drinking water can be good for staying healthy. However, there is no evidence specific foods will help fight this particular virus.\nOn the plus side, this “treatment” might help keep away others who could potentially infect you.", "links": ["https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6465033/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4103721/", "https://www.who.int/images/default-source/health-topics/coronavirus/myth-busters/19.png", "https://www.bbc.com/news/world-51735367"], "imgs": ["https://www.snopes.com/tachyon/2020/03/MemeOverlay_square.png"]}