{"title": "Did Dolphins and Swans ‘Return’ to Italian Waterways Amid COVID-19 Lockdown?", "subtitle": "A few wildlife sightings were excitedly shared across social media as a note of sunny news amid the bleak reality of the coronavirus pandemic.", "date": "20 March 2020", "claim": "Amid a nationwide COVID-19 lockdown, Italians reported seeing wildlife such as swans and dolphins \"returning\" to newly tranquil waterways, ports, and canals.", "rating": "Mixture", "true_part": "Dolphins and swans were indeed spotted in some of Italy's waterways after the nationwide lockdown was imposed.", "false_part": "Dolphins and swans swimming in Italy's waterways were not necessarily new phenomena related to reduced human activity during the COVID-19 lockdown.", "content": "Outside of Asia, Italy has been hardest hit by the COVID-19 coronavirus disease pandemic. But in March 2020, as the country continued to deal with rising death tolls and a national lockdown, many found relief in posting images of wildlife on social media.\nPerhaps eager for good news, some shared the images and news stories with commentary saying the nationwide lockdown had resulted in unprecedented clear and tranquil waters in Italy, leading to a return of wildlife such as dolphins and swans to places like the now-uncrowded Venetian canals. Readers asked Snopes if this news was too good to be true. The answer is yes and no, as we will explain below.\nHere are some examples of social media posts:\n\nVenice hasn't seen clear canal water in a very long time. Dolphins showing up too. Nature just hit the reset button on us pic.twitter.com/RzqOq8ftCj\n— Gianluca De Santis (@b8taFPS) March 17, 2020\n\nThe dolphins shown in the video, it turns out, were not swimming in the iconic canals of Venice, but off the coast of Sardinia, an Italian island in the Mediterranean Sea. Dolphin sightings in that area are not a new phenomenon, as a 2017 video demonstrates.\nNational Geographic pointed out that the swan sightings were real, but not described accurately. “The swans in the viral posts regularly appear in the canals of Burano, a small island in the greater Venice metropolitan area, where the photos were taken,” National Geographic reported.\nFurthermore, although some social media users seemed to think the water seen in these images appeared more transparent because it was “cleaner” or due to reduced human activity, that wasn’t necessarily the case. As experts interviewed by ABC News pointed out, the water was clearer, though not necessarily cleaner, due to a lockdown-related reduction in boat traffic, which typically “kicks sediment to the surface” and makes it murkier.\nOn March 19, Italy’s death toll officially surpassed that of China, where the virus was initially detected. Sadly, as of this writing, 3,405 people in Italy have died from COVID-19, and the country’s hospitals in hard-hit regions are overwhelmed with patients.\nThe COVID-19 pandemic has sickened and killed thousands globally. Per the latest World Health Organization report, there are 191,127 confirmed cases worldwide and 7,807 deaths.", "links": ["https://www.cnbc.com/2020/03/19/italys-death-rate-reaches-record-high-hospitals-in-lombardy-struggle.html", "https://t.co/RzqOq8ftCj", "https://twitter.com/b8taFPS/status/1239863383354224641?ref_src=twsrc%5Etfw", "https://www.youtube.com/watch?v=q6mu5TbnktY", "https://www.nationalgeographic.com/animals/2020/03/coronavirus-pandemic-fake-animal-viral-social-media-posts/", "https://abcnews.go.com/International/venice-canals-clear-fish-coronavirus-halts-tourism-city/story?id=69662690", "https://www.washingtonpost.com/world/2020/03/19/coronavirus-latest-news/", "https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200318-sitrep-58-covid-19.pdf?sfvrsn=20876712_2"], "imgs": ["https://www.snopes.com/tachyon/2020/03/swans.jpg"]}