{"title": "Did Italy Confirm Almost 200 Coronavirus Deaths in 24 Hours?", "subtitle": "As of early March 2020, Italy had seen the worst COVID-19 outbreak outside Asia.", "date": "13 March 2020", "claim": "Almost 200 people in Italy died from the coronavirus in a 24-hour period between March 11 and 12, 2020.", "rating": "True", "true_part": "", "false_part": "", "content": "As the World Health Organization (WHO) declared the spread of COVID-19 a pandemic in early March 2020, alarmed readers asked Snopes to verify reports that nearly 200 people died in a 24-hour span in Italy as a result of the disease.\nSadly it is true that between March 10 and March 11, 2020, 196 people died in Italy, which was suffering the worst outbreak of COVID-19 outside Asia. Reuters reported on March 11 that, “The death toll from coronaviruses in Italy has risen from 196 to 827, an increase of 31%, Civil Protection [Agency] announced today.”\nThe death toll rose again the next day as an additional spate of deaths was reported. On March 12, The New York Times reported, “The death toll from an outbreak of coronavirus in Italy has jumped in the last 24 hours by 189 to 1,016, a rise of 23%, the Civil Protection Agency said.”\nOn March 13, 2020, Italy experienced its worst 24 hour period in terms of fatalities, reporting 250 deaths from the virus.\nItaly was struggling to keep pace with the disease, running low on hospital beds and equipment to treat the rapidly-spreading virus, which was first detected in Wuhan, China in late 2019.\nThe news of these fatalities came amid announcements in the United States that everything from basketball tournaments to Disneyland were shutting down in an effort to curb the spread of the virus.\nU.S. health officials estimate that COVID-19, a disease caused by the coronavirus, is roughly ten times more deadly than the seasonal flu.", "links": ["https://www.cdc.gov/coronavirus/2019-ncov/community/index.html", "https://www.nbcnews.com/health/health-news/live-blog/coronavirus-updates-live-u-s-cases-top-1-000-spread-n1155241/ncrd1155806#liveBlogHeader", "https://www.nytimes.com/2020/03/07/world/coronavirus-news.html", "https://it.reuters.com/article/topNews/idITKBN20Y2TX", "https://www.nytimes.com/reuters/2020/03/12/world/europe/12reuters-health-coronavirus-italy-tally.html", "https://www.reuters.com/article/us-health-coronavirus-italy-tally/italian-daily-coronavirus-deaths-jump-25-to-1266-idUSKBN2102SO?feedType=RSS&feedName=worldNews&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Reuters%2FworldNews+%28Reuters+World+News%29", "https://www.politico.eu/article/coronavirus-italy-doctors-tough-calls-survival/", "https://www.washingtonpost.com/sports/2020/03/12/ncaa-tournament-canceled-coronavirus/", "https://www.nytimes.com/2020/03/12/business/disneyland-coronavirus.html", "https://www.cnbc.com/2020/03/11/top-federal-health-official-says-coronavirus-outbreak-is-going-to-get-worse-in-the-us.html"], "imgs": []}