{"title": "Should COVID-19 Patients Avoid Taking Ibuprofen?", "subtitle": "French medical advice warned that \"adverse effects\" of drugs such as ibuprofen had been reported in coronavirus patients.", "date": "16 March 2020", "claim": "Patients should avoid taking ibuprofen to relieve pain and fever associated with COVID-19 infections.", "rating": "Unproven", "true_part": "", "false_part": "", "content": "Adding to the extant confusion swirling about the COVID-19 coronavirus disease pandemic in March 2020, the French government, including Health Minister Olivier Véran, issued warnings advising that infected persons should avoid taking nonsteroidal anti-inflammatory drugs (NSAIDs) such as ibuprofen:\n\nSerious adverse events related to the use of nonsteroidal anti-inflammatory drugs (NSAIDs) have been reported in patients with COVID19, possible or confirmed cases. We remind you that the treatment of a poorly tolerated fever or pain in the context of COVID19 or any other respiratory virosis is based on paracetamol, without exceeding the dose of 60 mg/kg/day and 3g/day. NSAIDs should be banned.\nCOVID-19 — Taking anti-inflammatory drugs (ibuprofen, cortisone, …) could be a factor in worsening the infection. If you have a fever, take paracetamol [also known as acetaminophen]. If you are already on anti-inflammatory drugs or in doubt, ask your doctor for advice.\nDr. Amir Khan, a National Health Service (NHS) doctor and a senior university lecturer in the U.K., offered the following explanation about why taking anti-inflammatory drugs might have a deleterious effect on persons dealing with a COVID-19 infection:\nDespite all of their beneficial effects, it has long been known that anti-inflammatories can have a depressive effect on parts of our immune systems.\nWhen it comes to taking them to help ease the symptoms of the common cold, we do not really have to worry about this slight but important reduction in the strength of our immune systems: We are very unlikely to develop complications from the common cold, let alone die from it.\nBut we need our immune system in top working order in order to battle the coronavirus and win.\nWhen the virus enters the human body, it induces mild to severe respiratory problems, a high fever, cough and, potentially, multi-organ dysfunction, which can lead to death.\nAn early part of our body’s immune response to a virus of this sort is to release cells called mast cells, which form our first line of defense against the virus.\nThese [mast cells] are released very quickly from our respiratory tract — the nasal passageway and linings of the lungs.\nWhen the mast cells come into contact with the virus, they then trigger a much bigger immune response, which involves inflammatory chemicals being released.\nWe need these inflammatory chemicals to help tackle the virus in the medium to long term. It is the effectiveness of these chemicals that decides whether a person develops complications from the coronavirus or makes a full recovery.\nIf we take medicines that dampen this immune response, such as ibuprofen, this can lead to us not fighting off the infection as effectively, potentially leading to a longer illness with a higher risk of complications.\nThese warnings to avoid ibuprofen (commonly known by the brand name Advil) generated mixed reactions among the medical community, with some asserting that scientific evidence to support it was lacking, and others maintaining that it was generally good advice:\n“Deeply concerned about this bold statement,” Muge Cevik, a researcher at the University of St Andrews Infection and Global Health Division, said on Twitter. “There’s no scientific evidence I am aware of that ibuprofen [causes worse] outcomes in #COVID19.”\nBut other experts suggested that Véran’s advice is in line with some countries’ general guidance on anti-inflammatory painkillers such as ibuprofen, even if their specific connection to the coronavirus is not clear.\n“There is a good reason to avoid ibuprofen as it may exacerbate acute kidney injury brought on by any severe illness, including severe COVID-19 disease. There isn’t yet any widely accepted additional reason to avoid it for COVID-19,” Rupert Beale, a group leader in Cell Biology of Infection at the UK’s Francis Crick Institute, told the UK’s Science Media Centre.\nExemplifying that split of opinion, Dr. Tom Wingfield, senior clinical lecturer and honorary consultant physician at the Liverpool School of Tropical Medicine, observed that it was unclear whether the proffered advice about ibuprofen was specific to COVID-19 or merely ordinary “good practice,” but that in any case paracetamol (acetaminophen) “would generally be preferred over ibuprofen to relieve symptoms caused by infection such as fever”:\nIn the UK, paracetamol would generally be preferred over non-steroidal anti-inflammatory drugs (“NSAIDS”) such as ibuprofen to relieve symptoms caused by infection such as fever. This is because, when taken according to the manufacturer’s and/or a health professional’s instructions in terms of timing and maximum dosage, it is less likely to cause side effects. Side effects associated with NSAIDs such as ibuprofen, especially if taken regularly for a prolonged period, are stomach irritation and stress on the kidneys, which can be more severe in people who already have stomach or kidney issues. It is not clear from the French Minister’s comments whether the advice given is generic ‘good practice’ guidance or specifically related to data emerging from cases of Covid-19 but this might become clear in due course. It should also be noted that, in the UK, we would not commonly use cortisone to relieve infection-related symptoms such as fever.\nAs Khan cautioned, for now patients and their doctors will need to be aware of the “careful balance between managing the symptoms of their long-term health condition and risking the devastating effects of the coronavirus.” He advised that paracetamol or acetaminophen may be preferable alternative medications for pain and fever associated with COVID-19.", "links": ["https://dgs-urgent.sante.gouv.fr/dgsurgent/inter/detailsMessageBuilder.do?id=30500&cmd=visualiserMessage", "https://www.aljazeera.com/indepth/features/doctor-note-ibuprofen-coronavirus-worse-200316045046677.html", "https://www.cnn.com/2020/03/16/health/coronavirus-ibuprofen-french-health-minister-scn-intl-scli/index.html", "https://www.sciencemediacentre.org/expert-reaction-to-reports-that-the-french-health-minister-recommended-use-of-paracetamol-for-fever-from-covid-19-rather-than-ibuprofen-or-cortisone/"], "imgs": ["https://www.snopes.com/tachyon/2020/03/Screenshot_2020-03-16-Should-Patients-with-COVID-19-Avoid-Taking-Ibuprofen-.png"]}