{"title": "Did Chinese Doctors Confirm African People Are Genetically Resistant to Coronavirus?", "subtitle": "Misinformation about the coronavirus outbreak seems to have traveled farther than the virus itself.", "date": "17 February 2020", "claim": "Chinese doctors confirmed that African people are \"genetically resistant\" to new coronavirus.", "rating": "False", "true_part": "", "false_part": "", "content": "In early 2020, an outbreak of new coronavirus in Wuhan, China, sparked fears that the virus could cause a pandemic. It also inspired a significant amount of misinformation.\nFor example, on Feb. 17, 2020, the website Cityscrollz.com falsely reported that a Cameroonian college student studying in China contracted coronavirus but recovered “because of his blood genetic composition which is mainly found in the genetic composition of subsaharan Africans.”\nIf such a claim, that people from African backgrounds are more resistant to coronavirus than others, were true, one would expect it to be a major news story. Instead, it’s being reported exclusively in viral social media posts and junk sites. That’s because it’s not true.\nAccording to the Centers for Disease Control and Prevention (CDC), anyone who comes into close contact with someone infected with the coronavirus is at risk for contracting it.\nThat said, it is true that Kem Senou Pavel Daryl, a 21-year-old Cameroon national studying in China, became ill after contracting coronavirus and was hospitalized. His recovery was not the result of a superior immune system possessed by people hailing from African countries but, according to news reports, rounds of antibiotics and other drugs.\nAs BBC News reported, Senou recovered after being placed in isolation for 13 days. “The CT scan showed no trace of the illness. He became the first African person known to be infected with the deadly coronavirus and the first to recover. His medical care was covered by the Chinese state.”\nAs of this writing, the coronavirus outbreak has killed 1,770 people in mainland China. Millions of people are currently quarantined in and around Wuhan in an effort to contain the virus. So far, more than 71,000 people have been sickened worldwide. In mid-February, Egypt announced it had the first-reported case in Africa.", "links": ["https://www.cdc.gov/coronavirus/2019-ncov/summary.html", "https://www.bbc.com/news/technology-51497800", "https://archive.is/sKtDE", "https://www.cdc.gov/coronavirus/2019-ncov/about/transmission.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2Fabout%2Ftransmission.html", "https://www.bbc.com/news/world-africa-51502711", "https://www.aljazeera.com/news/2020/02/cloneof200215224437270-200216231809757.html", "https://www.washingtonpost.com/business/on-small-business/wuhan-sharply-tightens-quarantines-on-residents-virus-update/2020/02/14/40dcefa8-4efb-11ea-967b-e074d302c7d4_story.html", "https://www.aljazeera.com/news/2020/02/egypt-confirms-coronavirus-case-africa-200214190840134.html"], "imgs": []}