{"title": "Is Coronavirus Spreading Faster Than SARS, Ebola, and Swine Flu?", "subtitle": "A video clip supposedly showing the exponential spread of a new coronavirus misled some viewers.", "date": "26 February 2020", "claim": "A video demonstrates there have been exponentially more cases of new coronavirus than other diseases such as SARS, MERS, Ebola, and swine flu.", "rating": "Mixture", "true_part": "The video documents that tens of thousands of cases of coronavirus were reported over a short period of time.", "false_part": "However, the video that went viral was not the full video but a clip. The longer version clearly shows that, although the coronavirus has spread quickly, it is nowhere near as widespread as previous epidemics such as swine flu or the Spanish flu.", "content": "In February 2020, as fears about the spread of a new coronavirus reached a fever pitch, a video clip circulated on social media supposedly showing how this disease was spreading farther and faster than previous epidemics.\nThe video, which has racked up nearly 2 million views, supposedly shows how diseases such as Ebola, SARS, MERS, swine flu and coronavirus spread over time. The graph starts on “Day 1” of the initial outbreak of each disease and then tracks how many reported cases and deaths each disease saw as time progressed: \nGraph shows the exponential and dangerous growth of corona virus compared to other major viruses such as Ebola and SARS.#Corona #CoronaVirus #CoronaOutbreak #ChinaVirus pic.twitter.com/QOco1JQDf5\n— Farhang F. Namdar (@FarhangNamdar) February 20, 2020\n\nWatching this video may give some viewers the impression that coronavirus was far more widespread than each of the aforementioned diseases. However, this tweet contains just a short clip from a video that was created by YouTube user Abacaba.\nIn the full video, just after the clip above ends, the graph changes dramatically as cases of swine flu skyrocket. By day 260, the coronavirus, SARS, MERS, and Ebola are dwarfed by the swine flu epidemic:\n\nThe video goes on to show how another epidemic, the Spanish flu of 1918, spread faster and to far more people than the coronavirus:\n\nThe viral clip above accurately shows how tens of thousands of cases of coronavirus were reported over a short time span. However, it seems to have given viewers the incorrect impression that the outbreak was unprecedented. \nHere’s the original video. The portion containing the above-displayed graph starts around 1:20:\nWe have not fact-checked every second of this 10-minute video. We can say, however, that it appears that the numbers reported in this viral graph are accurate. YouTube user Abacaba posted sources for all of the data shown in this graph and  we have verified the final numbers shown in this viral portion of the video. \nReports from the World Health Organization (WHO) and the Center for Disease Control and Prevention (CDC) confirm that there were approximately 8,000 cases of SARS, 28,000 cases of Ebola, 60 million cases of swine flu, and approximately 500 million cases resulting in 50 million deaths from the Spanish flu. The number of coronavirus cases reported in this video (approximately 40,000) was taken from an interactive guide created by the University of Washington. While that was likely accurate when this video was released on Feb. 12, as of this writing, the number of reported coronavirus cases has grown to more than 80,000.\nWhile the coronavirus is rightly causing concern around the globe, WHO has attempted to quell some of those fears. On a web page dedicated to information about the outbreak, WHO wrote on Feb. 23 that if you don’t live in, or have traveled recently to, an area where coronavirus is spreading, your chances of getting the disease are currently low:\nIf you are not in an area where COVID-19 is spreading, or if you have not travelled from one of those areas or have not been in close contact with someone who has and is feeling unwell, your chances of getting it are currently low. However, it’s understandable that you may feel stressed and anxious about the situation. It’s a good idea to get the facts to help you accurately determine your risks so that you can take reasonable precautions. Your healthcare provider, your national public health authority and your employer are all potential sources of accurate information on COVID-19 and whether it is in your area. It is important to be informed of the situation where you live and take appropriate measures to protect yourself. (See Protection measures for everyone).\nFind the latest information on coronavirus here.", "links": ["https://twitter.com/hashtag/Corona?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/CoronaVirus?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/CoronaOutbreak?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/ChinaVirus?src=hash&ref_src=twsrc%5Etfw", "https://t.co/QOco1JQDf5", "https://twitter.com/FarhangNamdar/status/1230554753182003203?ref_src=twsrc%5Etfw", "https://pastebin.com/R4N9m94g", "https://www.who.int/csr/sars/country/table2004_04_21/en/", "https://www.cdc.gov/vhf/ebola/history/2014-2016-outbreak/index.html", "https://www.cdc.gov/flu/pandemic-resources/2009-h1n1-pandemic.html", "https://www.cdc.gov/flu/pandemic-resources/1918-pandemic-h1n1.html", "https://www.cdc.gov/flu/pandemic-resources/1918-commemoration/pandemic-timeline-1918.htm", "https://www.washington.edu/news/2020/02/07/interactive-map-shows-worldwide-spread-of-coronavirus/", "https://www.cnn.com/2020/02/25/asia/novel-coronavirus-covid-19-update-intl-hnk/index.html", "https://www.who.int/news-room/q-a-detail/q-a-coronaviruses", "https://www.cdc.gov/coronavirus/2019-ncov/index.html"], "imgs": ["https://www.snopes.com/tachyon/2020/02/Screenshot-2020-02-26-at-3.53.54-PM.png", "https://www.snopes.com/tachyon/2020/02/coronavirus-graph.png"]}