{"title": "Did Trump Administration Fire the US Pandemic Response Team?", "subtitle": "As a new coronavirus spread in 2020, so did concerns about the United States' preparedness for a potential pandemic.", "date": "26 February 2020", "claim": "The Trump administration fired the U.S. pandemic response team in 2018 to cut costs.", "rating": "True", "true_part": "", "false_part": "", "content": "Amid warnings from public health officials that a 2020 outbreak of a new coronavirus could soon become a pandemic involving the U.S., alarmed readers asked Snopes to verify a rumor that U.S. President Donald Trump had “fired the entire pandemic response team two years ago and then didn’t replace them.”\nThe claim came from a series of tweets posted by Judd Legum, who runs Popular Information, a newsletter he describes as being about “politics and power.” Legum’s commentary was representative of sharp criticism from Democratic legislators (and some Republicans) that the Trump administration had ill-prepared the country for a pandemic even as one was looming on the horizon.\nLegum outlined a series of cost-cutting decisions made by the Trump administration in preceding years that had gutted the nation’s infectious disease defense infrastructure. The “pandemic response team” firing claim referred to news accounts from Spring 2018 reporting that White House officials tasked with directing a national response to a pandemic had been ousted.\nRear Adm. Timothy Ziemer abruptly departed from his post leading the global health security team on the National Security Council in May 2018 amid a reorganization of the council by then-National Security Advisor John Bolton, and Ziemer’s team was disbanded. Tom Bossert, whom the Washington Post reported “had called for a comprehensive biodefense strategy against pandemics and biological attacks,” had been fired one month prior.\nIt’s thus true that the Trump administration axed the executive branch team responsible for coordinating a response to a pandemic and did not replace it, eliminating Ziemer’s position and reassigning others, although Bolton was the executive at the top of the National Security Council chain of command at the time.\nLegum stated in a follow-up tweet that “Trump also cut funding for the CDC, forcing the CDC to cancel its efforts to help countries prevent infectious-disease threats from becoming epidemics in 39 of 49 countries in 2018. Among the countries abandoned? China.” That was partly true, according to 2018 news reports stating that funding for the CDC’s global disease outbreak prevention efforts had been reduced by 80%, including funding for the agency’s efforts in China.\nBut that was the result of the anticipated depletion of previously allotted funding, not a direct cut by the Trump administration. And as the CDC told FactCheck.org, the cuts were ultimately avoided because Congress provided other funding.\nOn Feb. 24, 2020, the Trump administration requested $2.5 billion to address the coronavirus outbreak, an outlay critics asserted might not have been necessary if the previous program cuts had not taken place. Fortune reported of the issue that:\nThe cuts could be especially problematic as COVID-19 continues to spread. Health officials are now warning the U.S. is unlikely to be spared, even though cases are minimal here so far.\n“It’s not so much of a question of if this will happen in this country any more but a question of when this will happen and how many people in this country will have severe illness,” Dr. Nancy Messonnier, the director of the National Center for Immunization and Respiratory Diseases, said during a press call [on Feb. 25].\nThe coronavirus was first detected in Wuhan, China, in the winter of 2019, and cases spread around the globe. The U.S. had 57 confirmed cases as of this writing, while globally, roughly 80,000 patients had been sickened with the virus and 3,000 had died. As of yet, no vaccine or pharmaceutical treatment for the new coronavirus. Data from China suggests the coronavirus has a higher fatality rate than the seasonal flu, although outcomes depend on factors such as the age and underlying health of the patient.\nReaders can find the latest coronavirus information from the CDC here.", "links": ["https://www.cnbc.com/2020/02/25/us-health-officials-say-coronavirus-will-likely-cause-a-global-pandemic.html", "https://twitter.com/JuddLegum/status/1232050502025781257", "https://www.politico.com/news/2020/02/25/trump-officials-defend-coronavirus-request-117329", "https://foreignpolicy.com/2020/01/31/coronavirus-china-trump-united-states-public-health-emergency-response/", "https://www.nbcnews.com/politics/politics-news/tom-bossert-trump-s-homeland-security-adviser-resign-n864321", "https://www.washingtonpost.com/news/to-your-health/wp/2018/05/10/top-white-house-official-in-charge-of-pandemic-response-exits-abruptly/", "https://www.nbcnews.com/politics/politics-news/tom-bossert-trump-s-homeland-security-adviser-resign-n864321", "https://twitter.com/JuddLegum/status/1232051346796371968", "https://web.archive.org/web/20200206210123/https://www.washingtonpost.com/news/to-your-health/wp/2018/02/01/cdc-to-cut-by-80-percent-efforts-to-prevent-global-disease-outbreak/", "https://web.archive.org/web/20200314145657/https://www.factcheck.org/2020/03/false-claim-about-cdcs-global-anti-pandemic-work/", "https://fortune.com/2020/02/26/coronavirus-covid-19-cdc-budget-cuts-us-trump/", "https://www.cdc.gov/coronavirus/2019-ncov/locations-confirmed-cases.html", "https://www.cdc.gov/coronavirus/2019-ncov/cases-in-us.html", "https://www.cbsnews.com/live-updates/coronavirus-outbreak-death-toll-infections-latest-news-updates-2020-02-25/", "https://www.nytimes.com/2020/02/25/health/coronavirus-us.html", "https://www.statnews.com/2020/02/25/new-data-from-china-buttress-fears-about-high-coronavirus-fatality-rate-who-expert-says/", "https://www.cdc.gov/coronavirus/2019-nCoV/index.html"], "imgs": []}