{"author": {"comment_karma": 4611, "created_utc": 1575664949.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_C18D42.png", "id": "565rhnjy", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 265, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_Unhappy-Satisfaction", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Unhappy-Satisfaction", "key_color": "", "name": "t5_29ut16", "is_default_banner": true, "url": "/user/Unhappy-Satisfaction/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Unhappy-Satisfaction"}, "body": "Yes and no; it has certainly mutated, however I haven't seen anything that has changed its structure in a way that would fundamentally alter the way it infects a person.  From last I read there were 8 different strains running around, and researchers are more or less able to track which strains are active, and their origin points from this.\n\nNow, what's going on with this isn't that it's morphed, but rather that it could *potentially* cause a rare form of blood vessel inflamation in children.  This is commonly referred to as Kawasaki-syndrome, which is a fairly rare syndrome that results from blood vessel infections causing inflammation, which can be dangerous and deadly. The reason why this link was being noticed recently is two fold:\n\n1.  In New York, 90% of those admitted with kawasaki-like syndrome in the past few months were or have been infected with COVID-19.  This is significantly higher infection rates than in the base population.\n\n2.  Italy has seen about three years worth of admittances for Kawasaki-like syndrome in the past three months. There were also some early reports out of China, if memory serves.\n\nThose together more or less give a pretty good indication that something related is going on.  Now, COVID-19 doesn't just infect the respiratory track. It has been shown to infect vital organs, and it's reasonable to assume it could potentially infect blood vessels as well. \n\nFurther, Kawasaki-like syndrome is almost entirely a children's disease, largely due to key differences in the immune system of adults and children. It may sound off, but your immune system attacks infections very differently than a 5-year-olds.  Which is why we have certain diseases that affect people differently at certain ages, and why Kawasaki-syndrome is practically unheard of in adults.\n\nSo, to run it down, if COVID-19 can infect blood vessels, it is almost a certainty that it will cause some number of Kawasaki-like cases with severe inflammation.\n\nThe *good* news, however, is that this still seems to be a particularly rare occurrence even with COVID-19, even if the disease can cause it to happen. New York only saw 85 cases during April, and I believe Italy only saw a couple hundred.  This rarity is also probably why it went under the radar - it's very hard to see an uptick in cases particularly quickly, because Kawasaki-syndrome is extremely rare to begin with, and is likely a rare complication from COVID-19.\n\nI would boil it down like this: It is something to be aware of if you have children, and certainly excercise some concern enough to know what to look for, but it's not something I would be worried too greatly about on a personal level simply because it seems to be a very rare reaction that is probably the exception.  It's certainly something to be aware of, as it can be deadly if untreated, but is quite treatable if caught early enough, and isn't likely a common occurrence among children. Like I said, there were only 85 cases in New York and a few hundred in the harder hit regions of Italy, and it's likely that some number were NON-COVID-19 caused.  Still, I would be aware of the symtpoms if I had children, just because it is something that can potentially happen, and is quite treatable.", "created_utc": 1590372717.0, "distinguished": null, "id": "frq8yql", "is_submitter": false, "link_id": "t3_gpv45x", "parent_id": "t1_frpl8j5", "score": 6, "stickied": false, "subreddit_id": "t5_2qh6p", "downs": 0, "total_awards_received": 0, "edited": 1590374597.0, "name": "t1_frq8yql", "collapsed": false, "permalink": "/r/Conservative/comments/gpv45x/they_did_it_again_cbs_caught_using_photo_from/frq8yql/"}