{"author": {"comment_karma": 2419, "created_utc": 1535753784.0, "has_verified_email": false, "icon_img": "https://styles.redditmedia.com/t5_nyos9/styles/profileIcon_vzwwyktwldd31.jpg?width=256&height=256&crop=256:256,smart&s=2f239462d6cdffa617a762d1a0d4a2d1110bd7c7", "id": "1y5zbvfn", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 334, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_clouud8", "header_img": null, "title": "♪ display name ♪ ", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_nyos9/styles/profileIcon_vzwwyktwldd31.jpg?width=256&height=256&crop=256:256,smart&s=2f239462d6cdffa617a762d1a0d4a2d1110bd7c7", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/clouud8", "key_color": "", "name": "t5_nyos9", "is_default_banner": true, "url": "/user/clouud8/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "clouud8"}, "body": "Edit: ...Aaaand less than a day after I wrote all this, [chloroquine got approved for emergency treatment by the FDA.](https://www.forbes.com/sites/rachelsandler/2020/03/30/fda-approves-anti-malarial-drugs-chloroquine-and-hydroxychloroquine-for-emergency-coronavirus-treatment/#7866b44f5e5d) Please disregard what is below.\n\nhttps://abcnews.go.com/Health/chloroquine-coronavirus-savior-wild-west-medicine/story?id=69828253\n\nThis story talks with Dr. Michael J. Ackerman, Mayo Clinic genetic cardiologist and director of the Windland Smith Rice Sudden Death Genomics Laboratory at the Mayo Clinic.\n\n*”[Dr. Ackerman] says he does believe [drugs, including chloroquine and hydroxychloroquine] may work, but emphasizes the need for “rational, careful, prudent guidance.””*\n\n*”Guidance is particularly paramount for chloroquine and hydroxychloroquine because of a known side effect: drug-induced arrhythmias from prolonged QTc intervals that can be detected by echocardiogram. In rare cases, your heart can stop and you can die.”*\n\nChloroquine have some data to support it being an effective drug, but there *are* major documented negative side effects. This is one of the reasons we need to test it thoroughly before putting it into circulation. Yes, it has been used for malaria. That doesn’t mean the body will respond the same way when it is used to treat COVID-19.\n\nHowever, it seems that this side effect is unlikely for most patients.\n\n*“The risk categories they developed put people into three groups, simplified as ‘green light’ for low risk, ‘yellow light’ for moderate risk, and ‘red light’ for high risk. Having a high risk for drug-induced arrhythmias doesn’t automatically mean you shouldn’t take chloroquine and hydroxychloroquine. But it does mean that your doctor should carefully weigh the risks versus the potential benefits.*\n\n*\"If we know their QTc, they are going to be ‘green light,’ go! There is going to be tremendous safety margin with these medications for 90% of the patients,\" said Ackerman.*\n\n*\"For 5 to 10%, they’re going to be in a caution light, a ‘yellow light’ because they are already showing that they’re kind of on the high edge of normal of the QTc even before we add these medications, and for 1% they’re going to already be at the ‘red light,’ be very, very careful. The risk-benefit balance better be there, and if we still think we should proceed, we better do what we would call our QT sudden cardiac death countermeasures preemptively,” he said.”*\n\n*“If these medications get approved for COVID-19, “we’re going to be seeing hundreds and hundreds of thousands of people, potentially millions being put on these medications. When you scale it up to that level, this unwanted side effect which happens to be a big deal is going to show itself, and it’s going to show itself in a significant way.” Ackerman said.*\n\nSo yes, maybe chloroquine *is* showing strong evidence to be a cure. That does not mean it should immediately be spread everywhere. We don’t want to cause more problems, or more deaths than would have happened otherwise. \n\nI do agree with you that there are Democrats rejecting it, simply because they dislike Trump. Many of them likely are not educated on the situation. This is bad.\n\n[President Trump does spread a lot of mistruth](https://www.politifact.com/factchecks/list/?speaker=donald-trump&ruling=false) though,  and Democrats hate him already, so you can see why many Democrats might be quick to dismiss ideas and facts presented by him without doing any research on them. \n\n**I am not saying that I agree with the way a lot of people are approaching this; rejecting ideas with little-to-no knowledge of the subject is never a good thing. **\n\nUltimately, I’d say these two things in closing:\n\nFirst, *we should probably leave the doctoring to the doctors.* It is always good to educate ourselves on the facts of the situation, especially considering the spread of misinformation from every side, but I don’t think that I, along with most other reddit users, really understand this pandemic and the medicine involved. In fact, I’d say **no one** actually understands it; there is always more information coming out. \n\nOf course we should still be free to have our own opinions on it, but we should be careful with criticizing people who know more than us. (This is not directed at you btw, just a general statement.)\n\nSecond, there *are* really good reasons why drugs need to get FDA approval. Drugs that aren’t FDA approved are not necessarily bad or don’t work; they just haven’t been definitively shown to have a positive effect. Yet. **‘It’s not approved by the FDA yet, so we shouldn’t put it into widespread use’** is a valid statement. **’It’s not approved by the FDA yet so it doesn’t work’** is not.\n\nThank you for reading my essay\n\nOne more note: I’m not in the medical field, so take this with a grain of salt. If you do have more correct information, or I have made a mistake, please feel free to correct me where I’m wrong and I’ll be happy to make edits.", "created_utc": 1585533320.0, "distinguished": null, "id": "flvvulq", "is_submitter": false, "link_id": "t3_fr8i87", "parent_id": "t1_fluvghs", "score": 5, "stickied": false, "subreddit_id": "t5_2qh6p", "downs": 0, "total_awards_received": 0, "edited": 1585605958.0, "name": "t1_flvvulq", "collapsed": false, "permalink": "/r/Conservative/comments/fr8i87/dr_vladimir_zelenko_has_now_treated_699/flvvulq/"}