{"author": {"comment_karma": 2930, "created_utc": 1412021935.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_EA0027.png", "id": "imo91", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 10815, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#EA0027", "user_is_muted": null, "display_name": "u_ClarityofSignal", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_EA0027.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ClarityofSignal", "key_color": "", "name": "t5_1p0byb", "is_default_banner": true, "url": "/user/ClarityofSignal/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ClarityofSignal"}, "body": "Time to open your eyes folks. The Freemasons, the Illuminati, the Royal Families, The Rothschild's, The WHO (World Health Organization) are all linked and behind the current global madness. It is an Elite run system where secret rituals are conducted. This leaked ritual reveals that they run China, they run the Far East, Prince Philip of the Royal Family is their Grand Master. Trump and Pence and Pelosi and Schumer and so many of the folks the politically divided slaves believe in are all Freemasons. When you watch their CFR media orchestrated divide and conquer puppet show they are needing you on one side or the other to produce that which is coming down the middle......their New World Order.\n\nWake up and see this reality that stares you in the face. Wake of to their 5G agenda, their mandatory vaccination and microchipping agenda, their wars and support for terrorists, their psyops and mass media propaganda saturation. You have been asleep but now it is time to open your eyes. Watch the video and see how they have subjugated the world, taken over countries, stolen resources, starved and killed millions of people, conducted rituals that serve their sinister interests. They are not benevolent. They never were. They are whats wrong with the world. Their WHO (Rothschild's) virus is their greatest global weapon. They are using it against humanity so that they may rule over humanity for centuries to come.\n\nWHO Is Behind This Global Elitist Show We Are Watching Now? Watch And Learn\n\nLARGEST FREEMASON ROYAL RITUAL HELD BY LONDON'S GRAND LODGE ON OCTOBER 31, 2017\n\nhttps://www.bitchute.com/video/XOqZCEgdmJG9/\n\nLook into who established the Council on Foreign Relation (CFR) that provides the media talking points. It was Zionist German banker and Rothschild agent Paul Warburg who also established the Federal Reserve System. Are you aware he was also the CEO of the US branch of IG Farben (I.G. Chemical)? Are you aware the Rothschild's established the World Health Organization (WHO)? Are you aware that the Rothschild's established Israel and paid for all their government buildings? Are you aware of what it is all for? Who bailed out Trump's failing casinos and real estate holdings in the 1990's? It was Rothschild banker agent Wilbur Ross (now US Sec of Commerce). The conspiracy researchers critical thinking has led to these connections being exposed. The time to wake up to these facts is now. Do your research and realize that the ruling global elite do not have your best interests at heart. They are heartless.\n\nRealize they are few and we are many, many, many, many, many, many......on and on. They control you through their media system.\n\nTurn it off. Spend time with your families. Hug your kids. Love each other.\n\nTake the time they have you under lockdown to realize you are human.", "created_utc": 1585599113.0, "distinguished": null, "id": "flyblrr", "is_submitter": false, "link_id": "t3_frtycw", "parent_id": "t1_flxmcg9", "score": 2, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_flyblrr", "collapsed": false, "permalink": "/r/conspiracy/comments/frtycw/update_dr_zelenko_has_now_treated_699_coronavirus/flyblrr/"}