{"author": {"comment_karma": 18944, "created_utc": 1330983724.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_46A508.png", "id": "73i36", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 588, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46A508", "user_is_muted": null, "display_name": "u_I_am_just_saying", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_46A508.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/I_am_just_saying", "key_color": "", "name": "t5_dikg9", "is_default_banner": true, "url": "/user/I_am_just_saying/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "I_am_just_saying"}, "body": "> I think the mortality rate is for people who have sought treatment. It doesnt make much sense to try and account for people who are not showing symptoms or seeking treatment because they often are not included in other diseases either.\n\n\nCDC doesnt say that in [their guidelines for calculating mortality rate](https://www.cdc.gov/csels/dsepd/ss1978/lesson3/section3.html) \n\nAnd that isnt what is presented by the official [National Center for Biotechnology Information](https://www.ncbi.nlm.nih.gov/pubmed/25738736) on how influenza mortality rate is calculated... \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4349859/figure/pone.0118369.g001/\n\nhttps://www.cdc.gov/flu/about/burden/how-cdc-estimates.htm#References\n\nBoth sources outline that they take the number of hospitalizations, back-adjust those known numbers by using data from the 2010 Behavioral Risk Factor Surveillance Survey (which asked people whether they did or did not seek medical care for an influenza-like illness in the prior influenza season). Using that data they can determine how many illnesses there are for every confirmed hospitalization, which was measured previously. And arrive at an estimate of total infections across the total population. This works because there is ample historical data that can be referenced. More accurately they are using infected fatality rates. \n\nTo be scientifically correct about it and clarify the terms... \n\nhttps://www.cebm.net/covid-19/global-covid-19-case-fatality-rates/\n\nCFR is Case Fatality rate, this is the number of confirmed treated/hospitalized to deaths; This is useful for doctors, but not for specific new diseases. CFR varies wildly depending on available technologies and treatments as well as the ability to identify the disease close to germination, it reflects the severity of the disease in a particular context, at a particular time, in a particular population.[ For example, initially China CFR was reported at 17%+ while now its reported below .7%](https://ourworldindata.org/uploads/2020/03/Covid-CFR-in-China-over-time.png)... CFR is also heavily bias by testing availability. This does not translate to the number of people in a population that will die or be at risk from a pandemic. This method does not give you an accurate projection of future cases nor where you are on the curve for the disease. In short, this will tell a doctor and patient the likelihood of survival should they find themselves in the hospital needing treatment for COVID19 right now. \n\n\nMortality rate; This is the population that dies divided by the population total. This is the likelihood that a member of the population will die. Or more simply put, the percentage of people that will die in a given population. This is very crude and subject to being very sensitive to infection penetration or natural immunity. If a disease has near 100% penetration in a population Mortality rate will be close to the IFR.\n\nIFR is infected fatality rate, this estimates the fatality rate in all those with infection, this includes those not tested due to asymptomatic cases. This is an estimation of the likelihood of survival if you get the disease, whether you know you have come in contact with it or not.  This is what you want when projecting current cases across a population when attempting to determine future deaths or hospitalizations. \n\nThey all measure and tell you different things. \n\nI get that people, news, and media have imprecise language but there is no way that \"mortality rate is 2%\" when the reported CFR is 1.7% right now. The CFR is always going to be the highest rate because its only measuring the worst cases and the \"actual mortality rate\" that is relevant to a risk assessment to a population that is currently experiencing the disease (IFR) will be magnitudes lower.", "created_utc": 1585546314.0, "distinguished": null, "id": "flwct2u", "is_submitter": false, "link_id": "t3_fr8i87", "parent_id": "t1_flvl2yj", "score": 1, "stickied": false, "subreddit_id": "t5_2qh6p", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_flwct2u", "collapsed": false, "permalink": "/r/Conservative/comments/fr8i87/dr_vladimir_zelenko_has_now_treated_699/flwct2u/"}