{"author": {"comment_karma": 32170, "created_utc": 1480353813.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_FF8717.png", "id": "135ka5", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 8092, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF8717", "user_is_muted": null, "display_name": "u_OneInfinith", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_FF8717.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/OneInfinith", "key_color": "", "name": "t5_c4vko", "is_default_banner": true, "url": "/user/OneInfinith/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "OneInfinith"}, "body": "I appreciated this read and your take, which was very much my attitude as I grew up very anti-gun. Through college and even a 9-year stint in the Army. I don't intend to change your mind here. A thought on my mind was always just like yours 'if guns just went away'.  \nI began to think about what that would really take, pragmatically in the context of the US today. This is what I mean when I use the term 'Pandora's Box' to describe firearms in the US. Having people voluntarily turn in their firearms will certainly not work - only those people who don't wish to use them will turn in - or just turn in older and broken ones.  \n\"Mandatory buy-backs\" - how can a government 'buy-back' something they never owned. [Senator Sanders](https://townhall.com/tipsheet/juliorosas/2019/11/11/bernie-sanders-mandatory-buybacks-of-firearms-is-unconstitutional-n2556267) agrees with this sentiment.  \nThen there is simple confiscation - authorizing armed police to go and take guns from each person they suspect of having guns - I'm sure how you can see that this could escalate to violence. And there's still the problem of those people just 'losing the gun in a boating accident' - there will always be a black-market - the War on Drugs shows us that.  \nIn terms of value to society of automobile vs. gun. Overall, I'd say I agree with you. A vehicle has a primary function - to transport. There may be flashy versions of this with bigger engines, cool paint jobs or attached front-loaders for construction - but in the end, the base function is the same. A gun has a primary function - to kill. There may be flashy versions of this with larger ammo capacity, cool paint jobs or attached sights to use for target shooting - but in the end, the base function is the same. But modern history has shown that armed populaces absolutely have the ability and will to stop much larger forces (Vietnam, Afghanistan)  from achieving all of their goals efficiently or at all. It is this inevitability that is very real - especially with the current occupant of the Executive branch.\n\nI'll even toss this in, as you say, many Americans use a vehicle everyday - [accounting for roughly a fifth](https://www.ucsusa.org/resources/car-emissions-global-warming) of all greenhouse emissions. This too contributes to global deaths. I'm sure there is a non-zero amount of greenhouse emission in the production/transport of firearms and ammo as well - I can't find info on it - but would hazard a guess it would be markedly less than autos. There is a plan for this, to gradually phase out to electric (though as we know, those have a carbon impact as well, but on the longer time-line it is generally smoothed out). \n\nGetting blue down-ballot would mean republicans aren't in control, and those necessary research dollars and licensing requirements (for both safety and proper use) could be implemented. I am always open to new ideas about how to implement it so that 'guns just went away' that would be effective to couch all these concerns?", "created_utc": 1587159955.0, "distinguished": null, "id": "fnq8xgn", "is_submitter": false, "link_id": "t3_g2luoj", "parent_id": "t1_fnq0qxp", "score": 1, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnq8xgn", "collapsed": false, "permalink": "/r/politics/comments/g2luoj/over_43000_us_millionaires_will_get_stimulus/fnq8xgn/"}