{"author": {"comment_karma": 69924, "created_utc": 1422871372.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_4856A3.png", "id": "l3pa4", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 2731, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#4856A3", "user_is_muted": null, "display_name": "u_Llohr", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_4856A3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Llohr", "key_color": "", "name": "t5_dt4sq", "is_default_banner": true, "url": "/user/Llohr/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Llohr"}, "body": "OK, so 'it' is a wealth-division system, exported by Russia. That, at least, makes sense.\n\nIt isn't supported by the article you linked, however, given that the article very specifically refers to the UK's comparable problem as home-grown, and unrelated to Surkov.\n\nIt also compares the tactics used to those of Surkov, but not the \"wealth division system\" itself. The tactics merely prevent wide-scale protestation of the system.\n\nHowever, I am inclined agree with you on this rather than the article, if not in all specifics.\n\nThe \"troll-farm\" tactics—which frequently took this form—began their interference in US politics, to the best of my knowledge, in 2014, which is a minor caveat. The UK also got their own dose in the form of pro-Brexit trolls, about which I am less informed.\n\nThe \"firehose of falsehood\" tactic has also really only gained traction since 2014.\n\nThat said, denialism, historical negationism, and historical revisionism all naturally lead to this point, so it's entirely possible that many \"came by it honestly,\" so to speak, rather than being directly or indirectly instructed by Surkov/Russia.\n\nWhen it comes to wealth-division, the tactics employed by Russia since the fall of the Soviet Union have a major recognizable form: the packaging up and selling off of government assets developed by the citizenry to a handful of wealthy, connected oligarchs.\n\nThe US has, at least on the Republican side, been utilizing that same tactic for many decades, just not with nearly as much success (if it can be called success, given the end result for the nation as a whole). Take the massive liquidation of public lands for example, of which recent cases abound. Or the \"Postal Accountability and Enhancement Act\" of 2006, which was a fairly successful attempt to force the Postal Service into insolvency. Privatization, which is essentially \"Oligarchy-lite\" or \"progress toward oligarchy\", has been going on since at least the '70s.\n\nI doubt we disagree on any major points, but I am beginning to think I am due for a more in-depth study of the problem, in order to more accurately identify connections and origins. One could even argue that Russia's transition to Oligarchy was inspired by the US, merely bastardized and accelerated.", "created_utc": 1587136965.0, "distinguished": null, "id": "fnp0bff", "is_submitter": false, "link_id": "t3_g2luoj", "parent_id": "t1_fnovg6l", "score": 1, "stickied": false, "subreddit_id": "t5_2cneq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnp0bff", "collapsed": false, "permalink": "/r/politics/comments/g2luoj/over_43000_us_millionaires_will_get_stimulus/fnp0bff/"}