{"author": {"comment_karma": 6532, "created_utc": 1460124463.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_C18D42.png", "id": "wzjop", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 11299, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_isthatsuperman", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/isthatsuperman", "key_color": "", "name": "t5_dm9hk", "is_default_banner": true, "url": "/user/isthatsuperman/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "isthatsuperman"}, "clicked": false, "created_utc": 1583274327.0, "distinguished": null, "edited": false, "id": "fd2qdd", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_fd2qdd", "num_comments": 127, "over_18": false, "score": 64, "downs": 0, "title": "the 5g coronavirus connection explained", "view_count": null, "media": null, "url": "https://www.reddit.com/r/conspiracyNOPOL/comments/fd2qdd/the_5g_coronavirus_connection_explained/", "permalink": "/r/conspiracyNOPOL/comments/fd2qdd/the_5g_coronavirus_connection_explained/", "selftext": "Ive noticed a lot recent posts and comments about 5g and the connection it has to corona so I wanted to make a little write up that goes into depth and covers the bases. Yes, there will be sources for the handicapped individuals. \n\nOne thing is for certain, we can’t say that an event like this wasn’t on the horizon. We’ve been bombarded by predictive programming for over decade now. From popular movies such as  [contagion](https://www.imdb.com/title/tt1598778/) (2011) to Bill   \n population control” Gates telling us of an impending [pandemic](https://youtu.be/6Af6b_wyiwI). (2015) We can even go back to 1981 with the questionable author Dean Koontz and his book [\"The Eyes of Darkness.\"](https://imgur.com/ww4Rlvc) just like with any major world event it is being planned and directed and they’ve been telling you about it for awhile. \n\nSo how did we get here? The first rumbles of Coronavirus started appearing as of December 1st of 2019, cases after that seemed to explode exponentially after. A lot of questions are being raised as to find out where, how, and when the viral outbreak started. So lets take a look at some events that were happening before then. \n\nFirst we have the pilot city rollout of 5g. These cities are beta test cities for 5g communication systems to deploy and test this technology. One of these cities just so happened to be the capitol city of the Hubei province,  [Wuhan.](http://en.hubei.gov.cn/news/newslist/201804/t20180416_1275769.shtml) the infrastructure was being built as early as 2018 and we can assume fully functional as of October 2019, because that is when the World military games took place in Wuhan as per the article above. \n\nNext we have a timely law that was passed on June 29th, 2019. The [mandatory vaccination law](https://www.loc.gov/law/foreign-news/article/china-vaccine-law-passed/). It was slated to go into full effect December 1st, 2019.  vaccine scandals in china are about a dime a dozen, from [faulty vaccines](https://time.com/5426720/china-faulty-rabies-vaccine-company-fined-one-billion/), [fake vaccines](https://www.globalcitizen.org/en/content/china-fake-vaccine-rabies-scandal-dpt/), inadequate handling of [vaccines](https://uk.reuters.com/article/us-china-drugs-vaccines-idUKKCN0XM1FV) , the legitimateness is quite questionable, and now they’re no longer asking. You may be wondering what vaccines have to do with 5g, well we’ll come back to that in a moment. \n\nLets talk about the effects of 5g radiation. You see, 5g is not a new technology by any means. We’ve had it since the invention of radio. Its been secretly coveted by the military industrial complex as a  [crowd control weapons.](https://www.rfsafe.com/5g-network-uses-nearly-same-frequency-as-weaponized-crowd-control-systems/) For over 100 years we’ve been testing and studying the effects of the millimeter wavelength spectrum. Don’t believe me? Heres a study from MIT done in [1948](https://dspace.mit.edu/bitstream/handle/1721.1/4963/RLE-TR-087-14236979.pdf) on the microwave absorption levels of oxygen. What they found is that at 60GhZ the microwaves are fully absorbed by oxygen molecules. Here are more data sets from [2001](https://www.rfglobalnet.com/doc/fixed-wireless-communications-at-60ghz-unique-0001) to back that up.  So lets break this down to fully understand the implications. \n\nIf you ever wondered how your microwave works, this is a pretty simple explanation. The microwave emits a 2.45GhZ frequency. This frequency is the absorption frequency for water molecules. It causes the molecules to oscillate at 2.45 BILLION hertz PER SECOND. These oscillations cause friction and that friction heats up your food. The interesting part is that the food is cooked from the inside out because the microwaves penetrate through the food, contrary to conventional cooking methods that cook from the outside in. \n\n(fun fact: your wifi router also emits the same frequency(2.4GhZ), only less wattage behind it.) sous vide, anyone? \n\nSo now that we understand how microwaves work, we can use that example to explain whats happening to oxygen molecules that are exposed to 5g signals from the linked study above. So why does it matter if oxygen is absorbing 5g frequencies? Well for the telecom companies it is essential to block out radio interferences and environmental interferences such as storms and rain. However, we need to look at the molecular structure of oxygen a bit closer to fully understand whats going on here. Oxygen (O2) is a diatomic molecule which means it has two molecules bonded together. When exposed to 60GhZ it begins to oscillate, just like water molecules. Only the oscillations begin to form a rotational spin of the molecule at 60 BILLION hertz PER SECOND.\n\nNow we have to look at how our bodies utilize oxygen. When we breathe the oxygen is taken into our lungs and passed through the alveoli. When passed through the alveoli it is met with red blood cells that contain hemoglobin which binds to the oxygen and the oxygen is then carried away through the body.\n\nSo what happens when these oxygen molecules are oscillating at 60GhZ? Well its like sticking your hand in a fan and trying to catch the blade, only this blade is spinning at 60 Billion RPS (revolutions per second) The oxygen is unable to bind to the hemoglobin and your body slowly suffocates to death through hypoxia.\n\nStrangely, the symptoms of the corona virus and hypoxia match up. \n\n\\- shortness of breath\n\n\\- troubled or rapid breathing \n\n\\- headaches\n\n\\- dizziness \n\n\\- DRY cough (59% of corona patients experience dry cough the very opposite of pneumonia) \n\n\\- seizures \n\n\\- fainting \n\nThis explains why most patients are asymptomatic for up to a month. They’re not cultivating a virus within them, they’re slowly suffocating to death. \n\nThis USSR soviet study from  [1977](https://mdsafetech.files.wordpress.com/2019/02/biological-effects-of-millimeter-wavelengths.-zalyubovskaya-declassif-by-cia-1977-biol-eff-mm-waves.pdf) that was a declassified by the CIA goes into more scientific depth of whats happening at a cellular level. \n\nNow returning back to the vaccine and 5g connection I stumbled upon this study from  [1997](https://www.ncbi.nlm.nih.gov/pubmed/9276003) stating that an EMF of only 50Hz can reactivate latently infected Epstein-Barr virus patients. So lets connect some dots, China passes a law of a mandatory vaccine schedule in 2019 and then suddenly a viral outbreak after 5g communications goes live? These instances may have no connection, but they definitely deserve to be looked into if TPTB and their de-population agenda is at hand here. \n\nSpeaking of TPTB lets take a look at the people who are pushing for 5g rollout. Here is [Tom Wheeler](https://www.youtube.com/watch?v=nWmYXUMLFpM), former chairman of the FCC speaking on the topic.  Why so hostile, Tom? He clearly does not want anything getting in the way between him and his billions of dollars. No regulations, no safety studies, we aren’t waiting for that nonsense! \n\nSo whats really going on here? Is this actually a virus or the worlds largest psy-op false flag? Is this just a way to usher in medical Marshall law? We’ve seen china quarantine whole cities of millions of people, effectively turning them into an open air prison, but why? If this virus was really as bad as they say it is, why aren’t the medical staff, police, and military clad in hazmat suits? I assume thats how they would handle a virus like this in a laboratory. Wheres the PPE? From what we’ve been shown this virus is joke to them. see  [here](https://imgur.com/ycieNB0)\n\nAre they using [crisis actors](https://imgur.com/EJjyTjf) just like every other false flag to push fear to the masses? \n\nIf the virus was actually manufactured in a P4 lab in wuhan, why is the corrupt CDC(center for disease creation) in Atlanta the only entity that can test for it? \n\nIm sure you’re asking how the disease has spread so far and wide with 5g only being in certain regions. If we look into what a coronavirus is, its nothing more than the common cold virus. As we all know it is flu season for many around the world. A perfect disguise for something like this to operate under. We are essentially seeing the complicit and owned MSM holding a magnifying glass up to every cold and flu case in the world and telling you its an incurable virus. Hows that for manipulation? \n\nI stumbled upon an individual named Joe Imbriano on this radio show from [2018.](https://www.youtube.com/watch?v=WinsLnM70cM&t=1330s) He predicts everything we’re currently seeing to the tee from 2 years ago. As you can see this is nothing new, nobodies cared until now. \n\nSo what can we do to protect ourselves? We have to take matters into our own hands. We can no longer sit around and put our lipstick on waiting to get fucked. Id like to introduce you guys to a true patriot for the people,  [John Patterson.](http://www.emraustralia.com.au/knowledgebase/inconvenient-truth-the-john-patterson-story) Ole’ Johnny boy, a former telecommunications and leading radiations expert, stole a tank and starting running down cell towers to protect him and his community. Be like Johnny, folks.", "stickied": false}