{"author": {"comment_karma": 1, "created_utc": 1563392831.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_D4E815.png", "id": "46djgk11", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 261, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#D4E815", "user_is_muted": null, "display_name": "u_Jumpy_Climate", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_D4E815.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Jumpy_Climate", "key_color": "", "name": "t5_1y89qg", "is_default_banner": true, "url": "/user/Jumpy_Climate/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Jumpy_Climate"}, "clicked": false, "created_utc": 1586433663.0, "distinguished": null, "edited": 1586434280.0, "id": "fxr6sc", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_fxr6sc", "num_comments": 58, "over_18": false, "score": 104, "downs": 0, "title": "If 184 Countries have Coronavirus and only FIVE countries have 5g why the fuck would you think the towers are causing Coronavirus RESPONSE", "view_count": null, "media": null, "url": "https://www.reddit.com/r/conspiracy/comments/fxr6sc/if_184_countries_have_coronavirus_and_only_five/", "permalink": "/r/conspiracy/comments/fxr6sc/if_184_countries_have_coronavirus_and_only_five/", "selftext": "This is a response to [this thread](https://www.reddit.com/r/conspiracy/comments/fwvf0s/if_184_countries_have_coronavirus_and_only_five/) which asked a really great question.\n\nI wanted to give a more detailed response to help people really understand how deep the propaganda goes...\n\n...because YES 5G is *a cause* but not *THE cause*.\n\n**1.  Myth #1 - There is a single central illness**\n\nJohn Rapoport says its better than I could in [this article](https://blog.nomorefakenews.com/2020/03/30/people-dying-equals-coronavirus-an-engineered-virus/).\n\n\"As I discovered in 1987, when I was researching AIDS, the basic epidemic con involves grouping all sorts of people and groups who are suffering from different traditional diseases, environmental toxicities, and certain new NON-VIRUS conditions UNDER ONE UMBRELLA LABEL. And then saying they’re all sick because of one virus. That is the central illusion.\"\n\nThe link below is an old documentary and it has fantastic information. It shows how the same basic scam was done with AIDS. If you have the time, I highly, highly recommend it. This is 100% the same thing happening now with the \"new Covid-19 virus\".\n\n[https://topdocumentaryfilms.com/hiv-aids-fact-or-fraud/](https://topdocumentaryfilms.com/hiv-aids-fact-or-fraud/)\n\nThis is why the \"outbreak\" in Italy and the \"outbreak\" in China look fundamentally different. Because they are two different completely illnesses, stitched together by the propaganda to look like one single \"disease\".\n\nThis idea of a single label describing lots of illnesses in reality is further propped up by a PCR test. Inventor Kerry Mulis says the test does *not* work to diagnose an infectious disease. More details on why the test sucks giant big donkey balls [here](https://blog.nomorefakenews.com/2020/03/30/corona-creating-the-illusion-of-a-pandemic-through-diagnostic-tests/).\n\nUsing the test which literally does not prove or show anything, they can show a false spread and a false pandemic. In short...\n\nMore tests = more \"positives\" = more reason to be afraid = more controls = more money made.\n\nWith the PCR test the numbers will keep going up.\n\nInterestingly, with 60 cycles of PCR test, it will give 100% false positive. Yes \"you\" will test positive if they just do a lot of cycles.\n\nDr. Thomas Cowan gives a [great explanation of this here](https://www.youtube.com/watch?v=m3LgrcDAlJs). He describes exactly to prove an \"infectious disease\" and how and why this was never done with Covid-19.\n\nThis is also why \"the virus keeps spreading\" (through fake PCR test numbers) and yet total deaths from last year in those same areas are exactly the same.\n\nThey have only reclassified and relabeled the same diseases of yesterday.\n\nThe single label for multiple illnesses has been programmed into us for 20 years.\n\nIt is why for 20+ years they have been trying to scare the sheep with Mad Cow Disease, West Nile, Bird Flu, Swine Flu, Zika, Ebola, Ecoli, Salmonella, Influenza, Measles, HIV/AIDS, etc etc\n\nThe mainstream media didn't just get bought and paid for in the last 4 weeks. It has always been that way.\n\nThis \"random event\" was planned.... for a long time.\n\nAnd not understanding myth #1 leads to a passive acceptance of myth #2...\n\n&#x200B;\n\n**2. Myth #2 - There is a single cause and it must be Covid-19**\n\nThere is not one single cause.\n\nIt is just made through propaganda to look that way.\n\nBecause if you believe you are looking at a single underlying illness with only a single underlying cause...\n\n....it can only be \"the oogey boogey deadly gonna end the world and kill all our health workers\" virus...\n\n...and we MUST take your rights away as a response.\n\nWhich is the whole point of this.\n\nMost people ask a good question, \"If it isn't an infectious disease and it's caused by 5G, why would it happen in areas that don't have 5G?\"\n\nIt's a great question.\n\nAnd it is because there are literally dozens or perhaps even hundreds of underlying factors.\n\nWuhan and Northern Italy just happen to have some of the most polluted air on planet Earth. Both have a history of respiratory problems. Not just in 2020.\n\nThe most common factors of disease in both humans and animals:\n\n1. Negative Thinking/Nocebo\n2. Environmental Toxicity\n3. Electromagnetic Fields\n4. Nutritional Deficiencies.\n\nJust think Scurvy \"spread\" too... and it was actually just vitamin C deficiency, which they cured by eating limes.\n\nAfter Hiroshima was dropped, disease in Japan \"spread\" too... and maybe, just maybe nuclear radiation was a factor (and getting bombed for years).\n\nAnd the power of the mind... Everyone knows about placebo. However, few know of its opposite power \"nocebo\".\n\nThere was a guy in the early 1900's who accidentally got locked in a train refrigeration unit. He froze to death overnight. This was confirmed in an autopsy. He also had a journal with him and wrote down his last words.\n\nOnly there was a problem.\n\nThey found out the refrigeration unit hadn't been functioning for a long, long time. It wasn't on. He literally froze to death because the power of the mind. He believed he was freezing to death and so his mind created that reality in his body.\n\nSo just think what all that media fear porn is doing to the average person.\n\nNocebo.\n\nSo yes any man generated electromagnetic field like 5G is harmful to any organic being.\n\nIt's why bees have already started dropping dead in large numbers around the towers. If it's killing bees, what do you think it will do to you?\n\nAnd if it was perfectly fine and dandy for you, what would be the harm in them letting you have an open frank discussion about it?\n\nAlso, notice a \"deadly virus\" isn't on the list of causative factors.\n\nThat is a big, big part of the propaganda.\n\nDo your own research on what a virus has proven to \"cause\". It is a deep rabbit hole with an absence of actual hard science to back it. [This interview](https://www.youtube.com/watch?v=IcBXMWho3aE) is a good place to start.\n\nAnimals in nature almost never get diseases like cancer, diabetes, etc. Except in areas where they have been heavily, heavily polluted.\n\nWhen this is all over and the oogey boogey virus didn't wipe out all of planet Earth, most people will believe that \"yay social distancing worked\".\n\n\"Hooray for big government!\"\n\n\"Hooray for tyranny!\"\n\nBut in reality it is just very well orchestrated propaganda.\n\nTypical problem - reaction - solution.\n\n&#x200B;\n\n**I also want to add something else...**\n\nDon't buy into the fear koolaid that everyone else is drinking.\n\nThe real key to this \"conspiracy\" is that they don't want you to know that you are the creator of your own reality.\n\nThey must enforce separation, fear, and division at every corner.\n\nThey must make you fear that which is outside yourself.\n\nThey must make you believe that a virus (which has never even been isolated) is more powerful than your own ability to self heal.\n\nThat is why they continue to downplay the idea that you can do anything about your own immunity through exercise, sleep, eating well, fresh air, positive mindset, etc etc.\n\nThat is why an injection of heavy metals and untested chemical cocktails from outside yourself is \"the only protection\". Or the nauseating hero worship of Bill Gates.\n\nOf course, that is all total bullshit.\n\nYou are more powerful than any control.\n\nYou are the creator.\n\nYou are love.\n\nYou are infinite.\n\nYou are timeless.\n\nOwn that shit.\n\n&#x200B;\n\n/My two cents.", "stickied": false}