{"url": "https://www.theepochtimes.com/the-closing-of-21-million-cell-phone-accounts-in-china-may-suggest-a-high-ccp-virus-death-toll_3281291.html", "text": "A security guard reads his cellphone while securing the entrance of a nearly empty shopping mall in Beijing, China, on Feb. 27, 2020. (NICOLAS ASFOURI/AFP via Getty Images)\n\n21 Million Fewer Cellphone Users in China May Suggest a High CCP Virus Death Toll\n\nThe number of Chinese cellphone users dropped by 21 million in the past three months, Beijing authorities announced on March 19. Deaths due to the CCP virus may have contributed to the high number of account closings.\n\nCellphones are an indispensable part of life in China.\n\n“The digitization level is very high in China. People can’t survive without a cellphone,” Tang Jingyuan, a U.S.-based China affairs commentator, told The Epoch Times on March 21. “Dealing with the government for pensions and social security, buying train tickets, shopping … no matter what people want to do, they are required to use cellphones.\n\n“The Chinese regime requires all Chinese to use their cellphones to generate a health code. Only with a green health code are Chinese allowed to move in China now. It’s impossible for a person to cancel his cellphone.”\n\nChina introduced mandatory facial scans on Dec. 1, 2019, to confirm the identity of the person who registered the phone. As early as Sept. 1, 2010, China required all cellphone users to register phones with their real identification, by which the state can control people’s speech via its large-scale monitoring system.\n\nFurthermore, Chinese people’s bank accounts and social security accounts are bundled with their cellphone plans; apps on Chinese phones check SIM cards against the state’s database to make sure the number belongs to the user.\n\nBeijing first launched cellphone-based health codes on March 10. All people in China must install a cellphone app and register their personal health information. Then the app can generate a QR code, which appears in three colors, to classify the user’s health level. Red means the person has an infectious disease, yellow means the person might have one, and green means the person doesn’t.\n\nBeijing claimed that the health codes are intended to prevent the spread of the CCP virus, commonly known as novel coronavirus.\n\nA woman is checking her cellphone in Shanghai, China on March 17, 2020. (HECTOR RETAMAL/AFP via Getty Images)\n\n21 Million Cellphone Users\n\nChina’s Ministry of Industry and Information Technology (MIIT) announced on March 19 the number of phone users in each province in February. Compared with the previous announcement, which was released on Dec. 18, 2019, for November 2019 data, both cellphone and landline users dropped dramatically. In the same period the year before, the number of users increased.\n\nThe number of cellphone users decreased from 1.600957 billion to 1.579927 billion, a drop of 21.03 million. The number of landline users decreased from 190.83 million to 189.99 million, a drop of 840,000.\n\nIn the previous February, the number increased. According to MIIT, the number of cellphone users increased in February 2019 from 1.5591 billion to 1.5835 billion, which is 24.37 million more. The number of landline users increased from 183.477 million to 190.118 million, which is 6.641 million more.\n\nAccording to China’s National Bureau of Statistics, the country’s population at the end of 2019 was 4.67 million larger than in 2018, reaching 1.40005 billion.\n\nThe 2020 decrease in landline users may be due to the nationwide quarantine in February, during which small businesses were shut down. But the decrease in cellphone users can’t be explained in this way.\n\nAccording to the operation data of all three Chinese cellphone carriers, cellphone accounts increased in December 2019 but dropped steeply in 2020.\n\nChina Mobile is the largest carrier, holding about 60 percent of the Chinese cellphone market. It reported that it gained 3.732 million more accounts in December 2019, but lost 0.862 million in January 2020 and 7.254 million in February 2020.\n\nChina Mobile’s performance in the same months in 2019 was markedly different; it gained 2.411 million more accounts in January 2019 and 1.091 million more in February 2019.\n\nChina Telecom is the second-largest carrier, holding about 21 percent of the market. It gained 1.18 million users in December 2019, but lost 0.43 million users in January 2020 and 5.6 million users in February 2020.\n\nIn 2019, it gained 4.26 million in January and 2.96 million in February.\n\nChina Unicom, which hasn’t yet published the data for February, shares the same experience as the other two telecoms in January 2020 and in early 2019. The company lost 1.186 million users in January 2020, but gained 1.962 million users in February 2019 and 2.763 million users in January 2019.\n\nChina allows each adult to apply for at most five cellphone numbers. Since Feb. 10, the majority of Chinese students have taken online classes with a cellphone number due to their schools being ordered to stay closed. These students’ accounts are under their parents’ names, which means some parents needed to open a new cellphone account in February.\n\nA vendor uses her cellphone as she waits for customers in Jiujiang, China, on March 6, 2020. (NOEL CELIS/AFP via Getty Images)\n\nAnalyzing the Numbers\n\nThe big question is whether the dramatic drop in cellphone accounts reflects the account closings of those who have died due to the CCP virus.\n\n“It’s possible that some migrant workers had two cellphone numbers before. One is from their hometown, and the other is from the city they work in. In February, they might close the number in the city they work in because they couldn’t go there,” Tang said. Typically, migrant workers would have gone to their home city for the Chinese New Year in January, and then travel restrictions would have prevented them from returning to the city where they held a job.\n\nHowever, because there is a basic monthly fee to hold a cellphone account in China, the majority of migrant workers—the lowest income group—are likely to only have one cellphone account.\n\nChina had 288.36 million migrant workers as of April 2019, according to the Chinese National Bureau of Statistics.\n\nOn March 17, Meng Wei, spokesman of China’s National Development and Reform Commission, said at a monthly press conference in Beijing that except for Hubei, all provinces reported that more than 90 percent of their businesses resumed operations. In Zhejiang, Shanghai, Jiangsu, Shandong, Guangxi, and Chongqing, almost all businesses resumed production.\n\nIf both the number of migrant workers and the level of employment are accurate, more than 90 percent of migrant workers have gone back to work.\n\nThe economic dislocation caused by shutdowns in China may have also led some people who have an extra cellphone to cancel it. With business poor or stopped, they may not want to carry the extra expense.\n\n“At present, we don’t know the details of the data. If only 10 percent of the cellphone accounts were closed because the users died because of the CCP virus, the death toll would be 2 million,” Tang said.\n\nOn March 25, a high official within MIIT, Han Xia, addressed the data point at a daily press conference.\n\nHe claimed that the drop in cell phone accounts was partly due to businesses shutting down in February to comply with quarantine policies. These businesses closed their spare phone accounts when their operations were halted, he said.\n\nIn addition, because telecom companies also closed down their physical stores during country-wide lockdowns, people were not able to open new accounts, Han said.\n\nThe reported death toll in China doesn’t line up with what can otherwise be determined about the situation there.\n\nA comparison with the situation in Italy also suggests the Chinese death toll is significantly underreported. Italy adopted similar measures to those used by the Chinese regime. The CCP virus death toll in Italy of 4,825 translates to a death rate of 9 percent. In China, where a much larger population was exposed to the virus, the reported death toll of 3,265 translated to a death rate of only 4 percent, less than half that reported in Italy.\n\nActivities in the outbreak epicenter of Hubei Province seem to contradict the reported death toll in China. The seven funeral homes in the city of Wuhan were reported to be burning bodies 24 hours a day, seven days a week in late January. Hubei Province has used 40 mobile cremators, each capable of burning five tons of medical waste and bodies a day, since Feb. 16.\n\nLacking data, the real death toll in China is a mystery. The cancellation of 21 million cellphones provides a data point that suggests the real number may be far higher than the official number.\n\nThe Epoch Times refers to the novel coronavirus, which causes the disease COVID-19, as the CCP virus because the Chinese Communist Party’s coverup and mismanagement allowed the virus to spread throughout China and create a global pandemic.", "images": ["https://img.theepochtimes.com/assets/uploads/2020/06/09/Attorney-General-William-Barr-e1591669389149-300x180.jpg", "https://www.theepochtimes.com/assets/themes/eet/images/logo_eet.svg", "https://img.theepochtimes.com/assets/uploads/2019/06/28/Trump-Putin-Osaka-300x180.jpg", "https://img.theepochtimes.com/assets/uploads/2020/03/21/new-medical-aid-station-in-wuhan-300x180.jpg", "https://img.theepochtimes.com/assets/uploads/2020/06/08/Prince-Andrew-3-300x180.jpg", "https://img.theepochtimes.com/assets/uploads/2020/05/20/ET-Azar574363321-300x180.jpg", "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1205429827-600x399.jpg", "https://www.theepochtimes.com/assets/themes/eet/images/white.png", "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1203651035-700x420.jpg", "https://www.theepochtimes.com/assets/themes/eet/images/EET_footer.png", "https://img.theepochtimes.com/assets/uploads/2020/03/21/assistant-secretary-for-health-march-21-300x180.jpg", "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1203651035-1200x800.jpg", "https://img.theepochtimes.com/assets/uploads/2020/06/08/GettyImages-87442420-300x180.jpg", "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1207503284-600x400.jpg", "https://img.theepochtimes.com/assets/uploads/2020/06/09/White-House-Press-Secretary-Kayleigh-McEnany-300x180.jpg"], "top_img": "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1203651035-1200x800.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.theepochtimes.com/the-closing-of-21-million-cell-phone-accounts-in-china-may-suggest-a-high-ccp-virus-death-toll_3281291.html", "title": "21 Million Fewer Cellphone Users in China May Suggest a High CCP Virus Death Toll", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"pages": 1615635982023706, "admins": 10205921529470972, "app_id": 1316421701839253}, "date": "2020-03-22 8:51:35 AM", "robots": "noodp,noydir", "description": "The number of Chinese cellphone users dropped by 21 million in the past three months, Beijing authorities announced ...", "keywords": "CCP virus,cell phone,China,coronavirus,death toll,THE EPOCH TIMES", "og": {"locale": "en_US", "type": "article", "title": "21 Million Fewer Cellphone Users in China May Suggest a High CCP Virus Death Toll", "description": "The number of Chinese cellphone users dropped by 21 million in the past three months, Beijing authorities announced ...", "url": "https://www.theepochtimes.com/the-closing-of-21-million-cell-phone-accounts-in-china-may-suggest-a-high-ccp-virus-death-toll_3281291.html", "site_name": "www.theepochtimes.com", "updated_time": "2020-04-02T10:40:24-04:00", "image": "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1203651035-1200x800.jpg"}, "article": {"tag": "CCP virus,coronavirus,death toll,cell phone,China", "section": "CCP Virus", "published_time": "2020-03-22T08:51:35-04:00", "modified_time": "2020-04-02T10:40:24-04:00"}, "twitter": {"card": "summary_large_image", "description": "The number of Chinese cellphone users dropped by 21 million in the past three months, Beijing authorities announced ...", "title": "21 Million Fewer Cellphone Users in China May Suggest a High CCP Virus Death Toll", "site": "@EpochTimes", "domain": "www.theepochtimes.com", "image": "https://img.theepochtimes.com/assets/uploads/2020/03/22/GettyImages-1203651035.jpg", "creator": "@EpochTimes"}, "al": {"web": {"should_fallback": "true"}, "android": {"package": "com.theepochtimes.news", "url": "eetapp://applinks/the-closing-of-21-million-cell-phone-accounts-in-china-may-suggest-a-high-ccp-virus-death-toll_3281291.html", "app_name": "The Epoch Times: Live & Breaking"}, "ios": {"app_store_id": 670443321, "app_name": "The Epoch Times: Live & Breakings", "url": "eetapp://applinks/the-closing-of-21-million-cell-phone-accounts-in-china-may-suggest-a-high-ccp-virus-death-toll_3281291.html"}}}, "movies": [], "publish_date": 1584881495.0, "source": "https://www.theepochtimes.com", "summary": ""}