{"url": "https://dgs-urgent.sante.gouv.fr/dgsurgent/inter/detailsMessageBuilder.do?id=30500&cmd=visualiserMessage", "text": "Liste des messages d'alertes\n\nLe 14/03/2020 18:38 Réf : 2020-REC-12 Objet : Actualisation recommandations Covid 19\n\nActualisation recommandations Covid 19\n\n\n\n1 - Définition de cas\n\n\n\n\n\nLes modifications suivantes ont été apportées par rapport à la version du 03/03/2020 :\n\n\n\nhttps://www.santepubliquefrance.fr/media/files/01-maladies-et-traumatismes/maladies-et-infections-respiratoires/infection-a-coronavirus/definition-de-cas-13-03-20\n\nhttps://www.santepubliquefrance.fr/media/files/01-maladies-et-traumatismes/maladies-et-infections-respiratoires/infection-a-coronavirus/zones-d-exposition-a-risque-covid-19-13-03-20\n\n\n\n2 - Recommandations sanitaires\n\n\n\nUn avis du Haut conseil de la Santé publique relatif à la prise en charge des cas confirmés d\u0092infection au virus SARS-CoV-2 a été publié.\n\nhttps://www.hcsp.fr/Explore.cgi/Telecharger?NomFichier=hcspa20200305_coviprisenchardescasconf.pdf\n\nDeux autres recommandations du HCSP ont été réalisées en urgence et les avis seront publiés très prochainement :\n\n- Avis sur les indications prioritaires du diagnostic par RT PCR\n\n- Avis sur la prévention et la prise en charge du COVID-19 chez les patients à risque de formes sévères\n\n\n\nElles sont disponibles sur le lien suivant : https://solidarites-sante.gouv.fr/IMG/pdf/new_hcsp-sars-cov-2_patients_fragiles_v3.pdf\n\n\n\n3- Utilisation d\u0092AINS chez des patients atteints Covid-19\n\n\n\nDes évènements indésirables graves liés à l\u0092utilisation des anti-inflammatoires non stéroïdiens (AINS) ont été signalés chez des patients atteints de COVID19, cas possibles ou confirmés. Nous rappelons que le traitement d\u0092une fièvre mal tolérée ou de douleurs dans le cadre du COVID19 ou de toute autre virose respiratoire repose sur le paracétamol, sans dépasser la dose de 60 mg/kg/jour et de 3 g/jour. Les AINS doivent être proscrits.\n\nA l\u0092inverse, les patients sous corticoïdes ou autres immunosuppresseurs pour une pathologie chronique ne doivent pas interrompre leur traitement, sauf avis contraire du médecin qui les suit pour cette pathologie.\n\nCette recommandation doit être diffusée largement auprès de l\u0092ensemble des professionnels de santé.\n\n\n\n4 - Recommandations personnes vulnérables\n\n\n\nLes patients les plus fragiles, et notamment les plus de 70 ans, devant restreindre drastiquement leurs interactions sociales, il est demandé à certains professionnels - pédicures-podologues, orthophonistes, orthoptistes, audioprothésistes, masseurs-kinésithérapeutes - de reporter les soins non-urgents pour ces personnes afin d\u0092éviter les sorties, les salles d\u0092attente.\n\n", "images": ["https://dgs-urgent.sante.gouv.fr/dgsurgent/images/icones_menu/logo_ministere.png"], "top_img": "", "keywords": [], "authors": ["Ministère De La Santé Et Des Sports"], "canonical_link": "", "title": "", "meta_data": {"TITLE": "Inscription et gestion de votre compte - Liste de diffusion DGS-Urgent", "DESCRIPTION": "Ce site est destiné à l'inscription et la gestion d'un compte DGS-Urgent.\n\t\t\t\t\t\t\t\t\t\t  Après inscription grâce à un numéro RPPS ou ADELI, l'utilisateur pourra \n\t\t\t\t\t\t\t\t\t\t  recevoir les messages d'alertes diffusés par la Direction Générale de la\n\t\t\t\t\t\t\t\t\t\t  Santé.", "KEYWORDS": "RPPS,ADELI,DGS,Alertes sanitaires", "OWNER": "Ministère de la Santé et des Sports", "AUTHOR": "Ministère de la Santé et des Sports", "LANGUAGE": "fr", "robots": "all", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://dgs-urgent.sante.gouv.fr", "summary": ""}