{"url": "https://techstartups.com/2020/04/05/new-updates-dr-vladimir-zelenko-cocktail-hydroxychloroquine-zinc-sulfate-azithromycin-showing-phenomenon-results-900-coronavirus-patients-treated-must-watch-video/", "text": "April 7 Update: More doctors are now saying Hydroxychloroquine only works when used in combination with Zinc\n\nOver the past three weeks, we’ve been sharing with you the great work Dr. Zelenko, a board-certified family practitioner in New York, has been doing in the treatment of COVID-19 patients in New York. In our last piece, Dr. Vladimir Zelenko treated 700 coronavirus patients treated with 99.9% success rate using Hydroxychloroquine, 1 outpatient died after not following protocol. In the meantime, more doctors are seeing success with hydroxychloroquine and Zinc Sulphate in treating coronavirus patients, according to one report from ABC News. 12 French doctors have also filed a petition calling on French Prime Minister and Minister of Health to urgently make hydroxychloroquine available in all French hospital pharmacies\n\nToday, we have new and encouraging updates from Dr. Zelenko. In a one-hour video, Dr. Zelenko provides a detailed medical explanation about why his cocktail of Hydroxychloroquine Sulfate, Zinc and Azithromycin (not Z-Pak) works, and why the three-drug combination are really needed in killing coronavirus.\n\nUnlike the conventional method of admitting patients to the hospitals, Dr. Zelenko’s approach is to provide treatment to patients before their situation get worse so they don’t have to be admitted into the hospital. His approach has been so effective to the point that he has treated 900 coronavirus patients with 99.99% rate. His approach is to provide treatment to people so that they don’t have to be put on ventilators. His out-patient treatment regimen, which costs only $12, is as follows:\n\n1. Hydroxychloroquine 200mg twice a day for 5 days\n\n2. Azithromycin 500mg once a day for 5 days\n\n3. Zinc sulfate 220mg once a day for 5 days\n\nIn an open letter to medical professionals across the globe, Dr. Zelenko said this: “The rationale for my treatment plan is as follows. I combined the data available from China and South Korea with the recent study published from France (sites available on request). We know that hydroxychloroquine helps Zinc enter the cell. We know that Zinc slows viral replication within the cell. Regarding the use of azithromycin, I postulate it prevents secondary bacterial infections. These three drugs are well known and usually well tolerated, hence the risk to the patient is low.”\n\nIn this new must watch video, Dr. Zelenko went on to explain that hydroxychloroquine helps zinc penetrate the cell (zinc decelerates viral replication in the cell). He stated that azithromycin combats secondary infections. Dr. Zelenko is surprised that many other doctors operate with a “peace time mentality.” Instead, he calls for bravery and mindset adjustment.", "images": ["https://techstartups.com/wp-content/uploads/2020/06/Unreported-Truths-about-COVID-19-and-Lockdowns-book-700x466.jpg", "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko-150x150.jpg", "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg", "https://techstartups.com/wp-content/uploads/2020/04/New-York-coronavirus-cases-dropped-for-the-first-time-700x438.jpg", "https://techstartups.com/wp-content/uploads/2017/12/techstartups.com-logo-v3.png", "https://techstartups.com/wp-content/uploads/2020/04/myavatar.jpg", "https://techstartups.com/wp-content/uploads/2020/04/Coronavirus-Mutation-1-700x425.jpg"], "top_img": "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg", "keywords": [], "authors": [], "canonical_link": "https://techstartups.com/2020/04/05/new-updates-dr-vladimir-zelenko-cocktail-hydroxychloroquine-zinc-sulfate-azithromycin-showing-phenomenon-results-900-coronavirus-patients-treated-must-watch-video/", "title": "New updates from Dr. Vladimir Zelenko: Cocktail of Hydroxychloroquine, Zinc Sulfate and Azithromycin are showing phenomenon results with 900 coronavirus patients treated – Must Watch Video", "meta_data": {"msvalidate.01": "C9F587B678F797450F643547987F1838", "description": "TechStartups - Coverage of Technology News, technology startups, Emerging technology, venture capital funding, and Silicon Valley", "keywords": "tech news, technology news, startup news, funding, venture capital", "og": {"locale": "en_US", "type": "article", "title": "New updates from Dr. Vladimir Zelenko: Cocktail of Hydroxychloroquine, Zinc Sulfate and Azithromycin are showing phenomenon results with 900 coronavirus patients treated – Must Watch Video", "description": "April 7 Update: More doctors are now saying Hydroxychloroquine only works when used in combination with Zinc Over the past three weeks, we’ve been sharing with you the great work Dr. Zelenko, a board-certified family practitioner in New York, has been doing …", "url": "https://techstartups.com/2020/04/05/new-updates-dr-vladimir-zelenko-cocktail-hydroxychloroquine-zinc-sulfate-azithromycin-showing-phenomenon-results-900-coronavirus-patients-treated-must-watch-video/", "site_name": "Tech News | Startups News", "updated_time": "2020-04-07T16:37:47-04:00", "image": "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg"}, "article": {"publisher": "https://www.facebook.com/TechStartupsCom/", "section": "Featured", "published_time": "2020-04-05T16:12:21-04:00", "modified_time": "2020-04-07T16:37:47-04:00"}, "twitter": {"card": "summary", "description": "April 7 Update: More doctors are now saying Hydroxychloroquine only works when used in combination with Zinc Over the past three weeks, we’ve been sharing with you the great work Dr. Zelenko, a board-certified family practitioner in New York, has been doing […]", "title": "New updates from Dr. Vladimir Zelenko: Cocktail of Hydroxychloroquine, Zinc Sulfate and Azithromycin are showing phenomenon results with 900 coronavirus patients treated - Must Watch Video | Tech News | Startups News", "site": "@techstartupscom", "image": "https://techstartups.com/wp-content/uploads/2020/03/Doctor-Vladimir-Zelenko.jpg", "creator": "@techstartupscom"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "generator": "WordPress 4.8.13", "msapplication-TileImage": "https://techstartups.com/wp-content/uploads/2016/09/cropped-3.1-270x270.png"}, "movies": ["https://www.youtube.com/embed/Z7SDemHGl8U?start=348&feature=oembed"], "publish_date": 1586059200.0, "source": "https://techstartups.com", "summary": ""}