{"url": "https://www.goodhousekeeping.com/health/wellness/g20706539/how-to-make-a-natural-hand-sanitizer/", "text": "Experts say many Americans aren't washing their hands for long enough, nor are they washing frequently enough.\n\nYou need to lather and scrub for at least 20 seconds to properly eliminate infectious germs.\n\nDoctors say hand sanitizer is acceptable between washes if you don't have access to a sink.\n\nWashing your hands, just like brushing your teeth or applying deodorant, is usually a straightforward part of your day — you've probably never thought twice about it. But every year during cold and flu season, doctors and healthcare professionals are here to remind us how important it is to be washing our hands — especially since many of us are not doing it enough (or correctly). According to a 2018 study published by the U.S. Department of Agriculture, Americans in a test environment failed to properly wash their hands and prevent the spread of germs 97% of the time. While the study may may have been limited in its reach, health experts like Jennifer H. Haythe, MD, an internist and cardiologist at New York-Presbiteriyan Hospital, agree that most Americans aren't washing their hands correctly.\n\n\"Generally, people don't wash their hands long enough, and I'm always emphasizing that people need to choose soap and water,\" says Dr. Haythe, who is also the co-director of Columbia University's Women's Health Center for Cardiovascular Health.\n\nMaybe it's because we're distracted or busy juggling a packed day, but even those of us who do manage to properly scrub bacteria away may not be doing it frequently enough, says Bahador Momeni, MD, the medical director for primary care practices at the University of Maryland Medical System's Baltimore-Washington medical group. In fact, depending on your lifestyle and daily routine, there could be as many as 15 situations in a day where germs lingering on your hands could threaten your immune system and a good scrub could be vital.\n\nBelow, both experts school us on the best way to wash your hands, including when and why you should be lathering up — or at the very least, reaching for hand sanitizer.\n\nA step-by-step guide: How to wash your hands\n\nThe officials at the Centers for Disease Control and Prevention say that the best way to eliminate infectious germs while washing your hands is to sing \"Happy Birthday\" at least twice. Why? You need extra time to lift bacteria away from your skin, and singing the song could help you stay on track. Here's everything you need to know about washing your hands the proper way, according to the CDC's advice.\n\nStart by wetting your hands up to your wrist under running water. While you may think scalding hot water is best for removing germs, CDC officials say that temperature actually doesn't matter. Next, turn off the water and start lathering up with soap. As you lather up, be sure to get both the front and backs of your hands and wrists, including the skin between your fingers and under the nails. You'll need to scrub for at least 20 seconds, or enough time to sing or hum your way through \"Happy Birthday\" twice, says Dr. Haythe. While soap allows the bacteria to be lifted off of your skin, it's the friction of scrubbing that actually pushes germs down the drain. Turn the water back on, place your hands beneath the tap and rinse thoroughly, until all soap has been washed away and the water in the basin is clear. Ensure that the water is flowing down into the sink, so that soapy water does not linger on your wrists or drip down your arms, as this can spread germs elsewhere on your body. Finally, dry your hands with a clean towel (or a hand dryer, if no clean towels or paper towels are available).\n\nLaylaBird Getty Images\n\nShouldn't I be using my elbow or a paper towel to turn the tap on and off?\n\nThe CDC recommends turning off the faucet before lathering up because it saves water and \"there are few data to prove whether significant numbers of germs are transferred between hands and the faucet.\" Similarly, while some prefer to use a clean paper towel or their elbow to turn off the faucet after rinsing, the CDC says this \"leads to increased use of paper towels, and there are no studies to show it improves health.\" That said, if you prefer to use a paper towel or your elbow to turn the faucet on and off as an extra precaution, it can't hurt.\n\nAs for the best way to dry your hands, the CDC notes that germs can be more easily transferred to and from wet hands, so it is important to dry them after washing. According to a study published in the Journal of Food Protection, the friction from a paper towel could better ensure any lingering germs are actually wiped off of your skin. However, the CDC sides with studies that suggest using a clean towel or air drying is the best method.\n\nWhen should I wash my hands?\n\nUnfortunately, there isn't a one-size-fits-all list of times you should seek out a sink. \"It really depends on what you've done that day and the kind of exposure you're facing; as a doctor, I wash my hands 30 to 40 times a day, especially during the flu season,\" Dr. Haythe explains. So use the below instances as a benchmark, and keep yourself accountable by being cognizant of the last time you've washed your hands. Parents should also encourage their children to suds up regularly, which can greatly reduce the risk of multiple family members getting sick all at once.\n\nAfter (and before!) you use the bathroom : Dr. Haythe says that harmful bacteria can easily transfer upon contact if you're touching sensitive areas of your body, including the face or any region with mucous membranes.\n\n: Dr. Haythe says that harmful bacteria can easily transfer upon contact if you're touching sensitive areas of your body, including the face or any region with mucous membranes. Before you prepare food, and after you've finished eating : This includes any time you touch raw ingredients that could contain harmful bacteria.\n\n: This includes any time you touch raw ingredients that could contain harmful bacteria. After you've come in from the outdoors : As soon as you enter your home, you should wash your hands to prevent spreading bacteria to soft and hard surfaces, Dr. Haythe says.\n\n: As soon as you enter your home, you should wash your hands to prevent spreading bacteria to soft and hard surfaces, Dr. Haythe says. When you arrive at restaurants : Say hi to your friends or family, then make a beeline for the restroom to avoid consuming any bacteria passed from your hands onto a glass or utensils.\n\n: Say hi to your friends or family, then make a beeline for the restroom to avoid consuming any bacteria passed from your hands onto a glass or utensils. After playing with your pets : \"You shouldn't get overly paranoid here, but being outside means your dog's coat is exposed to the same bacteria you would be, and you're coming into contact with [that bacteria] if you pet them afterwards,\" Dr. Haythe explains.\n\n: \"You shouldn't get overly paranoid here, but being outside means your dog's coat is exposed to the same bacteria you would be, and you're coming into contact with [that bacteria] if you pet them afterwards,\" Dr. Haythe explains. Anytime you've touched something that's widely used: The handrail in the subway, a railing on the stairs, the revolving door outside the office, or buttons on the elevator are all prime examples of high-trafficked bacterial surfaces. Dr. Haythe says wearing gloves while you're commuting, for example, may help you feel more comfortable holding or touching these surfaces, but you should still wash your hands afterwards.\n\nImages By Tang Ming Tung Getty Images\n\nWhat about hand soap vs. hand sanitizer?\n\nSoap and water is always the best option, but the doctors we spoke with agree that hand sanitizer is a good alternative if you are out and about without access to a sink, since it could mean transferring less bacteria to items you regularly use, like your phone, wallet, or common surfaces like your car's steering wheel. Note that you'll want to use an alcohol-based sanitizer that contains at least 60% alcohol in its ingredients, Dr. Haythe says.\n\nIf you're using hand sanitizer and/or washing your hands a lot during flu season, you may find your hands are drying out. Dr. Joshua Zeichner, the director of cosmetic and clinical research in Mount Sinai's department of dermatology, says that increased hand washing could lead to irritation and inflammation of the skin at first. \"After washing, make sure to apply a moisturizer. Moisturizers help protect the outer skin layer that may become damaged from excessive hand washing,\" he says, adding that he to his patients, as the petrolatum forms a protective seal over the skin.\n\nZee Krstic Associate Health Editor Zee Krstic is a health editor for GoodHousekeeping.com, where he covers the latest in health and nutrition news, decodes diet and fitness trends, and reviews the best products in the wellness aisle.\n\nThis content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n\nThis commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.998xw:0.684xh;0.00321xw,0.224xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.998xw:0.684xh;0.00321xw,0.224xh&resize=1200:*", "keywords": [], "authors": ["Zee Krstic", "Associate Health Editor", "Zee Krstic Is A Health Editor For Goodhousekeeping.Com", "Where He Covers The Latest In Health", "Nutrition News", "Decodes Diet", "Fitness Trends", "Reviews The Best Products In The Wellness Aisle."], "canonical_link": "https://www.goodhousekeeping.com/health/wellness/a31225042/how-to-wash-your-hands/", "title": "When to Wash Your Hands, According to the CDC", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Good Housekeeping", "title": "Doctors Say Many Americans Aren’t Washing Their Hands for Long Enough", "description": "You should be singing the Happy Birthday song twice.", "url": "https://www.goodhousekeeping.com/health/wellness/a31225042/how-to-wash-your-hands/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.998xw:0.684xh;0.00321xw,0.224xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 119423528138309, "pages": 40241492597}, "article": {"publisher": "https://www.facebook.com/GOODHOUSEKEEPING", "modified_time": "2020-05-20 02:53:51", "published_time": "2020-03-04 05:58:00", "section": "Wellness", "opinion": "false"}, "twitter": {"site": "@goodhousemag", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.998xw:0.684xh;0.00321xw,0.224xh&resize=640:*"}, "google-site-verification": "Cyrrih2f3Dh884Dysa4Fuafe2UewzpbR6gnQipgICss", "title": "How to Wash Your Hands Correctly - When to Wash Your Hands, According to the CDC", "description": "Learn how to wash your hands the right way to stop spreading germs, according to health professionals and doctors. Plus, a list of situations where you should be washing your hands immediately.", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.737xw:1.00xh;0.133xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Health,health,wellness", "sailthru.date": "2020-03-04T17:58:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.998xw:0.684xh;0.00321xw,0.224xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/how-to-wash-your-hands-1583338761.jpg?crop=0.737xw:1.00xh;0.133xw,0", "sailthru.socialtitle": "Doctors Say Many Americans Aren’t Washing Their Hands for Long Enough", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1583319480.0, "source": "https://www.goodhousekeeping.com", "summary": ""}