{"url": "https://www.washingtonpost.com/news/to-your-health/wp/2018/05/10/top-white-house-official-in-charge-of-pandemic-response-exits-abruptly/", "text": "Ziemer’s last day was Tuesday, the same day a new Ebola outbreak was declared in Congo. He is not being replaced.\n\nAD\n\nPandemic preparedness and global health security are issues that require government-wide responses, experts say, as well as the leadership of a high-ranking official within the White House who is assigned only this role.\n\nAD\n\n“Health security is very fragmented, with many different agencies,” said J. Stephen Morrison, senior vice president at the Center for Strategic and International Studies. “It means coordination and direction from the White House is terribly important. ”\n\nThe personnel changes, which Morrison and others characterize as a downgrading of global health security, are part of Bolton’s previously announced plans to streamline the NSC. Two members of Ziemer's team have been merged into a unit in charge of weapons of mass destruction, and another official's position is now part of a unit responsible for international organizations. White House homeland security adviser Tom Bossert, who had called for a comprehensive biodefense strategy against pandemics and biological attacks, is out completely. He left the day after Bolton took over last month.\n\nAD\n\nNSC spokesman Robert Palladino said Wednesday the administration “remains committed to global health, global health security and biodefense, and will continue to address these issues with the same resolve under the new structure.”\n\nAD\n\nAnother administration official, who spoke on the condition of anonymity because he was not authorized to discuss the issue publicly, acknowledged it was only one of many administration priorities. “In a world of limited resources, you have to pick and choose,” he said. “We lost a little bit of the leadership, but the expertise remains.”\n\nZiemer is a well-respected public health leader who was considered highly effective leading the President’s Malaria Initiative under George W. Bush and Barack Obama before joining the NSC last year. While Palladino said he left “on the warmest terms,” an individual familiar with the specifics behind the reorganization said “he was basically pushed out. He struggled to preserve himself and the integrity of his team, and he failed.”\n\nAD\n\nHis exit comes against the backdrop of other administration actions critics say have weakened health security preparedness, including dwindling financing for early preventive action against infectious disease threats abroad.\n\nAD\n\nThe new Ebola outbreak is in northwest Congo. Only two cases have been confirmed, but the World Health Organization reported Thursday another 30 probable and suspected cases of the deadly hemorrhagic fever. Of those, 18 already have died.\n\nCongolese and international health officials say they hope to control the outbreak quickly, but some health officials worry about its potential to become more serious and spread because of its location in a town upriver from the densely populated capital of Kinshasa.\n\nAD\n\nThis week, the administration released a list of $15 billion in spending cuts it wants Congress to approve. Among the targets is $252 million in unused funds remaining from the 2014-2015 Ebola epidemic in West Africa that killed more than 11,000 people, far exceeding the combined total cases reported in about 20 previous outbreaks since the 1970s.\n\nAD\n\nThe White House proposal “is threatening to claw back funding whose precise purpose is to help the United States be able to respond quickly in the event of a crisis,” said Carolyn Reynolds, a vice president at PATH, a global health technology nonprofit.\n\nCollectively, warns Jeremy Konyndyk, who led foreign disaster assistance at the U.S. Agency for International Development during the Obama administration, “What this all adds up to is a potentially really concerning rollback of progress on U.S. health security preparedness.”\n\nAD\n\n“It seems to actively unlearn the lessons we learned through very hard experience over the last 15 years,” said Konyndyk, now a senior policy fellow at the Center for Global Development. “These moves make us materially less safe. It’s inexplicable.”\n\nThe day before news of Ziemer’s exit became public, one of the officials on his team, Luciana Borio, director of medical and biodefense preparedness at the NSC, spoke at a symposium at Emory University to mark the 100th anniversary of the 1918 influenza pandemic. That event killed an estimated 50 million to 100 million people worldwide.\n\nAD\n\n“The threat of pandemic flu is the number one health security concern,” she told the audience. “Are we ready to respond? I fear the answer is no.”\n\nAD\n\nKaren DeYoung contributed to this report.", "images": ["https://www.washingtonpost.com/resizer/WT_W4s-y1o6goqAaN3vY-E3J-Gs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3U2TBD3JGUYR5OU5GDDOKD44LY.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KMAAO3W6NI4GHGINOOKK4YJZCI.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/a26342b5-8039-48cd-9aa0-2f4871bb7694.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/WT_W4s-y1o6goqAaN3vY-E3J-Gs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3U2TBD3JGUYR5OU5GDDOKD44LY.jpg", "keywords": [], "authors": ["Lena H. Sun", "National Reporter Focusing On Health"], "canonical_link": "https://www.washingtonpost.com/news/to-your-health/wp/2018/05/10/top-white-house-official-in-charge-of-pandemic-response-exits-abruptly/", "title": "Top White House official in charge of pandemic response exits abruptly", "meta_data": {"description": "Timothy Ziemer's departure Tuesday and the disbanding of his team at the National Security Council signal a downgrading of global health security as a priority, experts warn.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/to-your-health/wp/2018/05/10/top-white-house-official-in-charge-of-pandemic-response-exits-abruptly/", "image": "https://www.washingtonpost.com/resizer/WT_W4s-y1o6goqAaN3vY-E3J-Gs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3U2TBD3JGUYR5OU5GDDOKD44LY.jpg", "title": "Top White House official in charge of pandemic response exits abruptly", "description": "Timothy Ziemer's departure Tuesday and the disbanding of his team at the National Security Council signal a downgrading of global health security as a priority, experts warn."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Top White House official in charge of pandemic response exits abruptly", "description": "Timothy Ziemer's departure Tuesday and the disbanding of his team at the National Security Council signal a downgrading of global health security as a priority, experts warn."}, "last_updated_date": "2019-03-30T16:28:25.300Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1525924800.0, "source": "https://www.washingtonpost.com", "summary": ""}