{"url": "https://www.latimes.com/world-nation/story/2020-03-13/china-japan-korea-coronavirus-reinfection-test-positive", "text": "The neighbors were free at last.\n\nAfter weeks of confinement to their apartments because one person in the building had tested positive for coronavirus, they were throwing a party to celebrate his recovery and their release.\n\nIt was Feb. 24, and Mr. Wang, a resident of Xuzhou, in Jiangsu province, appeared to have emerged victorious from a monthlong battle with the illness. Sixty-five residents of his building gathered downstairs to greet Wang with bouquets of pink flowers, a cake with a flamingo on it, and a red banner that read: “With strong neighborly feelings, we welcome you home.”\n\nThey pressed in close around him for a group photo that was captured in a local news video.\n\nAdvertisement\n\nA worker sprays disinfectant at an elementary school in preparation for the return of students in Donghai, in eastern China’s Jiangsu province. (AFP/Getty Images)\n\nThree days later, though, Wang tested positive for the coronavirus again. He was re-hospitalized and his neighbors were locked down once more. His current condition is unknown.\n\nWang, whose full name has not been disclosed for privacy reasons, is one of more than 100 reported cases of Chinese patients who have been released from hospitals as survivors of the new coronavirus — only to test positive for it a second time in the bewildering math of this mysterious illness.\n\nThe science surrounding these apparent reinfections is further complicated by China’s handling of the outbreak, which since January has been marred by faulty testing procedures and questionable case counting methods with shifting definitions. In addition, the overburdened healthcare system has put pressure on doctors to discharge people who may not have fully recovered to free up beds for newly infected patients.\n\nAdvertisement\n\nChina has been praised in recent weeks by the World Health Organization for containing the virus. But the Communist Party’s early moves to suppress public knowledge on the extent of infections prompt concerns over the accuracy of information about recovered patients who retest positive but may have been misdiagnosed in the first place.\n\nSuch cases account for less than 0.2% of China’s total infections — not enough to cause alarm. But they are raising questions in China about the reliability of diagnostic tests, the possibility of reinfection and whether patients are wrongly designated as “recovered” and released too early from hospitals.\n\nMedical staffers speak with a COVID-19 patient in Wuhan, China, on March 10, 2020.\n\n(AFP/Getty Images)\n\nAlthough most patients who retest positive do not display clinical symptoms, some have developed fevers and other signs of the virus. One such patient, a 36-year-old man, died in Wuhan on March 2, five days after being declared recovered.\n\nHis diagnosis, according to hospital reports published in local media before they were censored, was respiratory tract obstruction, respiratory failure and COVID-19, the official name for the illness caused by the coronavirus.\n\nAdvertisement\n\nChina’s National Health Commission says 64,216 out of 80,991 confirmed COVID-19 patients have recovered, and 3,179 have died. There is no official record of how many recovered patients have retested positive and returned to hospitals, but such cases have been reported in the provinces of Hubei, Guangdong, Hainan, Sichuan and Jiangsu, and the cities of Tianjin and Chongqing.\n\nIn Guangdong, officials responsible for the coronavirus response announced Feb. 25 that 14% of declared recoveries in the province had later retested positive.\n\nThe dynamic is also playing out in other countries: Two such cases have emerged in Japan and South Korea, though the Korean patient has been released from hospital after retesting negative five times.\n\nAdvertisement\n\nScientists in and outside China agree that reinfection is a highly unlikely explanation for the patients who retest positive. They say testing errors are more likely to blame — either false negatives that resulted in patients being discharged too early, or false positives when they retested and were taken back into hospital.\n\nThose errors could be attributed to contaminated test samples, human error while taking swabs, or an oversensitive nucleic acid test that detects strands of virus. When a person gets sick with any kind of viral infection, their immune system naturally develops antibodies that should protect them from contracting the illness again after they’ve recovered.\n\nEven in cases where that immunity wears off, it shouldn’t be as quick as within a few days or weeks, said Dr. Keiji Fukuda, director of Hong Kong University’s School of Public Health.\n\n“If you get an infection, your immune system is revved up against that virus,” he said. “To get reinfected again when you’re in that situation would be quite unusual unless your immune system was not functioning right.”\n\nAdvertisement\n\nChinese President Xi Jinping talks by video with patients and medical workers at a hospital in Wuhan on March 10, 2020. (Xie Huanchi / New China News Agency )\n\nWhat’s more likely is that people are being released from hospitals while still carrying dormant fragments of the disease that are not infectious but resemble the virus when put through a nucleic acid test, he said.\n\n“The test may be positive, but the infection is not there,” he said.\n\nAnother possibility is that the level of virus fell below the threshold that tests could detect but then resurfaced, said Dr. Clifford Lane, deputy director for Clinical Research and Special Projects at the National Institute of Allergy and Infectious Diseases.\n\nAdvertisement\n\n“So it looks like they cleared the virus and then the virus came back,” Lane said. “But they never really cleared it and they had a more prolonged course of infection.”\n\nLane was one of only two U.S. experts in a World Health Organization delegation that visited China in February. He said Chinese experts told the visitors that there were no examples of people who became “reinfected.”\n\nNewsletter Get our free Coronavirus Today newsletter Sign up for the latest news, best stories and what they mean for you, plus answers to your questions. Enter Email Address Sign Me Up You may occasionally receive promotional content from the Los Angeles Times.\n\nThe best way to prove reinfection, Lane said, would be to sequence the genomes of the initial and subsequent viruses that circulated in a patient. If there is a difference between the two, that would suggest that the virus had mutated enough to evade the patient’s antibodies and prompt a second infection.\n\nAdvertisement\n\nDeveloping a vaccine would be significantly more difficult if the virus is changing fast enough to cause true reinfections. It would undermine the immunity patients develop from natural infections.\n\nIt’s too early to know the true cause of these apparent reinfections, Lane said, especially because cases are so rare.\n\n“These are exceptions,” he added. “These are not the rule.”\n\nAnother potential explanation is that some patients may also have been discharged too early because of pressure on hospitals to free up beds for new patients.\n\nAdvertisement\n\n“If you don’t discharge them, who’s going to save the other patients? You need to make trade-offs,” one unnamed doctor said in a report by the Paper, a Shanghai-based news outlet.\n\nA doctor at a Wuhan hospital told the Paper that he’d seen discharged patients still using oxygen tanks, having trouble walking and displaying obvious clinical symptoms, including serious lung infections, in February. Some of the recovered patients had worse clinical symptoms than the new, mild cases entering the hospitals, he said.\n\nBut the situation improved in late February, when fewer patients turned up at Wuhan’s hospitals, enabling them to keep patients longer.\n\nChinese authorities claim that none of the patients who tested positive again have infected others. If true, it’s an encouraging sign that even if some discharged patients are still carrying low levels of the virus, they are not contagious.\n\nAdvertisement\n\nBut one study by Chinese scientists published last month in the Journal of the American Medical Assn. raised questions about testing. The study examined four medical workers in Wuhan, all infected with coronavirus and then declared recovered according to national criteria. But five to 13 days after the four were released from quarantine, they all tested positive again. They were then each given three repeat tests over the next four to five days. All were positive.\n\nDr. Dale Fisher, professor of medicine at the National University of Singapore and another participant in the WHO’s China delegation, said the apparent reappearance of coronavirus in recovered patients was probably because of “excessive” testing and follow-up on discharged cases in China.\n\n“The outbreak is being driven by people who are spreading it in those first five days while they’re symptomatic and before they’re isolated ... when people are going around coughing and undiagnosed, infecting people,” he said. “The things to worry about are at the other end of the illness.”\n\nAdvertisement\n\nTimes staff writer Victoria Kim in Seoul and Nicole Liu of The Times’ Beijing bureau contributed to this report.", "images": ["https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/1fea5cc/2147483647/strip/true/crop/5000x3633+0+0/resize/840x610!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F16%2Ff3%2Fd143040245609fef78895acc60ab%2Fap20070377919994.jpg", "https://ca-times.brightspotcdn.com/dims4/default/6971617/2147483647/strip/true/crop/1365x1365+342+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe2%2F55%2Fed8b93ffcb436bbff5a5743aeb9f%2Fimg-5c0abce9-turbine-la-bio-alice-su", "https://ca-times.brightspotcdn.com/dims4/default/b271036/2147483647/strip/true/crop/4000x2667+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc4%2Ff7%2Fbfdc6c6242cfb2e5a822825918fd%2Fgettyimages-1206417606.jpg", "https://ca-times.brightspotcdn.com/dims4/default/20c0a52/2147483647/strip/true/crop/3000x1575+0+211/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Fe0%2F356450d84c7d970ce2252390642b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1203429216.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/8b51a28/2147483647/strip/true/crop/3000x1996+0+0/resize/840x559!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Fe0%2F356450d84c7d970ce2252390642b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1203429216.jpg", "https://ca-times.brightspotcdn.com/dims4/default/00200a3/2147483647/strip/true/crop/4000x2667+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2Fbe%2F2a45a6a54fefb76e8927c724efe1%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1206683878.jpg", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/20c0a52/2147483647/strip/true/crop/3000x1575+0+211/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Fe0%2F356450d84c7d970ce2252390642b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1203429216.jpg", "keywords": [], "authors": ["China Correspondent", "Alice Su Is A Foreign Correspondent For The Los Angeles Times Based In Beijing"], "canonical_link": "https://www.latimes.com/world-nation/story/2020-03-13/china-japan-korea-coronavirus-reinfection-test-positive", "title": "They survived the coronavirus. Then they tested positive again. Why?", "meta_data": {"og": {"title": "They survived the coronavirus. Then they tested positive again. Why?", "url": "https://www.latimes.com/world-nation/story/2020-03-13/china-japan-korea-coronavirus-reinfection-test-positive", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/20c0a52/2147483647/strip/true/crop/3000x1575+0+211/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Fe0%2F356450d84c7d970ce2252390642b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1203429216.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/20c0a52/2147483647/strip/true/crop/3000x1575+0+211/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Fe0%2F356450d84c7d970ce2252390642b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1203429216.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "This photo taken on February 22, 2020 shows a nurse preparing equipment in an intensive care unit treating COVID-19 coronavirus patients at a hospital in Wuhan, in China's central Hubei province. - China on February 26 reported 52 new coronavirus deaths, the lowest figure in more than three weeks, bringing the death toll to 2,715. (Photo by STR / AFP) / China OUT (Photo by STR/AFP via Getty Images)"}, "description": "Can you get the coronavirus twice? Scientists say it's highly unlikely, but China is tightening hospital discharge standards as \"recovered\" patients in multiple provinces appear to get sick again.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/alice-su", "content_tier": "metered", "published_time": "2020-03-13T12:00:32.325", "opinion": "false", "section": "World & Nation", "tag": "Coronavirus Pandemic"}, "twitter": {"card": "summary_large_image", "creator": "@aliceysu", "description": "Can you get the coronavirus twice? Scientists say it's highly unlikely, but China is tightening hospital discharge standards as \"recovered\" patients in multiple provinces appear to get sick again.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/970daa6/2147483647/strip/true/crop/3000x1688+0+154/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa5%2Fe0%2F356450d84c7d970ce2252390642b%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1203429216.jpg", "alt": "This photo taken on February 22, 2020 shows a nurse preparing equipment in an intensive care unit treating COVID-19 coronavirus patients at a hospital in Wuhan, in China's central Hubei province. - China on February 26 reported 52 new coronavirus deaths, the lowest figure in more than three weeks, bringing the death toll to 2,715. (Photo by STR / AFP) / China OUT (Photo by STR/AFP via Getty Images)"}, "site": "@latimes", "title": "They survived the coronavirus. Then they tested positive again. Why?"}, "fb": {"app_id": 119932621434123, "pages": 5863113009, "profile_id": "latimes"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "Can you get the coronavirus twice? Scientists say it's highly unlikely, but China is tightening hospital discharge standards as \"recovered\" patients in multiple provinces appear to get sick again.", "brightspot.contentId": "00000170-a896-d0a7-a1f1-abd631a70000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1584072000.0, "source": "https://www.latimes.com", "summary": ""}