{"url": "https://time.com/5790880/coronavirus-warm-weather-summer/", "text": "It’s officially spring in the U.S. and other parts of the Northern Hemisphere, and many are hoping the warmer weather could slow, or even stop the spread of coronavirus.\n\nPresident Donald Trump, for instance, suggested in February that springtime temperatures could make COVID-19 “miraculously” go away.\n\nSeveral new studies provide some hope that the heat might slow the spread of the virus.\n\nHowever, infectious disease experts say while the factors that cause other viruses to retreat during the summer months could affect this coronavirus in a similar way, there’s no way to be sure. And, even if the virus’ spread does slow as temperatures rise, that doesn’t mean it will be gone for good.\n\nNew studies suggest heat may slow coronavirus\n\nSome early research, which has yet to be peer reviewed, says that higher temperatures and humidity are correlated with a lower rate of COVID-19’s spread.\n\nAn analysis by scientists at the Massachusetts Institute of Technology posted online on Mar. 19, found that the transmission of coronavirus had most frequently occurred in regions with colder annual average temperatures, between about 37° and 63° F. The total number of cases in countries with an average temperature above about 64° F is less than 6%, according to the study.\n\nTwo other recently published studies draw similar conclusions. One study published in March by Chinese researchers found that before the Chinese government began imposing lockdowns in late January, cities that were warmer and more humid reported a slower rate of infection.\n\nAnother, published in mid-March by researchers from Spain and Finland, found that 95% of infections globally have so far occurred at temperatures between about 28° and 50° F, and in dry climates.\n\nHowever, the spread of coronavirus has also shown that hot and humid weather will not stop coronavirus infections entirely. Malaysia has confirmed more than 1,500 cases of the virus; more than 500 people are infected in Indonesia; and in Singapore, where the average temperature is around 80°F year-round, more than 500 cases of the virus have been confirmed, despite rigorous detection methods and strict quarantine rules.\n\nKeep up to date with our daily coronavirus newsletter by clicking here.\n\nWhy cold and flu decrease in the summer\n\nThere’s precedent for the idea that the COVID-19 outbreak will collapse with the onset of summer.\n\nThe common cold is most prevalent in the winter and spring, and influenza is most common during the fall and winter in the U.S., with flu activity peaking between December and February, according to the CDC.\n\nIt appears that COVID-19 is transmitted in the same fashion as the flu and common cold: by close contact with infected people and from respiratory droplets when an infected person sneezes or coughs.\n\nThere’s a variety of reasons that influenza and cold infections plummet in the summer, but a major one is that that warm, humid weather can make it harder for respiratory droplets to spread viruses.\n\n“The droplets that carry viruses do not stay suspended in humid air as long, and the warmer temperatures lead to more rapid virus degradation,” says Elizabeth McGraw, director of the Center for Infectious Disease Dynamics at Pennsylvania State University.\n\nHuman activity also changes in summer months, says Thomas Bollyky, the director of the Global Health Program at the Washington D.C.-based Council on Foreign Relations. People spend less time indoors—where they tend to be in closer contact with each other, making it easier for the virus to spread—in the summer.\n\n‘Premature’ to assume heat will stop COVID-19\n\nBut health experts aren’t so sure that COVID-19, which has infected more than 83,000 people since officials first discovered the disease in December, can be stopped by the onset of summer.\n\nDr. Nancy Messionnier of the Centers for Disease Control and Prevention, warned against assuming the number of cases will slow as the weather warms. “I think it’s premature to assume that,” she said during a call with reporters on Feb. 12. “We haven’t been through even a single year with this pathogen.”\n\nOther health experts that TIME spoke to agree that it’s too early to say if warmer weather will impact the virus’s spread. McGraw, of Penn State University, says there will likely be many factors that determine when and how the outbreak ends. “Rate of virus spread, effectiveness of infection control practices, weather and human immunity will likely all play a role in determining its future,” she says.\n\nAdditionally, because COVID-19 is so new, “there is no natural immunity in the population and thus all bets are off,” says John Nicholls of the University of Hong Kong.\n\nLooking at two other deadly members of the coronavirus family, severe acute respiratory syndrome (SARS) and Middle East respiratory syndrome (MERS), could, Bollyky says, help us understand how COVID-19 may act in the summer heat. “Past coronavirus outbreaks, SARS and MERS, haven’t really exhibited clear evidence of being seasonal,” Bollyky says.”The SARS outbreak did end in July, but it is not clear that weather. MERS does not show any sign of being seasonal.”\n\nIt isn’t summer everywhere at once\n\nThough the largest clusters of the coronavirus are in locations above the equator—mainland China, South Korea, Italy, Japan and Iran—the virus has now spread to all continents except Antarctica. This includes countries like Brazil and Australia in the southern hemisphere.\n\nExperts caution that even if the seasonal change in the northern hemisphere brings a reprieve in the number of cases, it may mean that other places become more susceptible to its spread.\n\n“The southern hemisphere will begin their winter season within the next few months, potentially leading to a global reversal in transmission hotspots,” says Melissa Nolan, a professor of epidemiology at the University of South Carolina’s Arnold School of Public Health.\n\nEven if COVID-19 wanes in summer, it might come back\n\nAnd experts warn that even if COVID-19 becomes less active in the summer, it could return if public health officials do not gain control of the outbreak first.\n\n“If we continue to see sustained transmission in multiple countries, it will be very difficult to eradicate the virus,” says Charles Chiu, a professor of laboratory medicine at the University of California, San Francisco. “There is a risk that it may end up becoming a seasonal virus without global concerted public health interventions to prevent spread.”\n\nHe points to the 2009 outbreak of the H1N1 virus, otherwise known as swine flu, which began in April of that year. He says that as it adapted to the human population, it adopted a seasonal pattern, with most infections now occurring during the winter months.\n\nOthers agree that officials must not be complacent as the summer months approach.\n\n“Policymakers and health officials should not rely on warmer temperatures to save us from COVID-19,” Bollyky, of the Council on Foreign Relations, says. “The only things that can do that are public health preparedness and level-headed policies to reduce the number of people infected, protect healthcare workers, and improve the diagnosis and treatment of those who do get ill.”\n\nPlease send any tips, leads, and stories to virus@time.com.\n\nThe Coronavirus Brief. Everything you need to know about the global spread of COVID-19 Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nWrite to Amy Gunia at amy.gunia@time.com.", "images": ["https://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "https://api.time.com/wp-content/uploads/2020/06/new-zealand-coronavirus-ardern.jpg?quality=85&w=600", "https://api.time.com/wp-content/uploads/2020/02/coronavirus-warm-weather.jpg", "https://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "https://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2020/02/coronavirus-warm-weather.jpg?quality=85&w=1200&h=628&crop=1", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://time.com/img/loading-circle.gif", "https://time.com/img/newsletter-round.svg", "https://api.time.com/wp-content/uploads/2020/06/TIM200615_Floyd.Cover_..jpg?w=500&quality=85", "https://api.time.com/wp-content/uploads/2020/06/protests-coronavirus-test.jpg?quality=85&w=600"], "top_img": "https://api.time.com/wp-content/uploads/2020/02/coronavirus-warm-weather.jpg?quality=85&w=1200&h=628&crop=1", "keywords": [], "authors": ["Amy Gunia"], "canonical_link": "https://time.com/5790880/coronavirus-warm-weather-summer/", "title": "Will Warmer Weather Stop the Spread of the Coronavirus?", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "COVID-19,onetime,overnight,UnitedWeRise20Disaster", "news_keywords": "COVID-19,onetime,overnight,UnitedWeRise20Disaster", "description": "While Trump has suggested that spring weather could stop the spread of coronavirus, infectious disease experts aren’t so sure.", "og": {"title": "Will Warmer Weather Stop the Spread of the Coronavirus?", "type": "article", "site_name": "Time", "url": "https://time.com/5790880/coronavirus-warm-weather-summer/", "description": "Several new studies provide some hope that the heat might slow the virus", "image": {"identifier": "https://api.time.com/wp-content/uploads/2020/02/coronavirus-warm-weather.jpg?quality=85&w=1200&h=628&crop=1", "width": 1200, "height": 628}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5790880/coronavirus-warm-weather-summer/", "description": "While Trump has suggested that spring weather could stop the spread of coronavirus, infectious disease experts aren’t so sure.", "media": "https://api.time.com/wp-content/uploads/2020/02/coronavirus-warm-weather.jpg?quality=85&w=1200&h=628&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5790880/coronavirus-warm-weather-summer/", "title": "Will Warmer Weather Stop the Spread of the Coronavirus?", "description": "Several new studies provide some hope that the heat might slow the virus", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2020/02/coronavirus-warm-weather.jpg?quality=85&w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "https://time.com", "summary": ""}