{"url": "https://ufospotlight.wordpress.com/2020/02/13/chinese-intelligence-officer-reveals-true-magnitude-of-chinas-coronavirus-crisis/", "text": "CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude Of China’s Fake “Coronavirus” Crisis\n\nPosted on February 14, 2020 CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude of China’s Fake “Coronavirus” Crisis\n\nFEBRUARY 13, 2020 ~ ROBERT MORNINGSTAR\n\nCORONA UNMASKED\n\nChinese Intelligence Officer Reveals True Magnitude of China’s Fake “Coronavirus” Crisis\n\nBy Pen Name U u/WuhanvirusDispersal\n\nEdited by 明亮晨星\n\n*******\n\nI am a senior Chinese military intelligence officer and I know the truth about the “coronavirus” outbreak. It is far worse than the media are telling you.\n\nI am a Chinese citizen in Wuhan who occupies — or perhaps occupied — a high-ranking position in military intelligence. I am also a member of the Chinese Communist Party. As a senior official near the top of the Party, I have access to a great deal of classified information and I have been involved in many top secret government projects. I have a doctorate from a leading university in a western country, which is why I am able to write my account in English.\n\nI have information that I believe could lead to the overthrow of my government. It is also relevant to billions of people outside of China, all of whom are now in existential peril.\n\nIt will not surprise you to hear that if my identity were to be revealed, my life would be in grave danger, as would those of my wife and son. I ask you to respect the fact that I have stripped out of this account all facts that would make it easy to identify me.\n\nBy now you will be familiar with the recent outbreak of 2019-nCoV, also known as NCP, or simply “coronavirus”. You will have heard that it originated in Wuhan, an industrial city in China, and that it came from an animal — most likely a bat or a pangolin — that was sold in a wild animal market. You will have been told that it is an influenza-like illness that can in severe cases cause pneumonia, respiratory failure and death.\n\nFinally, you may have heard that although the disease is highly infectious, it is dangerous only to the elderly or to those who have a compromised immune system. The official lethality rate is approximately 2% or so.\n\nAll of that is a bunch of lies concocted by the Chinese state with the tacit support of the U.S. deep state and its friends in the European Union, Russia and Australia, and spread by the docile media in all of those countries.\n\nLet me start by telling you that the world does not operate the way you think it does. Although countries like the US and China vie for global dominance, that competition is restricted to certain limited areas.\n\nIn most ways, the two countries are more interested in cooperation so that they can stop other competing countries from gaining more power. They also have a shared interest in keeping real power out of the hands of their “ordinary” citizens. To this end, they have many different mechanisms by which they control the overwhelming majority of their media outlets. The Americans in particular have perfected the art of creating made-up “divisions” between their two main parties which are designed to hide the fact that both serve the same masters.\n\nThese same nations also posses technology that is far more advanced than you can imagine and which is kept carefully hidden from public view. This includes advanced artificial intelligence capable of undermining and deciding any election in the world; biological and chemical agents that can manipulate and control the thinking patterns and behaviours of citizens to terrifying degrees; highly sophisticated manipulation techniques using hypnotic practices entirely unknown to the public; and other things that I will not go into now.\n\n*******\n\nMy point is that the great nations do not compete so much as work together. Their principal goal is to shield the true workings of the world from the “uninitiated” public.\n\nJust to give you one example, there aren’t actually any nuclear weapons anywhere in the world. The U.S. and the Soviet Union scrapped them all in the 1970s, as did their client states. Everyone realized that those weapons could not be used without destroying the whole world, so there was no need for them; but by pretending that they still had them, the big players were able to keep the non-nuclear powers in line.\n\nLet me return to the virus.\n\nLast year, large-scale anti-government protests erupted in Hong Kong.\n\nThe Standing Committee of the Chinese Communist Party considered these to be a grave threat to the integrity and stability of the motherland. The U.S. government and the EU both knew that the Chinese were secretly working on a biological agent that was supposed to make the protesters docile and obedient. Without going into detail, I worked on that project. We tried to develop a sort of spray that could be dispersed from helicopters or drones and that would lead to mental retardation and behavioural change.\n\nNaturally, as Hong Kong is one of the most open and international cities in the world, the Party decided that it was too risky to release the agent in Hong Kong without first testing it. For this, it needed a great number of human guinea pigs. Two groups were identified for this.\n\nFirst, we rounded up a large number of so-called “islamic radicals” in Xinjiang Province and took them to what we called “training camps.”\n\nWe had already been using these camps for human experimentation for several years, but the Hong Kong protests meant that we redoubled our efforts. We exposed the inmates to various “alpha” experimental agents. As these were odourless and invisible, the subjects were not aware that they were taking part in medical trials.\n\nEscape from Xinjiang: Muslim Uighurs Speak of China Persecution\n\nThe resulting high rates of cancer, premature dementia, suicidal depression and death by organ failure could easily be suppressed, as the camps are located in very remote parts of our motherland.\n\nOnce the initial experiments had yielded a “beta” agent, it was transported to Hubei Province, where it was deployed in a special military testing facility outside the city of Wuhan. This was not even a particularly well-kept secret: the existence of this facility has been reported in international news. Even the fact that it is located close to the wild animal market is a known fact.\n\nBy then our President had already introduced a “social credit” system that allowed us to identify disloyal, counter-revolutionary and bourgeois elements in our society. Using the social credit scores — which are taken from online activity, electronic shopping behaviour and reports from informers in civil society — we selected some of the worst offenders. These included human rights lawyers and activists, Christians, homosexuals, artists, intellectuals, people who speak foreign languages, and other undesirables.\n\nOnce these troublemakers had been collected and placed in the testing facility, we exposed them to the Agent, which is biochemical in nature and spread in an invisible aerosol, akin to certain viruses. Initial results were encouraging, as we saw significant cognitive decline and reduction in higher mental processing facilities. Essentially, our undesirables were becoming mildly mentally disabled, which is precisely the effect we wanted to produce in order to pacify the restive population of Hong Kong.\n\nUnfortunately, it quickly became apparent that the Agent also had other effects. About one week after the retardation set in, our subjects developed major anxiety and panic attacks. Eventually they developed symptoms akin to those of paranoid schizophrenics. At that point, their bodies rapidly deteriorated. They developed massive internal bleeding; the walls of their arteries dissolved; they bled out of their eyes and orifices, and their tissue disintegrated.\n\nTo put it in a more direct Western manner, they started to melt.\n\nDeath usually occurred through multiple organ failure. This was preceded by at least five days of severe agony which could not be alleviated by painkillers. It was at this time that I first violated our protocol: one subject, an elderly lady who had published defamatory cartoons of our President, begged me for death with such insistence that I took pity and shot her. I was reprimanded, but fortunately the complaint was dropped when I agreed to reimburse the cost of the bullet. I swore to myself never again to show such unnecessary emotion.\n\nWe decided that our Agent was unusable. It was far too destructive for our purposes. We wanted the population of Hong Kong to submit to us; we did not want to exterminate it.\n\nNaturally, our American friends had by then taken an interest in our work and asked us for a sample for their own research and testing purposes. They hinted that they wished to use it to resolve certain difficulties in Venezuela. Normally we would have agreed, as we maintain friendly relations with the CIA, but given the extremely toxic nature of the Agent, we declined.\n\nThis, as it turned out, was a grave mistake. The CIA was convinced that we had developed something very powerful and wanted to keep it to ourselves. They offered a great deal of money to one of our researchers.\n\nFoolishly, he agreed to sell them a specimen. We found out just in time for the handover and tried to stop it from happening. In the ensuing shoot-out — don’t bother to look for it in the news, it was never reported anywhere — several dozen people were killed.\n\nMore importantly, however, the Agent escaped!\n\nThe shoot-out took place at the wild animal market, which has been reported as the location of the “animal-to-human” transmission that started the outbreak. But, of course, there was no such transmission; it was just the location where the CIA was supposed to receive the sealed vial containing the Agent. The vial shattered when it was dropped by the traitor who had agreed to sell it to the Americans.\n\nBy now I understand you will be sceptical. If I really am who I say I am, why would I be sharing this information on the internet?\n\nLet me assure you that I am no friend of the Western system of governance. I love my motherland and I am loyal to the Communist Party. It has lifted hundreds of millions of my compatriots out of squalor and poverty. However, I am also a human being and I have a conscience.\n\nMost importantly, I have a wife and a son.\n\nOnce we realised that the Agent had escaped and would start to spread, we swiftly put all of Wuhan into lockdown. I was one of those tasked to manage the fallout of the contamination.\n\nOf course, we could not keep such a huge undertaking secret, so we decided to order our state media to report that a “coronavirus” had broken out in Wuhan.\n\nIn reality, of course, there is no “coronavirus”. It was all made up.\n\nIt was one of my colleagues who came up with the genius idea of pretending that people with the common flu suffered from the coronavirus. This allowed us to hide the true nature of the disease. Let me explain.\n\nIt is currently flu season in China. When we realised that we could no longer control the spread of the Agent, we sent our men to all the hospitals and instructed all doctors to diagnose every case of the common flu as “coronavirus”. We came up with a new name — 2019-nCoV — and handed out “factsheets” that described a made-up illness.\n\nThe result of this decision was that tens of thousands of individuals who were simply suffering from a cold or flu were now diagnosed as having a mysterious coronavirus that, although infectious, was not often lethal. While this frightened the public, it allowed us to push the narrative that the disease was not that deadly; it also gave us time to prepare for the catastrophe that was sure to come by imposing a lockdown on Wuhan and other cities in Hubei Province.\n\nYou have not heard this in the news — and given the size of Wuhan, with its population of 11 million, it is not known even to many of the residents — but within days thousands upon thousands were infected and before long they suffered the agonising deaths that I have already described.\n\nWithin a week, there were so many corpses that we did not know what to do with them, so we ordered the surviving social credit prisoners to drive the bodies into the countryside and bury them in mass graves.\n\nBut it was very difficult to keep this activity secret, and we could not even keep up as there were so many corpses.People’s Daily, China\n\n@PDChina\n\nFull-front disinfection work has started in #Wuhan, an effort to contain the spread of #coronavirus\n\n6,021 8:15 AM – Feb 10, 2020 Twitter Ads info and privacy4,366 people are talking about this\n\nWe planted a story that five million residents had “fled” Wuhan. In reality, of course, many of those people had died from the Agent.\n\nI was working around the clock helping to orchestrate this cover-up. When I think back to my actions now, I feel great shame. At the time I still believed that I was fighting for my motherland and that the rule of the Party was right and just. But deep down, I had already begun to have doubts.\n\nMy faith in the Party was shaken even more deeply when I learnt what had happened to Dr Li Wenliang.\n\nLi Wenliang: Doctor who warned about coronavirus outbreak dies after being infected by virus\n\nWhistleblower who was confronted by police becomes latest victim of deadly outbreak\n\nhttps://www.independent.co.uk/news/world/asia/li-wenliang-coronavirus-outbreak-dead-wuhan-whistleblower-a9322496.html\n\nDr Li Wenliang was one of the few doctors who refused falsely to diagnose flu patients with the “coronavirus”. As a punishment, he was sent to help transport dead bodies to mass graves. The expectation was that he would be infected with the Agent and die an agonising death, but to our great surprise, he did not contract the illness.https://www.youtube.com/embed/Z_8LnnHMeG4?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent\n\nYou have of course read that he died of “coronavirus.” You have been misinformed. A sergeant of the People’s Armed Police injected him with a mixture of heroin and mercury that caused his lungs to deflate.\n\nWhen I found out about this I became unsure whether or not I was doing the right thing. While I believe that it is appropriate for a government to rule with a severe hand, I do not think that it was right to kill Dr Li. He was a compassionate and kind man and he cared about his patients; how can our motherland not benefit from having such a doctor?\n\nI shared my concerns with my wife, but she convinced me that I should not say anything to my superiors. She said that it was too dangerous; that they valued loyalty above everything else; and that I would only find trouble if I admitted to my doubts about their practices. She also pointed out that we benefited from priority medical treatment. As senior officials, we received regular supplies of the highly-sophisticated hazmat masks that are the only known technology that can prevent infection. She implored me to think of our son, who is still small. If I spoke out and were caught, our lives would be at risk.\n\nAround the same time, it became clear that the Agent was entirely beyond our control. It was spreading like wildfire throughout Hubei Province and beyond, infecting tens of millions and causing them all to die.\n\nI understand that what I just said is difficult to believe, because you have been told that there have been only about 50,000 infections, and far fewer deaths.\n\nBut these are the influenza infections that have been falsely passed off as the non-existent “coronavirus.” The Agent is far, far more contagious than that, and its fatality rate, unlike the “coronavirus”, is not 2%.\n\nNo, its fatality rate is 100%. Nobody recovers from it. Everybody who contracts it dies.\n\nAnd a lot of people are contracting it.\n\nHubei Province lies in ruins. The various travel restrictions and lockdowns that have been imposed were not created to stop the spread of the Agent — none of them can stop it, not embargoes, not face masks or hand sanitiser — but to stop the survivors from seeing the catastrophe with their own eyes.\n\nDrones are being used to heard people toward -containment centers.\n\nhttps://videos.dailymail.co.uk/video/mol/2020/01/31/8187835495158297293/640x360_MP4_8187835495158297293.mp4?_=3?\n\nI am part of the greatest cover-up in human history: the hiding of the deaths of tens of millions. Very soon, Hubei Province will be no more than a giant mortuary, and the truth will come out.\n\nFor me, the turning point came when the Party told yet another lie, and that lie was too dreadful even for me to accept.\n\nYou may have heard that China built a new hospital, called Huoshenshan Hospital, in Wuhan, in order to provide additional quarantine and isolation facilities for infected patients. You may have heard that they built it in only ten days.\n\nThat too is a lie.\n\nSure, they did build something in six days. But it was not a “hospital. ” The true nature of the building was considered “top secret.”\n\nInitially, I was naive enough to believe that the Party was demonstrating its compassion and care for the people. But then my superiors sent me to Huoshenshan.\n\nI was shown around the installation by a military police officer called Corporal Meng (this is not his real name). It was there that I saw the truth.\n\nAs I have mentioned, the only way to protect oneself from the Agent is by wearing a special protective mask that is entirely unlike those available commercially. Even medical professionals do not have access to it. It is available only to biomedical warfare researchers and it contains extremely advanced technology.\n\nThese masks need to be kept at a particular temperature to offer full protection, and lose their effectiveness very quickly. As I have also already said, one of the benefits of my position was that both my family and I had access to regular supplies, which is why were safe when compared to civilians, doctors and even lower-level government officials, all of whom wore utterly ineffective surgical masks in the misguided belief that they would protect them.\n\nAnd so, wearing this special equipment, I went to Huoshenshan with Corporal Meng.\n\nWhatever you want to call that place, it is not a hospital.\n\nSure, the entrance looks like a hospital and in the ward at the front of the complex, there are what appear to be normal medical beds. There, thousands of infected patients lie, all of them in the early stages of the disease. I walked along those long, white corridors next to Corporal Meng, his angular face dispassionate in his military fatigues, and saw hundreds upon hundreds of identical hospital beds on which squirmed the terrified and diseased inhabitants of Wuhan. Their cries and pleas haunt me in the long nights in which I now am unable to sleep.\n\nBut this was merely the beginning. Eventually the Corporal took me to the rear of this front section. There, locked metal gates led to what he called the “middle section”. The patients in the front are unaware of its existence. It is there that the more advanced cases are kept, in what most closely resembles a mental asylum.\n\nImmediately upon entering this part of Huoshenshan, I was struck by the dim lighting and stench of vomit and human waste. Here the unfortunates roamed freely, their minds gradually disintegrating in endless panic attacks and psychotic episodes. Here too there were no more doctors, merely gorilla-faced men in black uniforms who belonged to some secret branch of the military police I had never heard of.\n\nThey appeared to have been selected for their cruelty, for they beat and degraded the patients in the most sadistic manner. Many of the inmates had regressed to childlike states and lay on the floor weeping like infants and begging for compassion that they did not receive.\n\nThere was cruel pleasure in the eyes of these thugs as they brutalised the unfortunates. They beat them with batons, sprayed pepper spray into their eyes and kicked them with their steel-capped boots. As I was from military intelligence, the guards did not even attempt to hide their activities. They even invited me to join; in every way, they treated me as one of them.\n\nYes, one of them. I stood in the grey staff bathroom of Huoshenshan and looked into a cheap mirror and asked myself — is this really what you are? Are you really like them?\n\nBut the violence was not merely an expression of sadism, for the poor inmates were not there to be cared for.\n\nThey were there to work.\n\nThere was one more set of doors, and beyond them lay what the Corporal called the “Core.” And it was there that I saw it — piles and piles of dead bodies, stacked on top of one another all the way to the ceiling. There were men, women and children, elderlies and toddlers, rich and poor, beautiful and misshapen, proud and humble.\n\nThey were all of them dead. Our Agent made no distinction between any of them.\n\nI gasped when the Corporal led me to the Core. I cannot count how many there were, but it was many, many thousands. And in the midst of the piles of corpses was a kind of path, and I heard a roaring sound in the distance. The miserable patients from the middle section picked up the dead and carried and dragged them away into the dark, even as the guards beat them with truncheons.\n\nIt took me a little while before I grasped what was happening. I simply could not believe what lay at the end of that path in the Core.\n\nIt was an enormous furnace, with great fires roaring within.\n\nOne by one, their minds destroyed and their bodies twisted, the dying men and women carried the corpses to the furnace and cast them inside in a doomed attempt to hide the dreadful truth. I saw several of them collapse from exhaustion only for their lifeless bodies to be added to the mountains of corpses on both sides. In a seemingly endless line they went, their emaciated bodies clad in grey overalls, their backs bent under the weight of their dreadful cargo. Many howled and groaned in terror and their voices joined in a sorrowful cacophony that lingered over the roar of the fires.\n\nIn deep shock, I stared at the boundless horror before me. Beside me stood Corporal Meng, his freshly-shaved face as emotionless as before. When I turned to face him, he looked at me. His mouth smiled, but his eyes did not.\n\n“We use the energy to operate Huoshenshan,” he said. “We save the state considerable resources in this way. And look,” — he waved at the gallery of the dead — “there are so many of them here. You could almost describe it as renewable energy.” He laughed and waved his hand in a strangely camp gesture.\n\nI stood speechless and stared at the infernal scenes before me. Men in black uniforms screamed like daemons at the wretches who were disposing of the corpses for them. They stripped the dead of anything that had value — jewellery, cash, expensive clothing — and tossed these items onto an enormous pile next to the furnace. When I asked the Corporal what would be done with the items, they said that they would be used to pay for the “healthcare expenses” incurred by the patients’ stay in Huoshenshan.\n\nI vomited in the toilet. When I flushed and came out of the stall, Corporal Meng stood by the door and looked at me. His face was as blank as before, but in his eyes I thought I registered a very faint trace of contempt. You are ten years my senior, the look said, but you are soft.\n\nI thanked him for his service and went home.\n\nWhen I arrived, I saw that I had received hundreds of updates on the encrypted device the Party uses to communicate to insiders. The news were unimaginably grim. The State Legal and Economic Commission had allocated funds for the construction of dozens of facilities like Huoshenshan all throughout China.\n\nThe Agent had spread not only to every single province of the motherland, but to most other nations in the world. Fortunately, we had agreements in place with other governments — they agreed to pretend that the infections were due to a coronavirus. They were just as worried as we were that a panic might break out in their countries. The Americans, in particular, were terrified that the S&P 500 might decline. This, they said, would be unacceptable in an election year, so we could count on their full support.\n\nOf course the World Health Organisation also helped us. For a long time, the only issue with the WHO has been that we have been locked in a contest with the Americans about who bribes them more. They released all sorts of sophisticated misinformation about having decoded the DNA of the so-called coronavirus. All this has allowed us to stave off a global panic.\n\nFor now.\n\nYet the situation was worsening with astonishing speed. I am reluctant to reveal too much on this point, as it would make it too easy for my enemies to identify me, but we quickly began to implement measures to protect our most senior leaders. If you look at the world news, you will see that Xi Jinping, our President, disappeared for approximately one week after the outbreak, before being seen again with the leader of Cambodia.\n\nYou should know that the person who met the Cambodian leader was not President Xi. It was a body double who had, for many years, been trained to look and sound just like our President. President Xi is of course not careless enough to risk his own death. He is safely ensconced in a secret bunker underneath Zhongnanhai, the headquarters of the Party in Beijing.\n\nNor was he the only leader who is in hiding. In fact, I can assure you that over half of all senior Party members are currently being imitated by trained actors who are following instructions given to them via special implants.\n\nDo you really think that our Prime Minister would risk his life by going to Wuhan?\n\nAll of this means that our government has become utterly paralysed and the functions of the state have been taken over by the military.\n\nIt became clear to me that our efforts were pointless. Yes, the lockdowns, travel bans and targeted assassinations of rebellious journalists allowed us to hide the true situation in Wuhan; but I knew that this would not last.\n\nOnce the mass deaths begin in the rest of the world — in our estimation, this should happen within the next week or so — everyone will know the truth. It will become clear that we cannot protect ourselves from the Agent.\n\nSurgical masks, hand sanitiser, gloves — nothing can stop it. Nothing except the special hazmat masks, but those cannot be produced in anything like sufficient quantities. You, an ordinary person, will never even receive one, let alone a sufficient number to see you through the coming holocaust.\n\nFor those of you reading this, therefore, all I can suggest is that you keep your loved ones close to you. Hug them, tell them what they mean to you. Enjoy the time you have left with them. It is not typical in Chinese culture to express one’s feelings in this way, but I have learnt the importance of such gestures.\n\nI promised my wife that I would show this document to her before I posted it.\n\nYet I broke my word.\n\nI hear her weep in loud, hoarse sobs in the bedroom, and the keyboard of my laptop is wet with my own tears. Not long ago, we received results of the regular tests that are part of our “priority medical treatment”, and we learnt that my son had been infected with the Agent.\n\nThe military police that has supplied me with the special protective mask had been giving expired and ineffective masks to my son, masks that senior officials had already worn and then discarded when they ceased to protect them. My own masks, on the other hand, had always been of the necessary quality.\n\nI suppose they decided that my son was of lower priority than me. I suppose my son could not help them with their cover-up.\n\nWe had long ago decided that we would be different — we would be honest with him, always. And so when he asked us, we told him the truth. We told him that he was very sick. He asked more, and we told him he would not get better.\n\nHe continued asking, and we told him that he would die. He is very small, but he was old enough to understand.\n\nHis terrified wails will haunt me for the rest of my miserable days in this world.\n\nLet them come. Let them do with me as they will. I no longer care.\n\nBy\n\n*******\n\nEditor’s Postscript\n\nHere is the True Face of Communism.\n\nThe videolinked below shows scenes from Wuhan, China, and graphically supports all the assertions made by the anonymous Chinese Military Intelligence Officer presented above.\n\nThe viewer should “Cut to the chase” at the 54 minute Time Mark to see what’s really going on in Red China, emphasis on “Red” as in “bloody China.”These scenes show the ruthlessness of the Chinese Police conducting forced detainment of people suspected of having the Corona Flu.enforcing. Even pets are being thrown out of windows on rumors that pets are spreading the disease (not true).This video also shows clear evidence of intentional contamination and spreading of disease as seen in the elevator with Chinese operatives spitting on tissue and smearing it on elevator buttons, as well as, people spitting in food containers and into food service centers.The following video images reveal the real face of Chinese Communism, which has become today the worst “Death Cult” ever known in the long history of Mankind.\n\n明亮晨星\n\n*******\n\nCorona-unMaskeD\n\nGo to the 54 minute Time Mark to get a glimpse of\n\n“Hell on Earth”\n\nA Harvard Professor, The DOD & NIH, A Chinese Spy, 21 Stolen Vials Of “Biological Research”, & Nanoscience\n\nHere are some dots in desperate need of connecting, even if the DOJ says it’s all “separate”. Oh yeah, and they tie into the Wuhan University of Technology…\n\nFrom the DOJ:\n\nHarvard University Professor and Two Chinese Nationals Charged in Three Separate China Related Cases\n\nThe Department of Justice announced today that the Chair of Harvard University’s Chemistry and Chemical Biology Department and two Chinese nationals have been charged in connection with aiding the People’s Republic of China. Dr. Charles Lieber, 60, Chair of the Department of Chemistry and Chemical Biology at Harvard University, was arrested this morning and charged by criminal complaint with one count of making a materially false, fictitious and fraudulent statement. Lieber will appear this afternoon before Magistrate Judge Marianne B. Bowler in federal court in Boston, Massachusetts. Yanqing Ye, 29, a Chinese national, was charged in an indictment today with one count each of visa fraud, making false statements, acting as an agent of a foreign government and conspiracy. Ye is currently in China. Zaosong Zheng, 30, a Chinese national, was arrested on Dec. 10, 2019, at Boston’s Logan International Airport and charged by criminal complaint with attempting to smuggle 21 vials of biological research to China. On Jan. 21, 2020, Zheng was indicted on one count of smuggling goods from the United States and one count of making false, fictitious or fraudulent statements. He has been detained since Dec. 30, 2019.\n\nhttps://techstartups.com/2020/02/10/us-government-charges-4-chinese-military-spies-hacking-credit-bureau-equifax/CHINESE CHARACTER VERSIONOF“CORONA-UnMasked”\n\n日冕未遮盖\n\nEdited byRobert D. Morningstar\n\n明亮的晨星\n\n日冕病毒遮盖\n\n中国情报官员揭露中国假“冠状病毒”危机的真实面目通过\n\nu / Wuhanvirusthrowaway\n\n明亮晨星\n\n编辑\n\n*******\n\n我是中国军事情报高级官员，我知道“冠状病毒”爆发的真相。 这比媒体告诉你的要糟糕得多。我是武汉的中国公民， 在军事情报领域担任高级职位。我也是中国共产党的成员。作为接近党的最高层的高级 官员，我可以获得大量的机密信息，并且参与了许多最高机密的政府项目。 我拥有西方国家一流大学的博士学位，这就是为什么\n\n我能够用英语写我的帐户的原因。 我掌握的信息可能会导致我的政府被推翻。这也与中国境外数十亿人息息相关， 他们现在都面临着生存的危险。 听到我的身份被揭露，我的生命和我妻子和儿子的生命将面临极大的危险， 这不会让你感到惊讶。我要求您尊重我已经从该帐户中删除所有易于识别我的事实。 到目前为止，您将熟悉最近爆发的2019-nCoV（也称为NCP）或简称为“冠状病毒”。 您会听说它起源于中国的工业城市武汉，并且来自一种在野生动物市场上出售的动物 -最有可能是蝙蝠或穿山甲。 您会被告知这是一种类似于流感的疾病，在严重的情况下会导致肺炎，呼吸衰竭和死亡。 最后，您可能已经听说，尽管该疾病具有很高的传染性，但仅对老年人或免疫系统受损 的人才有危险。官方的致死率约为2％左右。 所有这些都是中国国家在美国深层国家及其在欧盟，俄罗斯和澳大利亚的朋友的默契支 持下炮制的一堆谎言，并由温顺的媒体在所有这些国家传播。\n\n*******\n\n比赛仅限于某些特定区域。在大多数方面，两国对合作更感兴趣，因此它们可以阻止其 他竞争国家获得更大的权力。他们也有共同的利益，就是将真正的权力掌握在“普通”公 民的手中。为此，他们拥有许多不同的机制来控制绝大多数媒体。尤其是美国人， 已经完善了在两个主要政党之间建立人为“分工”的艺术，这是为了掩盖双方都担任同 一大师的事实。 这些国家/地区还拥有比您想像的要先进得多的技术， 并且应谨慎地将其隐藏在公众视野之外。 这包括能够破坏和决定世界上任何选举的先进人工智能； 可以操纵和控制公民思维方式和行为的恐怖程度的生物和化学制剂； 使用完全不为公众所知的催眠方法的高度复杂的操纵技术； 和其他我现在不会讨论的事情。\n\n******\n\n我的观点是，伟大的国家相互竞争不如共同努力。他们的主要目标是保护世界的真实运 作免受“未启动”的公众的侵害。仅举一个例子，世界上实际上没有任何核武器。 美国和苏联及其客户国在1970年代都将它们全部报废。每个人都意识到，如果不破坏整 个世界就无法使用这些武器，因此没有必要。但是通过假装他们仍然拥有这些大国， 大国能够使非核大国保持一致。让我回到病毒。 去年，香港爆发了大规模的反政府抗议活动。中国共产党常务委员会认为这是对祖国完 整与稳定的严重威胁。美国政府和欧盟都知道中国人正在秘密地从事一种生物制剂的研 究，这种生物制剂应该使抗议者服从和服从。在不详细介绍的情况下，我从事该项目。 我们试图开发一种可以从直升机或无人机上散落的喷雾剂，这种喷雾剂会导致智力低下 和行为改变。 当然，由于香港是世界上最开放和最国际化的城市之一，该党认为在不首先进行测试的 情况下释放该代理人是太冒险了。为此，它需要大量的人类豚鼠。为此确定了两组。 首先，我们在新疆省搜集了大量所谓的“伊斯兰激进分子”，并将其带到我们所谓的“训练 营”。 我们已经将这些营地用于人体实验已经有几年了，但是香港的抗议活动意味着我们加倍 努力。我们将囚犯暴露于各种“阿尔法”实验剂下。 由于它们无味且无形，因此受试者不知道他们正在参加医学试验。\n\n逃离新疆：穆斯林维吾尔人谈到对中国的迫害\n\nhttps://www.aljazeera.com/indepth/features/escape-xinjiang-muslim-uighurs-speak-china-persecution-180907125030717.html", "images": ["https://0.gravatar.com/avatar/0ad72602531bde17bef4a7f673b72059?s=60&d=&r=G", "https://2.gravatar.com/avatar/b25ee5ce32060f43dd28cc95ce187561?s=60&d=&r=G", "https://1.gravatar.com/avatar/4527eeab3a86225e290b1dd64c7acb57?s=60&d=&r=G", "https://0.gravatar.com/avatar/630f9f0ff2c4c8b28808bac35f7e857c?s=60&d=&r=G", "https://0.gravatar.com/avatar/9726f898797470223e3c4f26298898e2?s=60&d=&r=G", "https://i0.wp.com/graph.facebook.com/v2.9/10163164294995523/picture?q=type%3Dlarge%26_md5%3Dfe5c06de14353364f9e6b4bb8b824c35&resize=60%2C60", "https://1.gravatar.com/avatar/dc6894083195735dac33e4b2038a106c?s=60&d=&r=G", "https://1.gravatar.com/avatar/7c94f4c09591b80bb766dbb2e9887da6?s=60&d=&r=G", "https://0.gravatar.com/avatar/3027e064ae792a38320fe2a0a3d3ef05?s=60&d=&r=G", "https://0.gravatar.com/avatar/3373e33452baaa52848c964c83e4df2d?s=60&d=&r=G", "https://ufospotlight.files.wordpress.com/2020/02/photos-extra-vampireblood-58574548_1021268251594025_8415094693947244544_n.jpg?w=1462", "https://2.gravatar.com/avatar/2f56886378bece63f7ad9f973d6f7d6b?s=60&d=&r=G", "https://0.gravatar.com/avatar/fcea69fb3d290b682a27e55bc0c6432b?s=60&d=&r=G", "https://2.gravatar.com/avatar/e031dd94193532de563f6dcd36909923?s=60&d=&r=G", "https://2.gravatar.com/avatar/280dcb255738f483f77e178059274fdb?s=60&d=&r=G", "https://1.gravatar.com/avatar/afcf7c29ddfdfe4c9cbc332feda00406?s=60&d=&r=G", "https://0.gravatar.com/avatar/96f016a5ec73fd5b193c6c2a6ba7b9da?s=60&d=&r=G", "https://0.gravatar.com/avatar/9913cac1387680b5c926f10adb9527ff?s=60&d=&r=G", "https://techstartups.com/wp-content/uploads/2020/02/Chinese-spies-charged-with-hacking-Equifax.jpg", "https://0.gravatar.com/avatar/0a29c7f0e04e595ab6b0d20d49fd06f8?s=60&d=&r=G", "https://1.gravatar.com/avatar/a441557145be7e14c512a26ff0ce6bdd?s=60&d=&r=G", "https://2.gravatar.com/avatar/8d39f27d79e921e46e83b920f02d10e0?s=60&d=&r=G", "https://1.gravatar.com/avatar/77c1ab99867bd3bc41bafb4823e8de19?s=60&d=&r=G", "https://1.gravatar.com/avatar/4359bc496596212cc61e43dd6312dad2?s=60&d=&r=G", "https://www.aljazeera.com/mritems/imagecache/mbdxxlarge/mritems/Images/2018/9/7/e1214929e8724600ba4483d015d70f31_18.jpg", "https://0.gravatar.com/avatar/99f090b58084730b0d5527d35c9ec294?s=60&d=&r=G", "https://2.gravatar.com/avatar/e9394016c8d5c98502d0949ccabb2d9b?s=60&d=&r=G", "https://1.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=25&d=&forcedefault=y&r=G", "https://1.gravatar.com/avatar/738d50ffbb284cfc2f266a3337609335?s=60&d=&r=G", "https://1.gravatar.com/avatar/704dd75c87c82929981ee692d3df9e6a?s=60&d=&r=G", "https://1.gravatar.com/avatar/d5674dffd8f1653d29ae98ce9a56a2bc?s=60&d=&r=G", "https://i2.wp.com/graph.facebook.com/v2.9/10153719485556791/picture?q=type%3Dlarge%26_md5%3D19587034b3a2152b81963234f40dd36f&resize=60%2C60", "https://1.gravatar.com/avatar/a37863bacd7ffa3fa0ed161b933040fa?s=60&d=&r=G", "https://pbs.twimg.com/ext_tw_video_thumb/1226897624239935497/pu/img/bJTGB3pvBsqfb6sF?format=jpg&name=small", "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcTFqCGEv2698oiSNgHbTqc7E2p6AO0zOkq_UV-8gQ37hSl5JJrX", "https://0.gravatar.com/avatar/cd3b8fe618a311d3411f0f1bcc57e9af?s=60&d=&r=G", "https://0.gravatar.com/avatar/f9374c8d9ab9d46b5dcb1463d660bd31?s=48&d=&r=G", "https://1.gravatar.com/avatar/d0849ed022061d8420d744b75bae3e30?s=60&d=&r=G", "https://ssl.gstatic.com/mail/emoji/v7/png48/emoji_u1f441.png", "https://i0.wp.com/lh3.googleusercontent.com/-i_oPNeEFwF0/AAAAAAAAAAI/AAAAAAAAAAA/ACHi3rdezpNA3zSD1YU5A7cXYMAJNqKl8w/photo.jpg?resize=60%2C60&ssl=1", "https://1.gravatar.com/avatar/d53e9fa17e1dd817e5981feb02496c74?s=60&d=&r=G", "https://nationalinterest.org/sites/default/files/styles/desktop__1260_/public/main_images/RTX2NOMV.jpeg?itok=UU0sowgM", "https://1.gravatar.com/avatar/d7d451ae4164ef769e9daee7fae5f726?s=60&d=&r=G", "https://2.gravatar.com/avatar/57456dfafaf8acd37904aedbdefca68e?s=60&d=&r=G", "https://1.gravatar.com/avatar/d486cee5b37e74313ec633ab9831bf22?s=60&d=&r=G", "https://0.gravatar.com/avatar/3c2bbd2c6d8e4ca83767b6410b06e33f?s=60&d=&r=G", "https://0.gravatar.com/avatar/38b801e22f4841b4fdf8f70191748869?s=60&d=&r=G", "https://0.gravatar.com/avatar/c3fb630425ed1eb8026cafef8880ca1f?s=60&d=&r=G", "https://pixel.wp.com/b.gif?v=noscript", "https://www.redditstatic.com/desktop2x/img/renderTimingPixel.png", "https://0.gravatar.com/avatar/cd812676ec4826624b34b9ce89c7ba29?s=60&d=&r=G", "https://1.gravatar.com/avatar/ddb23ad005ac4120bfecfb0fa1dc67cf?s=60&d=&r=G", "https://cdn.i-scmp.com/sites/default/files/styles/768x768/public/d8/images/methode/2019/08/12/e6592f96-bcd9-11e9-8f25-9b5536624008_image_hires_201546.jpg?itok=kkEd0AnH&v=1565612167", "https://0.gravatar.com/avatar/c148f26eacdc6256db1b54a563ba23b7?s=60&d=&r=G", "https://1.gravatar.com/avatar/181822281252f77ae6ae1c08c45499d0?s=60&d=&r=G", "https://1.gravatar.com/avatar/4c6522f314662263463d1e4c6330b8c3?s=60&d=&r=G", "https://0.gravatar.com/avatar/6e08687529bc1d58a8db8bab3a1f6abb?s=60&d=&r=G"], "top_img": "https://nationalinterest.org/sites/default/files/styles/desktop__1260_/public/main_images/RTX2NOMV.jpeg?itok=UU0sowgM", "keywords": [], "authors": [], "canonical_link": "https://ufospotlight.wordpress.com/2020/02/13/chinese-intelligence-officer-reveals-true-magnitude-of-chinas-coronavirus-crisis/", "title": "CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude of China’s Fake Coronavirus Crisis – 包含中文字符版本", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress.com", "og": {"type": "article", "title": "CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude of China’s Fake Coronavirus Crisis – 包含中文字符版本", "url": "https://ufospotlight.wordpress.com/2020/02/13/chinese-intelligence-officer-reveals-true-magnitude-of-chinas-coronavirus-crisis/", "description": "CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude Of China’s Fake “Coronavirus” Crisis Posted on February 14, 2020  CORONA UNMASKED: Chinese Intelligence Officer Reveals True Mag…", "site_name": "The UFO Spotlight On...", "image": {"identifier": "https://nationalinterest.org/sites/default/files/styles/desktop__1260_/public/main_images/RTX2NOMV.jpeg?itok=UU0sowgM", "alt": "Image result for chinese military intelligence officer"}, "locale": "en_US"}, "article": {"published_time": "2020-02-13T08:36:41+00:00", "modified_time": "2020-05-30T03:07:53+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"text": {"title": "CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude of China’s Fake Coronavirus Crisis – 包含中文字符版本"}, "image": {"identifier": "https://nationalinterest.org/sites/default/files/styles/desktop__1260_/public/main_images/RTX2NOMV.jpeg?itok=UU0sowgM&w=144", "alt": "Image result for chinese military intelligence officer"}, "card": "summary"}, "fb": {"app_id": 249643311490}, "application-name": "The UFO Spotlight On...", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=WordPress.com Forums;action-uri=http://forums.wordpress.com/;icon-uri=https://s1.wp.com/i/favicon.ico", "description": "CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude Of China’s Fake “Coronavirus” Crisis Posted on February 14, 2020  CORONA UNMASKED: Chinese Intelligence Officer Reveals True Magnitude of China’s Fake “Coronavirus” Crisis FEBRUARY 13, 2020 ~ ROBERT MORNINGSTAR CORONA UNMASKED Chinese Intelligence Officer Reveals True Magnitude of China’s Fake “Coronavirus” Crisis By  Pen Name U  u/WuhanvirusDispersal Edited by  明亮晨星 *******…"}, "movies": ["https://www.youtube.com/embed/rKek0Y30Ctwversion3rel1fs1autohide2showsearch0showinfo1iv_load_policy1wmodetransparent?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": 1581570000.0, "source": "https://ufospotlight.wordpress.com", "summary": ""}