{"url": "https://www.huffpost.com/entry/corona-beer-coronavirus-poll_n_5e598955c5b6450a30be6b33", "text": "A buzzy statistic about Americans ditching Corona beer for fear of coronavirus doesn’t quite hold up under sober analysis.\n\nOn Friday morning, CNN tweeted that “38% of Americans wouldn’t buy Corona beer ‘under any circumstances’ because of the coronavirus” ― a claim that promptly went, well, viral. The poll, conducted by 5W Public Relations, saw coverage in multiple media outlets.\n\nMany Twitter users seemed delighted for an excuse to poke fun at the rest of the country for jumping to such a dubious presumption (the beer, of course, is in no way related to the virus). But the poll and the reaction to it present their own lessons in drawing tenuous conclusions.\n\n“Clearly, a lot of Americans already think that their fellow citizens are stupid,” Yascha Mounk wrote at The Atlantic. “The real reason a fake finding could have spread so far so quickly is that it confirmed prejudices about the world that many have held all along.”\n\nIt’s certainly true that Corona beer has drawn a wave of negative associations based on the unfortunate coincidence of its name in a way that could plausibly shift consumer behavior. But what we know about the survey driving the story falls far short of backing up the more far-reaching claims.\n\nThe press release touting the poll offers little detail on what, exactly, people were asked, and 5W Public Relations has not been immediately forthcoming in answering additional questions. The firm provided a list of the questions it asked to Mounk and to the conservative site The Dispatch but refused to provide exact results for each question. 5WPR did not respond to HuffPost’s requests to provide a list of the survey’s questions, answer choices and results.\n\n\n\nHere are the questions that were asked, according to The Dispatch’s Declan Garvey, combined with the results 5WPR chose to include in its press release:\n\nAre you a beer drinker?\n\nAre you a Corona drinker?\n\nIs Corona related to the coronavirus? (16% of beer-drinkers were “confused” about this.)\n\nIn light of the coronavirus, do you plan to stop drinking Corona? (4% who “usually drink Corona” said they planned to stop.)\n\nWould you buy Corona in a store?\n\nWould you order a Corona in a restaurant/bar/public venue? (14% who “usually drink Corona” said they would not.)\n\nWould you buy Corona under any circumstances now? (38% of “beer-drinking Americans” said they would not.)\n\nThere are any number of ways a careful market researcher might attempt to tease out how, if at all, coronavirus has affected perceptions of the beer. This isn’t one of them. Instead, these questions manage to fail simultaneously in two different directions. On one hand, some of the phrasing (“In light of the coronavirus...”) implies a queasy connection between the virus and the beer that people might not have considered until they were polled.\n\nOn the other hand, the final three questions ― including the one responsible for that startling 38% statistic ― don’t explicitly mention coronavirus as a motivation at all. In other words, drinkers who said they wouldn’t buy Corona might simply have meant that they prefer to order a different brand of beer.\n\nThe much less eye-catching but entirely more plausible statistic is that, even “in light of the coronavirus,” just 4% of Americans who “usually drink Corona” say they “plan to stop” drinking it. Even here, the framing of the question is sloppy: If respondents “plan to stop,” doesn’t that imply they haven’t given it up yet?\n\nBeyond the lack of clarity on the questionnaire, the press release is also somewhat vague about how the poll was conducted. According to 5WPR, it was run “via phone” and surveyed “737 American beer drinkers over the age of 21 on February 25 & 26, 2020.” Nothing about that description raises immediate red flags, and it’s a generally acceptable sample size for a national survey. But it falls short of answering a number of basic methodological questions, including whether the poll used live interviewers or robocalls, how it identified respondents and how it was weighted. Because of that lack of detail, we also don’t know what share of its sample “usually” drinks Corona and whether that subgroup is large enough to examine on its own.\n\nThere is some additional data on Corona beer beyond the 5WPR release. The polling firm YouGov, which tracks consumer sentiment on a variety of brands, shows Corona experiencing a pretty clear uptick in negative “buzz,” meaning that people who’ve heard of the brand are more likely to say they’ve heard something bad about it recently. That’s not surprising, especially considering a previous (and similarly overhyped) wave of stories about a small uptick in the number of people searching for the term “corona beer virus” on Google. Stories based on the latest survey are likely to lend themselves to another wave of negative buzz.\n\nYouGov YouGov BrandIndex Poll On Corona Beer\n\nYouGov’s polling also finds that “purchase intent,” which they define as the share of people who say Corona is the brand of beer they’re most likely to buy, has fallen to its lowest point in two years. But, as YouGov notes, Corona’s product “is closely associated with beach holidays [and] does see substantial seasonal fluctuation.” Looking at the chart suggests that the brand’s recent drop on this metric is only slightly more dramatic than the previous ups and downs it’s seen in years past. (A spokesperson for brewer Constellation Brands told CNN that Corona sales “remain very strong.”)\n\n\n\nYouGov YouGov BrandIndex Poll On Corona Beer\n\nIn interpreting all this data, it’s also worth asking a few more questions about what it would actually mean if someone said they’d stopped drinking Corona because of coronavirus. It might mean that a person mistakenly believes that the beer would made them sick. But it could also encompass other rationales ― for instance, “the name reminds me of something unpleasant I’d rather not think about,” or “ordering one at the bar feels like asking to be the setup for a joke.”\n\nIf the 38% statistic doesn’t tell us much about Americans’ reaction to a pandemic, it does present a pretty good case study in the way misinformation can spread. And it offers one easy remedy to combat it: News outlets shouldn’t write about polls unless they know exactly what questions were asked, and readers should treat any stories that don’t provide that information with an appropriate grain of salt.", "images": ["https://img.huffingtonpost.com/asset/5e598c5b230000590d39c77a.png?ops=scalefit_720_noupscale", "https://www.facebook.com/tr?id=10153394098876130&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/5e598c5a230000c00bdddc25.png?ops=scalefit_720_noupscale", "https://www.facebook.com/tr?id=1621685564716533&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/5d532dc22200001a00f53c4b.jpg?ops=100_100", "https://s.m.huffpost.com/assets/H-icon-72fd5782b36a1a42ab82a4af65cbc6dd6ddc4d4a71190a91c5cfaab7c66fd836.svg", "https://s.yimg.com/cv/apiv2/default/20200109/Privacy_Rights_icon.png", "https://s.m.huffpost.com/assets/HuffPostHero-d783f680fb974e80346bdfa145131d058e596e1d32f791981875aa481702c770.svg", "https://img.huffingtonpost.com/asset/5e5989a9230000c00bdddc24.jpeg?cache=ly81o2j05l&ops=1778_1000", "https://img.huffingtonpost.com/asset/5e5989a9230000c00bdddc24.jpeg?cache=ly81o2j05l&ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/5d88f91b2100003200dab6d8.png"], "top_img": "https://img.huffingtonpost.com/asset/5e5989a9230000c00bdddc24.jpeg?cache=ly81o2j05l&ops=1778_1000", "keywords": [], "authors": ["Senior Reporter", "Polling Editor"], "canonical_link": "https://www.huffpost.com/entry/corona-beer-coronavirus-poll_n_5e598955c5b6450a30be6b33", "title": "No, 38% Of Americans Probably Didn't Stop Drinking Corona Because Of Coronavirus", "meta_data": {"google-site-verification": "97Mj-wW7u8U1NOnkW1rfH-I1kgO0-a9YsgoesOk41R8", "oath": {"guce": {"product-eu": "false", "consent-host": "guce.huffpost.com", "locale": "en-US", "inline-consent": "true"}}, "fb": {"pages": 70242384902, "app_id": 46744042133}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "When polling gets filtered through beer goggles.", "keywords": "Polling,Coronavirus,Corona beer", "og": {"title": "No, 38% Of Americans Probably Didn't Stop Drinking Corona Beer Because Of Coronavirus", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5e5989a9230000c00bdddc24.jpeg?cache=ly81o2j05l&ops=1778_1000", "url": "https://img.huffingtonpost.com/asset/5e5989a9230000c00bdddc24.jpeg?cache=ly81o2j05l&ops=1778_1000", "type": "image/jpeg", "width": 1778, "height": 1000}, "url": "https://www.huffpost.com/entry/corona-beer-coronavirus-poll_n_5e598955c5b6450a30be6b33", "site_name": "HuffPost", "locale": "en_US", "description": "When polling gets filtered through beer goggles."}, "article": {"tag": "Polling,Coronavirus,Corona beer", "section": "Politics", "published_time": "2020-02-28 19:21:19 -0500", "modified_time": "2020-02-28 19:21:19 -0500"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostPol", "title": "No, 38% Of Americans Probably Didn't Stop Drinking Corona Beer Because Of Coronavirus", "image": {"identifier": "https://img.huffingtonpost.com/asset/5e5989a9230000c00bdddc24.jpeg?cache=ly81o2j05l&ops=1778_1000", "width": 1778, "height": 1000}, "description": "When polling gets filtered through beer goggles.", "creator": "aedwardslevy"}, "al": {"ios": {"url": "huffpostnews:///?editionID=us&entryID=us_5e598955c5b6450a30be6b33", "app_store_id": 306621789, "app_name": "HuffPost"}}, "taboola.category": "politics"}, "movies": [], "publish_date": 1582935679.0, "source": "https://www.huffpost.com", "summary": ""}