{"url": "https://ezone57.com/2020/04/08/coronavirus-covid-19-vaccine-killed-7-children-in-senegalwest-africa-video/", "text": "A video posted on April 4 on Facebook purports to show the arrest of an individual who allegedly injected a Covid-19 coronavirus vaccine into children in the Pikine commune near Dakar.\n\nThe editorial staff of Observateurs de France 24 has investigated this video, the legend of which is alarmist is mistaken.\n\n“There is a big scandal in Senegal.\n\nThere is a guy who came into a house to get kids vaccinated for coronavirus. He vaccinated seven children who died on the spot. ”\n\nThe voiceover heard in French on this video, shared 2,900 times on this publication and 1,100 times on it, is alarmist.\n\nListening attentively to this 55-second video, we notice that the comment in French covers another in Wolof, one of the six national languages ​​of Senegal.\n\nWe found the Wolof version of the video. The latter, less present on Facebook, has circulated a lot on Whatsapp.\n\nWe hear in the Wolof version: “He is a guy who came to the neighbourhood today with injections […] supposedly against the coronavirus.\n\nHe entered the house of the Mbodji family. He said he is there to administer vaccines. The family members told him that this is not true. He fled to go to the neighbourhood chief. He was finally neutralized right here with the neighbourhood chief.\n\nWe are currently there and the gendarmerie is there too. Everyone is there for that ”.\n\nThere is no mention of the deaths of seven children in the Wolof version.\n\nThe video in French would therefore largely extrapolate the facts, giving them a dramatic dimension.\n\nWhat really happened?\n\nThe scene took place in the late morning of March 26 in front of the house of Abu Diop, district manager of Dalifort Rail in the municipality of Pikine.\n\nWe managed to reach Alassane Mbodji, who lives in the house where the accused man was arrested before he was sent back to the district delegate, and his niece Fatimata Sambou, who was also present that day.\n\nThey tell :\n\nEverything that is said on social networks is false. No one died of any vaccine. Our children are healthy.\n\nAbout two weeks ago, a man came home around noon. He introduced himself as an agent of the Ministry of Health who came to raise awareness about the threat of coronavirus and the precautions to be taken to avoid it, such as regular hand washing. He had worn a t-shirt flanked by a logo from the Department of Health. But in the discussions, it quickly became apparent that he was not an agent of the Ministry of Health. He did not have a badge. He had cosmetic products for sale in his bag. Outside people are prohibited from entering homes to prevent the spread of the coronavirus. But this person pretended to be a public agent to be able to sell his articles. So we sent him back to the neighborhood chief. And from there, the gendarmerie took him.\n\nThis seller wanted to be clever ”\n\nJoined by the editors of France 24 Observers, Malick Diop, adviser to the chief district of Dalifort, confirmed the version of the Mbodji family.\n\nHe adds that the rumor started from a misunderstanding:\n\nThey sold products like toothpaste, toothbrushes, body lotions. But he also had on him traditional medicines against aches. They weren’t vaccination products. Going door to door, a lady asked him in a first house if he had a coronavirus vaccine. He answered “yes” by showing the traditional medicines he wanted to sell. That’s where the rumor started. But it was not true. He just wanted to be clever.\n\nFor several weeks many publications on social networks have been worried that a vaccine would be tested against the coronavirus in Africa.\n\nThese publications had a particular echo after the controversial declarations on April 1 of two researchers on the French television channel LCI concerning clinical trials of vaccine on the African continent.\n\nRead More:\n\n[Video] How Chinese vendors are making money from videos of African children\n\nThe two researchers have since apologized for their remarks.\n\nTo date, there is no vaccine or effective remedy to protect or cure Covid-19, although some 40 projects are currently under study.\n\nArticle by Hermann Boko\n\nShare this: Twitter\n\nFacebook\n\n\n\nLike this: Like Loading...", "images": ["data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABGAQMAAAAASKMqAAAAA1BMVEWurq51dlI4AAAAAXRSTlMmkutdmwAAABBJREFUKM9jGAWjYBQMKwAAA9QAAQWBn6cAAAAASUVORK5CYII=", "https://ezone57.com/wp-content/uploads/2019/10/new-logo-300x99.png", "https://i1.wp.com/ezone57.com/wp-content/uploads/2020/04/Screenshot-2020-04-10-at-1.22.28-PM-e1586525022480.png?fit=500%2C273&ssl=1", "https://i1.wp.com/ezone57.com/wp-content/uploads/2020/04/Screenshot-2020-04-10-at-1.22.28-PM-e1586525022480.png?resize=500%2C273&ssl=1", "https://secure.gravatar.com/avatar/?s=50&d=mm&r=g", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAANoAAACWAQMAAACCSQSPAAAAA1BMVEWurq51dlI4AAAAAXRSTlMmkutdmwAAABpJREFUWMPtwQENAAAAwiD7p7bHBwwAAAAg7RD+AAGXD7BoAAAAAElFTkSuQmCC"], "top_img": "https://i1.wp.com/ezone57.com/wp-content/uploads/2020/04/Screenshot-2020-04-10-at-1.22.28-PM-e1586525022480.png?fit=500%2C273&ssl=1", "keywords": [], "authors": [], "canonical_link": "https://ezone57.com/2020/04/10/watch-a-test-of-the-covid-19-vaccine-on-children-in-senegal-what-does-this-video-really-show/", "title": "[Watch] A test of the Covid-19 vaccine on children in Senegal? What does this video really show?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "IPKLhI7DEP2UkGiEH7czUp12ZQUYOnGJwX709d4b9t4", "yandex-verification": "06c6e9cb9e8931ac", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "[Watch] A test of the Covid-19 vaccine on children in Senegal? What does this video really show? | ezone57.com", "description": "A video posted on April 4 on Facebook purports to show the arrest of an individual who allegedly injected a Covid-19 coronavirus vaccine into children in the Pikine commune near Dakar. The editorial staff of Observateurs de France 24 has investigated this video, the legend of which is alarmist is mistaken. “There is a big …", "url": "https://ezone57.com/2020/04/10/watch-a-test-of-the-covid-19-vaccine-on-children-in-senegal-what-does-this-video-really-show/", "site_name": "ezone57.com", "updated_time": "2020-04-10T20:34:34+00:00", "image": {"identifier": "https://i1.wp.com/ezone57.com/wp-content/uploads/2020/04/Screenshot-2020-04-10-at-1.22.28-PM-e1586525022480.png?fit=500%2C273&ssl=1", "secure_url": "https://i1.wp.com/ezone57.com/wp-content/uploads/2020/04/Screenshot-2020-04-10-at-1.22.28-PM-e1586525022480.png?fit=500%2C273&ssl=1", "width": 500, "height": 273}}, "article": {"publisher": "https://web.facebook.com/ezone57/", "tag": "A test of the Covid-19 vaccine on children in Senegal? What does this video really show?", "section": "world", "published_time": "2020-04-10T13:27:38+00:00", "modified_time": "2020-04-10T20:34:34+00:00"}, "twitter": {"card": "summary_large_image", "description": "A video posted on April 4 on Facebook purports to show the arrest of an individual who allegedly injected a Covid-19 coronavirus vaccine into children in the Pikine commune near Dakar. The editorial staff of Observateurs de France 24 has investigated this video, the legend of which is alarmist is mistaken. “There is a big […]", "title": "[Watch] A test of the Covid-19 vaccine on children in Senegal? What does this video really show? | ezone57.com", "site": "@ezone57", "image": "https://i1.wp.com/ezone57.com/wp-content/uploads/2020/04/Screenshot-2020-04-10-at-1.22.28-PM-e1586525022480.png?fit=500%2C273&ssl=1", "creator": "@ezone57"}, "generator": "WordPress 5.4", "msapplication-TileImage": "https://i0.wp.com/ezone57.com/wp-content/uploads/2020/01/cropped-512-1.png?fit=270%2C270&ssl=1"}, "movies": ["https://www.youtube.com/embed/aboqa0YNw60?feature=oembed"], "publish_date": 1586318400.0, "source": "https://ezone57.com", "summary": ""}