{"url": "https://news-af.feednews.com/news/detail/223e120f939f8d0a06b7ce3cee65318c?client=news", "text": "World Health Organization – Coronaviruses (CoV) are a large family of viruses that cause illness ranging from the common cold to more severe diseases such as Middle East Respiratory Syndrome (MERS-CoV) and Severe Acute Respiratory Syndrome (SARS-CoV). A novel coronavirus (nCoV) is a new strain that has not been previously identified in humans.\n\n\n\n\n\nSenou is a young Cameroonian student in China recently infected with Coronavirus he was released from hospital this morning cured of the virus.\n\nDoctors seeking for a cure to treat the dreadful virus were amazed to see Senou still alive and fit even after contracting the virus which has claimed 1,112 lives since it broke out in Wuhan couple of weeks ago.\n\nThe Chinese doctors confirmed that Senou stayed alive because of his blood genetic composition which is mainly found in the genetic composition of subsaharan Africans.\n\n\n\n\n\nChinese doctors also said that he remained alive because he has black skin, the antibodies of a black are 3 times stronger, powerful and resistant compare to that of white.\n\nZanomoya Mditshwa an African shared his opinion saying black man is indestructible.\n\n“Caucasians is always at war with our black skin because they know our melanin is our defense against all that they throw at us. This proves yet again that the black man is indestructible, our bodies are made of the same substances that make up this Earth because we are owners of this universe they will never wipe us off, history has already proved that.” he said\n\nPlease report any fake news or defamatory statements to feedback-newshub@operanewshub.com", "images": ["http://img.transcoder.opera.com/assets/v2/3964f1d33cc51cd400bf9d9bfc00f548?width=450&height=336&quality=hq", "http://res.feednews.com/assets/v2/3964f1d33cc51cd400bf9d9bfc00f548?height=404&width=720&quality=hq"], "top_img": "http://res.feednews.com/assets/v2/3964f1d33cc51cd400bf9d9bfc00f548?height=404&width=720&quality=hq", "keywords": [], "authors": [], "canonical_link": "", "title": "Chinese Doctors Confirmed African Blood Genetic Composition Resist Coronavirus After Student Cured", "meta_data": {"viewport": "width=device-width,initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "op": {"title": "Chinese Doctors Confirmed African Blood Genetic Composition Resist Coronavirus After Student Cured"}, "twitter": {"title": "Chinese Doctors Confirmed African Blood Genetic Composition Resist Coronavirus After Student Cured", "card": "summary_large_image", "image": "http://res.feednews.com/assets/v2/3964f1d33cc51cd400bf9d9bfc00f548?height=404&width=720&quality=hq"}, "og": {"image": "http://res.feednews.com/assets/v2/3964f1d33cc51cd400bf9d9bfc00f548?height=404&width=720&quality=hq"}}, "movies": [], "publish_date": null, "source": "https://news-af.feednews.com", "summary": ""}