{"url": "https://gizmodo.com/teen-who-died-of-covid-19-was-denied-treatment-because-1842520539?utm_campaign=socialflow_gizmodo_twitter&utm_source=gizmodo_twitter&utm_medium=socialflow", "text": "People sit on a hill overlooking Dodger Stadium and downtown Los Angeles on March 26, 2020. Photo : Getty Images\n\nA 17-year-old boy in Los Angeles County who became the first teen believed to have died from complications with covid-19 in the U.S. was denied treatment at an urgent care clinic because he didn’t have health insurance, according to R. Rex Parris, the mayor of Lancaster, California. Roughly 27.5 million Americans—8.5 percent of the population—don’t have health insurance based on the latest government figures.\n\n\n\nAdvertisement\n\n“He didn’t have insurance, so they did not treat him,” Parris said in a video posted to YouTube. The staff at the urgent care facility told the teen to try the emergency room at Antelope Valley (AV) Hospital, a public hospital in the area, according to the mayor.\n\n“En route to AV Hospital, he went into cardiac arrest, when he got to AV hospital they were able to revive him and keep him alive for about six hours,” Parris said. “But by the time he got there, it was too late.”\n\nAdvertisement\n\nThe name of the urgent care clinic that refused to treat the teen has not been released. Mayor Parris explained in his YouTube video that the 17-year-old is believed to have had no underlying conditions that may have contributed to his death.\n\n“He had been sick for a few days, he had no previous health conditions. On the Friday before he died, he was healthy, he was socializing with his friends,” the mayor explained.\n\nLos Angeles County currently has 1,216 covid-19 cases and 21 deaths, according to the L.A. County Public Health Department’s website. The U.S. as a whole has identified at least 85,991 covid-19 cases and 1,296 deaths as of Friday morning, according to the Johns Hopkins online coronavirus tracker. The U.S. became the country with the highest number of confirmed cases of the virus in the world yesterday, surpassing China and Italy.\n\nThe Lancaster teen tested positive for covid-19, but the Centers For Disease Control and Prevention (CDC) is reportedly evaluating the case to see if there’s another explanation for his death. The initial cause of death was explained on Tuesday as septic shock from complications with covid-19. The teen’s father has tested positive for covid-19 as well. The teen’s death has been removed from the official U.S. death toll, according to Public Health Director Dr. Barbara Ferrer, who gave a press conference on March 25.\n\nAdvertisement\n\nCountries with authoritarian leaders like China, Iran, and Russia have adopted a strategy of denying that some people have actually died from covid-19, even after they test positive for the disease. In Russia, for example a 79-year-old woman in Moscow recently died of the new coronavirus, but the Russian government said that while she may have tested positive, she actually died of pneumonia. Moscow saw a 37 percent surge of “pneumonia” cases in January over the previous year, according to ABC News.\n\nThere have also been allegations from health care workers in the U.S. that some covid-19 deaths aren’t being properly counted, even as hospitals become overwhelmed with patients, sometimes waiting hours to get tested.\n\nAdvertisement\n\n“We just don’t know. The numbers are grossly underreported. I know for a fact that we’ve had three deaths in one county where only one is listed on the website,” one unnamed nurse in California told BuzzFeed News this week.\n\nAdvertisement\n\nPeople are already dying in New York emergency rooms waiting for ICU beds, according to the New York Times. President Donald Trump has denied that there’s a ventilator shortage, a dangerous lie. Trump told Sean Hannity on Fox News last night that he doesn’t like hearing “complaints” from governors and that states don’t actually need more ventilators, contradicting overwhelming evidence that hospitals across the U.S. will need thousands more ventilators in the coming weeks.\n\n“I think that a lot of things are being said that are more [than needed],” Trump said of the medical equipment being asked for by governors. “I don’t think certain things will materialize. A lot of equipment’s being asked for that I don’t think they’ll need.”\n\nAdvertisement\n\nMeanwhile, Los Angeles County is preparing for an influx of patients like they’re seeing in other U.S. hotspots like New York, Washington, and Louisiana. The Los Angeles Convention Center is currently being converted into a quarantine center according to local CBS TV affiliate KCAL-9. And the city of Lancaster is setting up makeshift triage centers, as evidenced by the number of cots in Mayor Parris’s own video on YouTube.\n\n“We’re gonna get through this, and we’re going to be a much stronger community when we do get through this. We’re going to see things in each other we never dreamed possible. It’s not going to be terrible when it’s over, but we have a ways to go,” Parris said, urging people to take the covid-19 pandemic seriously.\n\nAdvertisement\n\n“This next few months, we have to be together. We have to be strong. And most importantly, stay home.”", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/szvvjkbigg4rwomjytym.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/szvvjkbigg4rwomjytym.jpg", "keywords": [], "authors": [], "canonical_link": "https://gizmodo.com/teen-who-died-of-covid-19-was-denied-treatment-because-1842520539", "title": "Teen Who Died of Covid-19 Was Denied Treatment Because He Didn't Have Health Insurance", "meta_data": {"google-site-verification": "Sc6OGUq5heWyOLFpCb_2K6mX7vFrWKGANts4QDUmgOY", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/fdj3buryz5nuzyf2k620.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/fdj3buryz5nuzyf2k620.png", "keywords": "covid-19, coronavirus, teens, cdc, r. rex parris, los angeles, california, health insurance, new york, louisiana, Gizmodo", "news_keywords": "covid-19, coronavirus, teens, cdc, r. rex parris, los angeles, california, health insurance, new york, louisiana, Gizmodo", "twitter": {"url": "https://gizmodo.com/teen-who-died-of-covid-19-was-denied-treatment-because-1842520539", "card": "summary_large_image", "site": "gizmodo", "title": "Teen Who Died of Covid-19 Was Denied Treatment Because He Didn't Have Health Insurance", "description": "A 17-year-old boy in Los Angeles County who became the first teen believed to have died from complications with covid-19 in the U.S. was denied treatment at an urgent care clinic because he didn’t have health insurance, according to R. Rex Parris, the mayor of Lancaster, California. Roughly 27.5 million Americans—8.5 percent of the population—don’t have health insurance based on the latest government figures.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/szvvjkbigg4rwomjytym.jpg"}, "publish-date": "2020-03-27T11:00:00.539Z", "description": "A 17-year-old boy in Los Angeles County who became the first teen believed to have died from complications with covid-19 in the U.S. was denied treatment at an urgent care clinic because he didn’t have health insurance, according to R. Rex Parris, the mayor of Lancaster, California. Roughly 27.5 million Americans—8.5 percent of the population—don’t have health insurance based on the latest government figures.", "og": {"title": "Teen Who Died of Covid-19 Was Denied Treatment Because He Didn't Have Health Insurance", "type": "article", "url": "https://gizmodo.com/teen-who-died-of-covid-19-was-denied-treatment-because-1842520539", "description": "A 17-year-old boy in Los Angeles County who became the first teen believed to have died from complications with covid-19 in the U.S. was denied treatment at an urgent care clinic because he didn’t have health insurance, according to R. Rex Parris, the mayor of Lancaster, California. Roughly 27.5 million Americans—8.5 percent of the population—don’t have health insurance based on the latest government figures.", "locale": "en_US", "site_name": "Gizmodo", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/szvvjkbigg4rwomjytym.jpg"}, "fb": {"app_id": 44615671688}}, "movies": ["/ajax/inset/iframe?id=youtube-video-NkhnAF7E5xw&start=0"], "publish_date": null, "source": "https://gizmodo.com", "summary": ""}