{"author": {"comment_karma": 6623, "created_utc": 1583522180.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_94E044.png", "id": "5v4rjotw", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#94E044", "user_is_muted": null, "display_name": "u_ArcticLeMonkeys", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_94E044.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ArcticLeMonkeys", "key_color": "", "name": "t5_2h3t5e", "is_default_banner": true, "url": "/user/ArcticLeMonkeys/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ArcticLeMonkeys"}, "body": "Who’s the retard? \n\nLet’s have a look at your account: \n>Nah, people are finally coming to realization. Western propaganda is cancerous and brainwashed HK to this situation. I love how no one even bothers reading the legislation and just blindly trust what Western media report on. If people in Hong Kong were smarter and actually read the laws, the bullshit riots would never have happened.\n\n>Because the movement has no ground to support it, it's just precisely what the CCP have been saying. Foreign powers (US) have been spreading misinformation and the Hong Kongers have apparently not read the Basic Law. I read the Basic Law and came to the same conclusions as Ronny Tong, a former LegCo member who is now advocating for democracy in HK. However, he does not support the movement because the movement is based on lies.\nWould you have a problem with anyone tearing down my pro-Trump messages that also are based on lies?\n\n>I don't get a lot of Westerners who are criticizing everything China does. I mean many Chinese tourists can't behave at all, and I get that. But, when China tries to solve the problem with a social credit system, Western media spins it to some dystopian shit.\nSomething a lot of people don't understand is that China's economical progression is simply too great for the social norms to adapt. That is why many Chinese tourists are acting like animals, because many people from the rural areas now have enough money to travel. So, the purpose of the social credit system is to make them adapt to the social norms of human behavior. Our experience in the West with Chinese tourists is most likely nothing compared to what the Chinese living in the big cities experience with Chinese tourists every single day.\n\n>The DDP won because the US stirred up the situation in HK. Prior to the Hong Kong protests, KMT was the favorite to win according to polls.\n\n>Nah, Hong Kongers are just stupid to believe Western propaganda.\n\n>I mean those stupid people fell for Western propaganda and protested for 6 months and still ongoing. They should be glad that China isn't \"democratic\" like Iran, Iraq and Bolivia, otherwise they would have all been shot.\n\n>You do realize that the Xinjiang crackdown is a response to all the terrorism that has happened in that region for the last 3 decades? China focuses on rehabilitation and converting people away from the extremists. What would you prefer China to do? Eradicate the entire area with bombs just like the US? If they did that, maybe they would get away with it just like the US.\n\nSo are you talking about yourself? Cuz you sound brainwashed af.", "created_utc": 1586534703.0, "distinguished": null, "id": "fn03c87", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t1_fn01iq7", "score": -1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fn03c87", "collapsed": false, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fn03c87/"}