{"author": {"comment_karma": 36046, "created_utc": 1434578536.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_FF66AC.png", "id": "o6d8t", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 840, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_somuchqq", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_06_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/somuchqq", "key_color": "", "name": "t5_ckel2", "is_default_banner": true, "url": "/user/somuchqq/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "somuchqq"}, "body": "That BBC article is basically saying that there most likely is no cause for concern.  One of the quotes it uses even makes the same point I did:\n\n>\"People are understandably concerned over whether they might elevate their risk of cancer, but it's crucial to note that radio waves are far less energetic than even the visible light we experience every day,\" says Dr Grimes\n\nThe page talking about the similarity between the crowd control system and 5G also links to the Active Denial System FAQ, which addresses the statistical likelihood of being exposed to any form of injury from a focused RF beam.\n\nAlso, if people are so worried about the frequencies at which 5G operates, they should really be freaking out a lot more about tons of other applications that use these sub-THz bands.  Sensors relating to collision and self-driving in cars can use 14, 28, or 76GHz bands and there are often tens of these transceivers in higher-end cars.  Any detailed imaging used by security, such as at airport checkpoints, also uses between 70-110GHz.  There's just so many places where these high frequency bands are used already in standardized amounts.\n\nAssuming the frequency of operation is the cause for concern in the entire spectra of non-ionizing radiation, the 5G upper limit (around 100GHz) is still orders of magnitude slower than the visible light spectrum (hundreds of THz).  People don't think twice about standing under a fluorescent light that's emitting a hundred watts.\n\nThe thing though is that RF radiation with longer wavelengths are actually better at cooking things, which is why we rely on microwaves to heat up our food instead of say using a super bright red light.  If a 10-20W cell tower or a 2W cell phone transmitter in people's pockets is not a concern right now, then how does that dramatically shift the narrative when moving to a higher band?\n\nHaving said all that, I do agree they should continue to monitor and study any impacts this will have in the coming years.  I think people should try and understand how wireless comm has evolved though;  in the past decade, power output from individual cell towers hasn't really changed because of the innovative leaps in signal processing and transceiver architectures.  For 5G they won't carelessly just bump up the total number of towers and power required to hit better SNR just so people can stream youtube a bit faster.\n\n\n\nedit: One thing I forgot to mention.  While I don't think you are guilty of this, but lots of people out there are unable to properly comprehend scientific jargon and just jump to conclusions.  Often when any scientific community gives a press release saying they have a certain statistical probability of something (ie 99%) that something will or will not cause an adverse effect, people jump to the conclusion that scientists can't back up their conclusions with 100% certainty, so therefore there is something to worry about.  The reality is that when they give a statistical probability like that, it basically means they are certain given the resources they have since there's always going to be a few outliers when doing most any scientific study.", "created_utc": 1586972062.0, "distinguished": null, "id": "fni0t9t", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fnhr5aq", "score": 3, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586972708.0, "name": "t1_fni0t9t", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fni0t9t/"}