{"author": {"comment_karma": 143390, "created_utc": 1320172925.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A06A42.png", "id": "65pn0", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_Virge23", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Virge23", "key_color": "", "name": "t5_1zbs6c", "is_default_banner": true, "url": "/user/Virge23/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Virge23"}, "body": "Media matters does not stop at calling Trump a liar but since they're irredeemable garbage I'll make up a less slimy advocacy group as an example. \n\nSay I work for Media Bias Watch, an organization that is completely honest and above board who's research everyone trusts. Our company writes up two hard hitting long form articles on CNN and their ties to the DNC to great applause. Then our company writes another one about how MSNBC tailors its news to fit a specific demographic already looking for that specific narrative, we get great applause. Next long form we look into how NPR is taking government funding but only hiring left wing or left of center presenters and workers. Then Slate, Buzzfeed, Vox News, Jacobin, etc. etc. etc. \n\nAain, our findings are 100% truthful and no one is refuting that... Would you still see us as respectable and unbiased? What if you knew that we were tipped off about the same thing happening at Fox News but we completely ignored it because it didn't interest us. Still okay? Bias isn't always about how you cover something but also what you choose to cover. If you spent all day digging up dirt on any person or organization you're bound to find something damaging about them so an organization that claims to keep tract of media bias but only goes after conservatives isn't really factual anymore, they're just a propaganda arm of their own group. \n\n\nThis is the more prevalent and pernicious form of corrupting bias. Media Matters is garbage so they'll hire straight up dirt bags with zero credibility like Talia Lavin and Carlos Maza but that's easy to point out since they post insane rants on Twitter almost every day. A lot of groups hire respectable staffers who take their job seriously and present factual evidence but they still fall into selection bias because they either hire people who are passionate about a specific issue (ideologically like-minded) or they get so Focused on their specific issue that they disregard everything else. Eventually that bias grows and grows and grows until your organization stops being effective.", "created_utc": 1587592382.0, "distinguished": null, "id": "fo89kqk", "is_submitter": false, "link_id": "t3_g5qzjz", "parent_id": "t1_fo8647b", "score": 1, "stickied": false, "subreddit_id": "t5_2qh16", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fo89kqk", "collapsed": false, "permalink": "/r/technology/comments/g5qzjz/despite_rules_about_misinformation_a_youtube/fo89kqk/"}