{"author": {"comment_karma": 3048, "created_utc": 1385957419.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "id": "e5q9b", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 953, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_drumbum424", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/drumbum424", "key_color": "", "name": "t5_bsehs", "is_default_banner": true, "url": "/user/drumbum424/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "drumbum424"}, "body": "There's another point that needs to be brought into this too, which I'm not sure is common knowledge about digital radio communication systems:\n\nI'm pretty sure that almost none of them are constantly pumping out their carrier frequency continuously, which is what everyone seems to be afraid of. There is not continuous, constant 30 GHz EMF hitting your body, it's pulsating at a slower rate. While the actual carrier frequency is really high, the pulses/waves are actually hitting your body much more infrequently. I am not 100% sure on this but this is my gut based on other standards.\n\nFrom what I remember about the Wifi and Bluetooth standards, data is sent in short pulses of energy encoded on the carrier, which is called a packet. These packets are pumped out to whatever devices are communicating on the network. These packets last milliseconds, they may actually only last microseconds with the high bandwidth of 5G. I'm not sure how packet duration changes when you need more bandwidth (like if you're streaming something).\n\nI would think that 5G transceivers would have the same kind of protection circuits in them to stop a continuous burst of RF energy at the carrier frequency. You can generally size electrical components smaller if they only experience pulses of power instead of a continuous power. A lot of RF stuff probably has some fail safe to keep a constant carrier frequency from being spit out rather than in packet form, because this could very well damage the antenna and other parts, which are sized smaller under the assumption that they will only see short pulses of energy. This is part of the reason WiFi antennas are really tiny on circuit boards (this and the relatively high carrier frequency of wifi).\n\nMy gut tells me that there would be no software backdoor to exploit this. If your software freezes you don't want a constant frequency output damaging things which are expecting pulses, so there is probably fault hardware to shut stuff off without software. But I don't design 5G antennas, I only design power electronics on single board computers for a living.\n\nAlso... With the superposition thing... There is no way to intentionally align or disalign the waves from multiple transcievers. They will do whatever they want with respect to eachother since their clock sources will drift by a certain amount. No 5G devices would ever be intentionally synchronized at exactly the carrier frequency at the same phase (where everything is aligned), that's impossible at that speed (as far as I know). I doubt the phase of the wave with respect to other devices is controllable.", "created_utc": 1587271474.0, "distinguished": null, "id": "fnuukp6", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnut2h9", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnuukp6", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnuukp6/"}