{"author": {"comment_karma": 387, "created_utc": 1447924370.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_FFD635.png", "id": "s6r3t", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 179, "subreddit": {"default_set": false, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FFD635", "user_is_muted": null, "display_name": "u_sdoodle69", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_FFD635.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/sdoodle69", "key_color": "", "name": "t5_1herbc", "is_default_banner": true, "url": "/user/sdoodle69/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "sdoodle69"}, "body": ">Um, no, that's not what I said. They have been done - during the better part of 40 years of EMR research. It's our current scientific understanding that these towers have no negative health effects, including that on human skin cells.\n\nWho is \"our current scientific understanding\" referring to? You claim the public knows, but there are many people who would disagree that the science is settled at all.\n\n&#x200B;\n\n>Besides, that's not how the burden of proof works. It's not up to someone to prove a negative - that's impossible. You can't prove that something doesn't exist. It's up to skeptics to do the research and prove something does exist, ie. higher cancer rates at 5G towers. Our current understanding of physics and cellular biology indicate that the local heating effects are the primary concern for humans, and 5G technology has been proven ad nauseam to not cause local heating nor cancer. The funny thing is, the first narrative for 5G conspiracy theorists was that it caused cancer. Many, many studies have now proven otherwise, and so now the narrative has switched to a few studies showing that 5G might cause other cellular effects. Researchers have taken in vitro cells and exposed them to relentless 5G and have noticed slight differences - mostly in cell membrane permeability - but have not proven that these effects even have negative outcomes. The reality is that most things will have an effect on cells if you look hard enough. If I stand next to a campfire, you'd find many different effects on my cells if studied in vitro. That science doesn't suggest standing next to a campfire is going to ignite me in flames.\n\n&#x200B;\n\nYou are the only one claiming PROVEN things: \n\n>5G technology has been proven ad nauseam to not cause local heating nor cancer.\n\nOnce again,  YOU make claims that this technology is PROVEN to be safe, and leave no sources. What's your proof, Mr. Burder of Proof?!\n\n&#x200B;\n\n>Proving no effect is impossible, and any such proof would be immediately invalidated the moment the most minute thing was added to the equation\n\nWOW that's weird because you just told me it's proven to not cause two effects", "created_utc": 1586971166.0, "distinguished": null, "id": "fnhyx4y", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fnhtbht", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586971579.0, "name": "t1_fnhyx4y", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fnhyx4y/"}