{"author": {"comment_karma": 4441, "created_utc": 1524652353.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_008985.png", "id": "192nx3fr", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 5724, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_aspristudnt", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_04_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/aspristudnt", "key_color": "", "name": "t5_igo2m", "is_default_banner": true, "url": "/user/aspristudnt/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "aspristudnt"}, "body": ">It strikes me that you're ignoring the other points I raised about this.\n\nUsing a mask without knowing how you are supposed to use it still has better results than wearing no mask. There was literally a post about this on this subreddit. But if you believe that govt wasn't just covering their ass on why they changed position suddenly, there's no use in even going through the effort of looking for it. If you actually care about it at all, feel free to google the use of masks in prevention of the spread of diseases. I'm sure you'll find something.\n\n>The first ammendment applies to the government, and to bring it up at all in the context of this conversation is misappropriated.\n\nNo it is not. Bringing up the fact that for a government free speech was deemed so important that it was made the first amendment is very relevant in highlighting the importance of free speech. Stop pretending it has nothing to do with this subject. First you pretend we were discussing the legality. Now you pretend that highlighting the importance of free speech has nothing to do with a discussion about censorship. If you can only argue with me by deflecting then just say so. \n\n>Now you're speaking about the government, why? They aren't taking away anyone's rights, are they?\n\nBecause we're talking about whether censorship is a good or bad idea. In the context of encouraging censorship by a gigantic corporation that has more of a global influence than most countries. Since we can't agree on whether it is good or bad in that context, I'm comparing it to a (hopefully) more obvious context.\n\n>On its face that's wrong since the article reports that that's exactly what they are doing\n\nYeah, it definitely isn't proving conspiracy theorists right in their mind when a gigantic conglomerate has now finally decided to censor something. It also isn't like those people can't just hang out in the comments of other related videos and talk there. Or go onto reddit or any other social media. It's not like writing articles about this whole thing just makes more people suspicious/join by simply exposing them to it.\n\nYou have literally only responded to everything I said by deflecting and making me answer stupid questions you weren't actually wondering about. You clearly aren't gonna change your mind and neither am I. This censorship discussion is useless so consider it over. But looking back at your last few comments, I'm guessing you were just trolling anyway and probably feel the need to comment last to \"win\" this discussion. Go right ahead.", "created_utc": 1586202787.0, "distinguished": null, "id": "fmmcgi6", "is_submitter": false, "link_id": "t3_fvf99x", "parent_id": "t1_fmm785m", "score": 1, "stickied": false, "subreddit_id": "t5_2x4yx", "downs": 0, "total_awards_received": 0, "edited": 1586255572.0, "name": "t1_fmmcgi6", "collapsed": false, "permalink": "/r/Coronavirus/comments/fvf99x/youtube_to_suppress_content_spreading_coronavirus/fmmcgi6/"}