{"author": {"comment_karma": 33869, "created_utc": 1401784806.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_008985.png", "id": "gtsg2", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 62036, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_iampieman", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/iampieman", "key_color": "", "name": "t5_7i2r8", "is_default_banner": true, "url": "/user/iampieman/", "banner_size": null, "user_is_moderator": null, "public_description": "I’M NOT A MAN AND MY USERNAME WAS A MISTAKE I’M SORRY", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "iampieman"}, "body": "I am sorry I haven’t responded. I am a bit overwhelmed at all the comments, and the responses. I’ll try and cover some main responses in this comment.\n\n1) I know history teacher doesn’t = smart. But I meant it when I said he’s smart. He has immense general knowledge, and could have done many things before choosing to be a teacher in his 40s. He worked in science labs as a younger man. I’m not bragging, just trying to demonstrate that he has the mental cognition skills and isn’t lacking, which makes this more perplexing to me. \n\n2) I asked my mum what she thought of this and she just laughed it off and said he’s “crazy”, but not in a concerned way. She is not very good at dealing with any emotions or deep issues and would never seriously address this, hence why I came here. \n\n3) He has always been an anxious person, not in contact with his family (we moved countries 12 years ago) and has mood issues. He used to be very angry growing up, but has actually mellowed the last few years. He’s still fairly mellowed now. He tends to have an obsessive personality, so maybe it’s just manifesting in this.\n\n4) he doesn’t really have more time on his hands. In my country (Australia) and state, schools stayed open and he worked like usual. He’s just started school holidays for 2 weeks which may be leading to his increases searching, but this started when he had his usual routine. \n\n5) I’m not scared of him doing anything crazy (it’s crossed my mind, but I have anxiety issues too and think it’s just that), I’m just worried for him that this could be the start of mental health issues or Alzheimer’s or something. His mum is still alive. Dad died of diabetes complications over 15 year  ago I think.\n\n6) he is on a bunch of medications, but no recent changes to them. But I guess the build up could be contributing.\n\n7) he keeps back flipping quite a lot. One second he says covid is fake and just the flu and just being used to control us, the next second he tells me to be careful of covid when going out. And both times he seems just as serious.  Does this indicate its more or less likely to be an actual medical problem?\n\nThanks!", "created_utc": 1587512760.0, "distinguished": null, "id": "fo4wssc", "is_submitter": true, "link_id": "t3_g5fyvm", "parent_id": "t3_g5fyvm", "score": 3, "stickied": false, "subreddit_id": "t5_2xtuc", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fo4wssc", "collapsed": false, "permalink": "/r/AskDocs/comments/g5fyvm/my_very_smart_dad_has_recently_started_reading/fo4wssc/"}