{"author": {"comment_karma": 8317, "created_utc": 1583524390.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "id": "5v52ejej", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 3, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_TrollopingTrubadeur", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TrollopingTrubadeur", "key_color": "", "name": "t5_2h3vu5", "is_default_banner": true, "url": "/user/TrollopingTrubadeur/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TrollopingTrubadeur"}, "body": "> I use and quite enjoy FB in connecting with friends. \n\nsure, some aspects of it are fine, but nothing one could not do in about as much time as it takes to make a FB profile to do via other means if one wanted to.\n\n>But there are golden rules: Don't friend anybody I don't know.\n\nI didn't either but the bullshit spam and toxic drivel is no joke... i deleted my account long ago. The only last account i had was an anonymous one i used to ask about international shipments for a toy plushy my wife holds dear to try and get from a seller that only uses FB to communicate.(did not succeed)\n\nBefore i deleted it i was down to 14 friends and the bullshit did not stop... \n\n>Immediately squash any news article not posted by a friend. \n\ni did too, but FB itself pushes a shitload of nonsense. much like google news as a \"news\" propagator site... the tabloid bullshit swamps all else. \n\n> DON'T consider FB as a news source (for that go to Reuters for example). \n\nI dont, but the problem are the 99/100 people who can not differentiate in between things. As for Reuters, just a personal complaint and i've been going to them less and less as time goes on...\nThe damn \"human interest\" stories. I mean seriously just report the news, provide some factual analysis and do not interject unnecessary bullshit emotional low grade ask fuck human drama every fucking where.(not talking to you just the things that piss me off with reuters as of late)\n\n> Immediately point out crap stories that serp in. Then it works.\n\ndid that too just made some brainwashed Faux News types really angry.. not worth the damn effort for the venue and the marginal utility it may provide to some.\n\n\n> Its happy place in these rules is probably with not more than 50 other people.\n\nFor you maybe, but for me deleting my account made my mental health outcomes etc so much better. been several years and i wont be going back to that shithole of a venue. Too toxic to deal with on multiple levels. Fuck FB!  Account deletion was the best thing i have done in a good while in terms of issues of such ease. No one should be on there... and i guarantee all of the things you do with your few handfuls of friends you could do via text, phone, or email just as easily.\n\nEdit: am an army retiree and a former small business owner.. my skin is thick as fuck, but also have some mental health concerns related to that. FB as a whole therein is something no one should be on there... ever...  that old saying \"Delete FB, hire a lawyer, hit the gym\" as things stand is still very valid. FB is toxic as fuck and not worth the bits on the basis of which it exists on...", "created_utc": 1587116196.0, "distinguished": null, "id": "fno8l8i", "is_submitter": false, "link_id": "t3_g2d5md", "parent_id": "t1_fno7o6w", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587116564.0, "name": "t1_fno8l8i", "collapsed": false, "permalink": "/r/worldnews/comments/g2d5md/british_telecom_boss_reveals_39_engineers/fno8l8i/"}