{"author": {"comment_karma": 9816, "created_utc": 1378772551.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_7193FF.png", "id": "d2yos", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 12182, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#7193FF", "user_is_muted": null, "display_name": "u_iconat20", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_7193FF.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/iconat20", "key_color": "", "name": "t5_end4l", "is_default_banner": true, "url": "/user/iconat20/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "iconat20"}, "body": "There has been a lot of junk science and baseless claims about RF EMF and cancer yes. Radio, television, 2G 3G 4G have all been proven to be relatively safe, yes. You are correct, most people even scientists who have fallen into the EMF causes cancer hole have been proven wrong. You can debunk EMF causing cancer and I would agree. I have WiFi in my house and I'm using a cell phone as we speak. \n\nHowever 5G is a different matter all together. There have been very few studies on long term exposures at the limits set by the FCC by MMW EMF.\n\nLet's assume that the second link I attached was filled with junk scientists and junk science and just focus on the first.\n\n>Finally, we can conclude that our model, purely in vitro, haven’t to be lead to a direct extrapolation of our results at the organism level\n\nYou left out the second part of that quote (emphasis added by me) \n\n>In the future, **further studies will be necessary to assess MMW bioeffects on animal models** and to investigate potential dysregulations induced by lower IPD values prior to the wide-scale deployment of technologies based on these specific frequencies\n\nThis only means that further studies at these scales need to be performed, not that they aren't going to show anything. By misquoting the article you came to the wrong conclusion.\n\n>You can read the study for yourself, but in a nutshell they found that the only significant result of exposure to MMW was a slight heating, significantly below environmental thermal fluctuations.\n\nIf you read further, you can see that thermal fluctuations **were not** in fact the only thing observed, that was the whole point of the article (emphasis added by me) :\n\n>This unexpected extent of modifications can hardly stem from the mild changes that could be reported throughout transcriptomics studies, leading us to hypothesize that **MMW might alter the permeability of cell membranes**, as reported elsewhere.\n\nThe entire regulation of 5G exposure is based on the affect of local thermal heating, which was believed to be the only cause for concern with it. However, because credible science has shown this not to be the case, **the safety regulations are inherently flawed, and therefore we need a moratorium on 5G rollout until further studies can be conducted**.\n\n\nFurther relevant info (emphasis added by me) :\n\nhttps://www.mdpi.com/1660-4601/16/18/3406/htm\n\n>Due to the contradictory information from various lines of evidence that cannot be scientifically explained, and given the large gaps in knowledge regarding the health impact of MMW in the 6–100 GHz frequency range at relevant power densities for 5G, research is needed at many levels. It is important to define exact frequency ranges and power densities for possible research projects. **There is an urgent need for research in the areas of dosimetry, in vivo dose-response studies and the question of non-thermal effects.**\n\n>In summary, the majority of studies with MMW exposures show biological responses. From this observation, however, no in-depth conclusions can be drawn regarding the biological and health effects of MMW exposures in the 6–100 GHz frequency range. **The studies are very different and the total number of studies is surprisingly low.** \n\n>Our quality analysis shows that for future studies to be useful for safety assessment, design and implementation need to be significantly improved.\n\nI am not saying that 5G causes cancer. However I am saying that there is not enough evidence to the safety of 5G compared to previous RF EMF technology. We are currently operating under the assumption that it is safe until proven harmful, when in reality we should not be going forward with the widespread implementation of the technology until it is proven safe.", "created_utc": 1586276778.0, "distinguished": null, "id": "fmp99vr", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t1_fmp3kye", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmp99vr", "collapsed": false, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmp99vr/"}