{"author": {"comment_karma": 4387, "created_utc": 1563574678.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_A5A4A4.png", "id": "46xej04r", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 776, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_Kelosi", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Kelosi", "key_color": "", "name": "t5_2144wc", "is_default_banner": true, "url": "/user/Kelosi/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Kelosi"}, "body": "> This whole diatribe is based on an all or nothing mentality and assumes a literal binary choice, and relies on using only examples happening now.\n\nWhere are you getting any of this from? All or nothing mentality? What in my argument resembles this? Literal binary choice? Communism is neither left nor right. It's just plain wrong. And relies on examples happening now? I didn't realize Mao was still alive. /s\n\nAre you arguing me or something you completely made up? \n\nI think the most telling thing about your argument is how you can only describe your deeply wounded perspective instead of actual facts or even references to my argument. If any of these wild claims were actually true, then you'd be able to demonstrate it by being specific and relying on examples. But you can't do that, can you. You just feel deep down that communism is for you, for no reason you can actually put into words. Don't you? At least not anything comprehensible at this point. Your argument is falling apart. Which is unsurprising since communism only make sense by appealing to hearsay anyways. The parallels are uncanny. \n\n> Historically humans are collective animals\n\nThis is a meaningless and completely made up claim on your part. \n\n> all of our greatest achievements came from collaboration\n\nAs opposed to capitalism? Do you even remember what we're arguing anymore? Or have you just become lost in your own idealism at this point? So there's no collaboration within businesses? Between companies? Is that what you're pretending? Capitalism is the reason for the majority of the technological innovation of the 20th century. From polymers, to pharmaceuticals, to cell phone, computers, rockets and automobiles. That was capitalism. Not communism. Keep your story straight. You wouldn't be having this problem if you were in the habit of referencing actual facts rather than just inventing elaborate appeals in an effort to convince others and yourself of this baseless, emotional garbage. Feelings don't tell you about real life, facts do. Use them. \n\n> I'm not saying it will look like anything we've tried before\n\nSo you have no idea what it will look like or what you're even talking about? I could have told you that. Your beliefs are nothing but idealism. No wonder they're so disconnected from reality. \n\n> My point is it will grow out of capitalism's final step\n\nNo that's your claim. My point is that you don't have a reason for making this claim. It's an appeal that deep down you feel but don't really know. You just want it to be true. That doesn't mean it is. Facts are how you know. Things that have happened, and that you have seen. \n\n> If you don't want to call it communism because the USSR fucked that up for you, fine.\n\nYou keep inverting my argument. I do call it communism. You're literally responding to a thread where the first sentence is \"China **is** communist.\" My whole point is that they all fuck up. No communism works. Not China. Not Russia. Not Cuba. Private property is not the problem, it's the solution. Removing that distribution of power has time and time again **resulted** in corruption. \n\n> If we attain the ability to farm other planets \n\nI like speculation about science fiction as much as the next guy, but we're not talking about science fiction here. You're head is so high in the clouds you don't know where the ground is anymore. \n\n> the abundance should push us past scarcity so far that money becomes unecessary.\n\nThermodynamics says otherwise. And your forgetting how vast space is and how expensive space travel will always be. Even once we do have the technology. You're describing something so alien to you you couldn't possibly know the practical limitations of it. Matter is a fixed, limited resource. And it always will be. I addressed this last time. You just complained about infinite growth and now you're imagining infinite resources. You're doing the thing you criticised. It's absurdly hypocritical and short sighted. \n\n> This shows that you're only assuming that what I mean is USSR style society\n\nDoes it? This is completely unrelated to what you just quoted. You don't know what's next. You have no reason other than your dreams and biases to pretend what's next. You're not a sooth sayer or a psychic, condescending you me as if any of your speculation is reasonable or valid is just bullshit. You are admittedly making shit up. We're not even talking about real events anyone. And I think you need to take a step back and consider that while sometimes certain things seem to make sense in your head, saying them out loud is a different matter, and your beliefs are clearly far from being coherent. \n\n> you just want to assume that I'm pushing for totalitarianism or state capitalism\n\nNo I don't. How can you miss every point that I've made. I'm not accusing you of anything like this. I'm saying this is what naturally happens to communism, good intentions or otherwise. It's an incoherent belief system that largely parallels the unstructured idealism you just displayed, and like you is completely unable to bring its vision to fruition. Capitalism is not the problem. Corruption is. And communist states always corrupt. Why? Because your solution is to eliminate something that protects against the concentration of powers. I don't think you're even smart enough to push for a totalitarian state. But you don't have to be smart to make a mess out of things. That's the problem with communism. It's not intentionally corrupt. It just doesn't work. Period.", "created_utc": 1586621315.0, "distinguished": null, "id": "fn3ibho", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t1_fn3ck3n", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fn3ibho", "collapsed": false, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fn3ibho/"}