{"author": {"comment_karma": 175420, "created_utc": 1440216389.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_ee4l9/styles/profileIcon_or4cw8t46hd01.jpg?width=256&height=256&crop=256:256,smart&s=d6d3fade4eb2338253d72809a921b11d385cce1b", "id": "pra3x", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 3806, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_sjryan", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_ee4l9/styles/profileIcon_or4cw8t46hd01.jpg?width=256&height=256&crop=256:256,smart&s=d6d3fade4eb2338253d72809a921b11d385cce1b", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/sjryan", "key_color": "", "name": "t5_ee4l9", "is_default_banner": true, "url": "/user/sjryan/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "sjryan"}, "body": "The purpose of 5G is to create an internet network robust enough to provide constant and universal surveillance of society.  Everything you say and do will be tracked.  It goes beyond even the surveillance state envisioned in Orwell's *1984.*  There can only be one purpose of such surveillance:  to create a totalitarian state where even the most minor dissent is not tolerated.  \n\nNow as for Covid-19, it is a genuine virus.  The question is how deadly it is by itself.  That is, whether non-Covid deaths from flu, tb, and zinc-deficiency (etc.) are being falsely attributed to it simply because a person who dies tested positive for the virus.  We will find the answer to that in a couple of weeks, when the hospital emergency centers either become jam packed or remain normal.  How can we be in the midst of a deadly pandemic when the overall death rate hasn't changed?  People will be asking about that.    I can tell you that people are getting restive right now.  \n\nMeanwhile the CDC's and WHO's response has been to double-down, for example: now after all this they suddenly want us to all wear face masks all the time in public.  But in the end, as when an incompetent poker player keeps bluffing when he should have folded long ago, they are only digging the hole deeper.  Yet the Little Dictator, senile and hopped up on stimulants, is never going to back down. \n\nTrump, however, needs to consider the Vietnam Option:  Pull out and call it a victory.  This strategy can still work into early May.  After that, the protest marches that disappeared from the streets when the coronahoax began are going to come back, ten times bigger.  \n\nDon't expect the police and military to side with the Establishment, either.  The military especially is restive, after the Captain of the *Theodore Roosevelt* was canned for writing a letter of concern about the safety of his crew when a couple of sailors on board tested positive.  Again, I don't think there's anything to worry about, but the Captain doesn't know this and it's obvious he acted heroically under the circumstances, risking his career and in fact losing it.  Soldiers and sailors got the message:  the government is either leaving them to die, or this whole thing is a hoax.  Either way, their loyalty is being severely strained.  \n\nThe powers that be should just take their goddam stimulus money now and stop being greedy for even more.  Greed will let this thing drag on until we see the economy crash.  Or their regime crash.  Or civilization itself crash.  No yacht will be big enough to sail them away to safety then, unless it's equipped with a hyperspace drive.", "created_utc": 1586026278.0, "distinguished": null, "id": "fmffp9w", "is_submitter": false, "link_id": "t3_fuurfx", "parent_id": "t3_fuurfx", "score": 7, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmffp9w", "collapsed": false, "permalink": "/r/conspiracy/comments/fuurfx/personal_thought_5g_is_coronavirus_is_controlled/fmffp9w/"}