{"author": {"comment_karma": 44168, "created_utc": 1354767126.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_0079D3.png", "id": "9t5um", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 623, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#0079D3", "user_is_muted": null, "display_name": "u_sinascendant", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_0079D3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/sinascendant", "key_color": "", "name": "t5_1wbyb9", "is_default_banner": true, "url": "/user/sinascendant/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "sinascendant"}, "body": "Well, I had a whole response written up and my phone refreshed the page, and I don't feel like rewriting it. I'll just give you a summary.\n\nNumber one, the \"for cancer rates to drop we'd have to die faster\" is idiotic. The other way could just be, you know, we're getting less cancer because our bodies are in better shape. That's like saying \"if the murder rate goes down it has to be because we're dying faster than we can get murdered\".\n\nFor the Mortazavi study, they had two studies which \"supported\" the point you quoted. One used two groups of five rats (not enough to be statistically significant), and for the test group placed them directly between two broadcasting routers at a distance of 20 cm for 24 hrs a day, constantly broadcasting, for 20 weeks.The end result was about a 40% decrease in a couple of oxidant protection enzymes, however since the rats were dead they did not test if this went back to normal if not directly exposed to the radiation for a couple days.\n\nThe other was two groups of 8 rats (same issue as the first) in a Faraday cage with an artificial wave generator, the power of which they did not specify, and that one was 24hr/day for a year. That one found a number of testicular anomalies, all of which were within the margin of error.\n\nThe amount of radiation received by the rats in those studies would have exceeded the amount received by a human in their lifetime, even with 5g. In addition, rats are obviously much, much smaller than humans, and therefore will be much more easily affected.\n\nOn the mmwave issue, you literally quoted something saying that the skin absorbs more than 90% of them. That seems to support my point a lot better than yours...\n\nI am aware that they are working up to 90ghz. However, the mm band is currently used for ham radio, astronomy telescopes, body scanner, and WiGig tech, among others. Therefore, you would expect there to be higher instances of issues among ham radio operators, astronomers, TSA agents, and people using wireless computer docks; I haven't heard anything about that, have you?\n\nFor the final study, I'm not sure what you want me to say there, as the text you quoted literally proves my point. It directly says that you can't compare the studies because they use much stronger radiation at durations and exposure levels that would never happen to normal people; according to Bucher, of the studies he analysed, the WEAKEST study used a power at the maximum level allowed by law, and the strongest was 4x higher than the max allowed by law. \n\nSo the conclusion is that if you strap a router directly to your dick and let it run 24/7, then you may have some mild to moderate issues with testicular health. Under normal conditions it is no more harmful to you than the .01 ppm of arsenic allowed in tap water.", "created_utc": 1587311692.0, "distinguished": null, "id": "fnw58m9", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnuk2in", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnw58m9", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnw58m9/"}