{"author": {"comment_karma": 3023, "created_utc": 1329419210.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_FFD635.png", "id": "6xvzw", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 2, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FFD635", "user_is_muted": null, "display_name": "u_ChoosyMoose", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_13_FFD635.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ChoosyMoose", "key_color": "", "name": "t5_bmkh4", "is_default_banner": true, "url": "/user/ChoosyMoose/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ChoosyMoose"}, "body": "This right here! People do not understand that higher frequency does not equal power.  Power is measured in Watts! 5g is a higher frequency and lower power. Which means it can pass along more information quickly, but will be far worse when trying to get signals into your house. The only real negative to 5g is that it requires more towers than 4g because it has a shorter range and cannot penetrate buildings as far. So it takes up additional real estate. I heard they’re trying to put antennas onto buildings in cities but people are boycotting the idea because they do not understand RF. \n\nRF (radio frequency) radiation is non-ionizing. It won’t cause you to mutate like nuclear radiation (alpha, beta, gamma). The way RF hurts you is by prolonged exposure to high power. Think of your microwave. The waves causes the water molecules in your body to move around, so you cook like a hot pocket (from the inside out). The only danger would be from straddling the antenna and cooking yourself (your genitals are mostly water!) but that doesn’t sell newspapers or get clickbait revenue. So we’re left with people not understand the science behind the world they live in. \n\nThere is much more science behind this but I’m trying to keep it easy to read.\n\nEdit: I looked into weather radars (I do not know much about satellites) and yes there is a slight overlap in the frequency band (radar 1-3 gigs and 5g 600 Megahertz to 6 gigs). Don’t worry though most countries have desecrated frequencies so that 5g towers will not use the same frequency (the US has the FCC). And if you’re wondering radars our out so much power it would blank out the 5g towers IF they used the same frequency but they won’t so don’t worry. Before someone’s says something about radars being dangerous, they are built very specifically. They are built at an angle in which their signal will not touch the ground until it is so low power it would barely have the power to penetrate your clothing. \n\nAnd for anyone who didn’t know radar stands for RAdio Detection And Ranging. Couldn't help myself I’m a nerd.", "created_utc": 1586946368.0, "distinguished": null, "id": "fngvd6r", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fngrox0", "score": 11, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586946919.0, "name": "t1_fngvd6r", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fngvd6r/"}