{"author": {"comment_karma": 9, "created_utc": 1574841514.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_4856A3.png", "id": "4dl7phr7", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 2, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#4856A3", "user_is_muted": null, "display_name": "u_WildmanJens", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_12_4856A3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/WildmanJens", "key_color": "", "name": "t5_296fyr", "is_default_banner": true, "url": "/user/WildmanJens/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "WildmanJens"}, "body": "So I win, and btw, maybe you should look into writing longer sentences to get your point across better, because for now you are actually just proving my point - which is this: There are several hundred scientists, doctors of different nature, and experts saying that we need to do more testing before rolling out 5G. What you are saying is, that there is ZERO or very few at least, saying that 5G is completely safe for humans, animals and nature in general? Or did I misunderstand something?\n\nI also love the fact that ridiculing is your answer to everything, makes you such a mainstream dude, it's once again confirming my earlier point about redditors thinking they actually know shit, but all they know is what all the other redditors are saying, and if you can't create a meme that ridicules someone, then you better follow the pack, otherwise they might call you out :)\n\nI don't mind long sentences, especially the peer-reviewed ones, since they often bring better answers than silly assumptions based on memes online - maybe you should read one?\n\nYou asked for names of \"some scientists\" I gave them to you, if you read through the list you will find some pretty top notch doctors and professors, teaching and researching at some of the finest universities in the world - So your 'some scientist' puns are really a bad choice if you think about it, but I am sure you won't understand why. \n\nI still urge you to actually read up on it, and not just take the memes for it - Again, I doubt you will though, you are too busy trying to come up with smart comebacks and witty comments, after all, it's the way of reddit.\n\nI can link to a few studies on drinking water if you want them?? Not that hard to find, again, a really bad comeback actually...\n\nAnyways, looking forward to your next reply, I am enjoying picking you apart, I love to confirm my ideas, I still hope it turns out to be completely safe though, for your sake I mean, you are going to need that 8k virtual porn stream service, I doubt you will get laid much with your level of wits.", "created_utc": 1587309630.0, "distinguished": null, "id": "fnw1pdl", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnvrwhm", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnw1pdl", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnw1pdl/"}