{"author": {"comment_karma": 10070, "created_utc": 1564333905.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_FF66AC.png", "id": "4952947o", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 3071, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF66AC", "user_is_muted": null, "display_name": "u_hoesmad_hoesmad_", "header_img": null, "title": "H03SMad", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_FF66AC.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/hoesmad_hoesmad_", "key_color": "", "name": "t5_225ud3", "is_default_banner": true, "url": "/user/hoesmad_hoesmad_/", "banner_size": null, "user_is_moderator": null, "public_description": "if you take a Reddit profile seriously I have low standards for you in real life", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "hoesmad_hoesmad_"}, "body": "I’m not saying coronavirus is 5g, or that 5g is super dangerous - but we need to know more. I personally do not believe it is harmless. I’ll present some studies and play devils advocate\n\nPeople saying it’s 100% safe are absurd though.\n\nBit sad a sub full of biology people haven’t looked into this.\n\nI understand companies arent exposing people like this (supposedly) but I still do not trust this until further studies are done regarding long term. \n\nStudy from 2019 - https://pubmed.ncbi.nlm.nih.gov/31540320/\n\n“The available studies do not provide adequate and sufficient information for a meaningful safety assessment, or for the question about non-thermal effects. There is a need for research regarding local heat developments on small surfaces, e.g., skin or the eye, and on any environmental impact. Our quality analysis shows that for future studies to be useful for safety assessment, design and implementation need to be significantly improved.”\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6765906/\n\n“In summary, the majority of studies with MMW exposures show biological responses. From this observation, however, no in-depth conclusions can be drawn regarding the biological and health effects of MMW exposures in the 6–100 GHz frequency range. The studies are very different and the total number of studies is surprisingly low. The reactions occur both in vivo and in vitro and affect all biological endpoints studied.”\n\n“Several studies focused on the distribution of power density and the change in skin temperature as a result of exposure to MMW in the 6 to 100 GHz frequency range. The studies are experimental and/or modeling studies using previously published data. Alekseev et al. [116,117] investigated the absorption of the skin of mice and humans at frequencies between 30 and 82 GHz (10 mW/cm2). They found that in both species absorption into both the epidermis and the dermis occurs with a concomitant loss of power density in the deeper regions”\n\nIn addition, certain skin constituents have been shown to affect energy absorption. It has been shown that the presence of sweat glands [120,121] and also capillaries in the dermis can cause locally elevated SAR levels [122]. The latter study showed that SAR levels in vessels could be up to 30 times higher than in the surrounding skin, depending on the diameter of the vessels.”\n\nThe legal exposure for SAR levels are 1.6w/kg\n\n“However, such studies are very relevant because they show how certain exposure parameters can influence the energy input and thus the thermal behavior of the skin.”\n\n“The results of some of the studies may suggest that exposure to power densities at or below the guideline recommendations induce biological effects. There are, however, some arguments against it.”", "created_utc": 1584634933.0, "distinguished": null, "id": "fkxt5g7", "is_submitter": false, "link_id": "t3_fl9od5", "parent_id": "t3_fl9od5", "score": 2, "stickied": false, "subreddit_id": "t5_2qhn7", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkxt5g7", "collapsed": false, "permalink": "/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/fkxt5g7/"}