{"author": {"comment_karma": 12842, "created_utc": 1511113089.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_A5A4A4.png", "id": "1kxdda", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 98, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_Destabiliz", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Destabiliz", "key_color": "", "name": "t5_4ueh0", "is_default_banner": true, "url": "/user/Destabiliz/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Destabiliz"}, "body": "Read the articles before making assumptions;\n\n>Hampering the West’s adoption of 5G networks, for example by hobbling democratic decision-making by inducing regulatory or legal battles about 5G’s adverse health effects, would be a boon for the Kremlin’s own pursuit of the technology.\n\n>Indeed, this particular RT segment is one of seven programmes already this year devoted to 5G fearmongering. The most recent, “Is 5G Hazardous to Our Health?”, alleges that children exposed to 5G signals will suffer cancer, nosebleeds, and learning disabilities. Another falsely says that higher radio frequencies are more dangerous to biological organisms, when in fact, as noted above, the opposite is true. As the New York Times explains, “The network is now applying its playbook against 5G by selectively reporting the most sensational claims, and by giving a few marginal opponents of wireless technology a conspicuous new forum.”\n\n>These stories have since taken on a life of their own in the anti-Western and pro-Kremlin alt-media, which often have a symbiotic relationship with Russian propaganda outlets like RT and Sputnik. Already, a cursory search for “5G dangerous experiment on humanity” brings up an extensive list of hits to dubious sites peddling iterations of RT’s original story, including many that EUvsDisinfo has previously identified as multipliers of pro-Kremlin disinformation.\n\n\n\n>The Kremlin “would really enjoy getting democratic governments tied up in fights over 5G’s environmental and health hazards,” said Molly McKew, head of Fianna Strategies, a consulting firm in Washington, D.C., that seeks to counter Russian disinformation.\n\n>RT’s assaults on 5G technology are rising in number and stridency as the American wireless industry begins to erect 5G systems. In March, Verizon said its service will soon reach 30 cities.\n\n>RT America aired its first program assailing 5G’s health impacts last May, its only one in 2018. Already this year, it has run seven. The most recent, on April 14, reported that children exposed to signals from 5G cellphone towers would suffer cancer, nosebleeds and learning disabilities.\n\n>Hundreds of blogs and websites appear to be picking up the network’s 5G alarms, seldom if ever noting the Russian origins. Analysts call it a treacherous fog.\n\n>**Moscow’s goal, experts say, is to destabilize the West by undermining trust in democratic leaders, institutions and political life. To that end, the RT network amplifies voices of dissent, to sow discord and widen social divides. It gives the marginal a megaphone and traffics in false equivalence. Earlier campaigns took aim at fracking, vaccination and genetically modified organisms. One show called designer tomatoes “good-looking poison.”**", "created_utc": 1588891881.0, "distinguished": null, "id": "fptiigw", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpth7wn", "score": 28, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fptiigw", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fptiigw/"}