{"author": {"comment_karma": 45478, "created_utc": 1540490425.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_C18D42.png", "id": "2h7hy4g9", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 86, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_I_Invent_Stuff", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/I_Invent_Stuff", "key_color": "", "name": "t5_qd41x", "is_default_banner": true, "url": "/user/I_Invent_Stuff/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "I_Invent_Stuff"}, "body": "I went through a period of extreme conspiracy theory addiction. It happened about 10 years ago. \n\nI don't think it has as much to do with age though.... I think it has to do with a natural progression of internet usage. I have noticed that when people start to get internet savvy and start using it to research things in their life, they go through a phase of \"internet discovery\". \n\nFrom beginning to end...\n\n1) they finally learn that the interwebs hold much knowledge and useful information\n\n2) they start to use interwebs a lot more for finding answers and solving problems (they may have used it like this in the past, but now they are looking much deeper into things)\n\n3) Due to 'internetting' more things and going deeper, they are stumbling accross more Fringe videos/articles with pseudo science, conspiracy theories etc. These things catch their eye and since they still have the naivety of someone fairly new to deep dives in the net, they tend to believe them. I think their belief in the fringe science may also have to do with deep seeded psychological fears or something... (I don't really know how to explain it, but for some reason, many people in this stage tend to be proud with their research, and to proclaim that they have found an answer to certain mysteries)\n\n4) They then get stuck on certain conspiracies for a while. They are drawn to believe this stuff for awhile. if they get too deep, they start posting stuff to social media and bringing it up to family and friends. I always find it interesting how different people get drawn into different topics or conspiracies. Like, they really get stuck on a few theories, but they think people are crazy for believing other conspiracies that are just as ridiculous... And they even disregard the conspiracies that are much more reasonable or probable.\n\n5) eventually, like I did, they start to realize the true magnitude and reality of the fact that the internet is full of misinformation and wild theories,. They have now gone down hundreds of rabbit holes on the net and realize that they may have gotten sucked in a little too far. They start to see more and more evidence that the conspiracy theory that they devoted their life too for a few years, is probably not true. They also start to realize that even if it was true, they have no power to change it and that holding their strong belief is actually starting to affect their mental health... and prevent them from being able to live. \n\n6) Finally, if they are self-aware enough, they now realize that they may have gone a little too far and that they need to stop worrying so much about this thing that they read on the internet 4 to 10 years ago. Fortunately, they are a better person for it because it taught them some good lessons. \n\nIf they learned from this experience, they now have a much more grounded view of reality... That anything is possible and that everyone really needs to work hard at filtering what goes into their eyes and ears. It doesn't mean that you should or should not believe things on the net, it just means we have to be smart about where we invest out energy, time, and emotion. \n\nSorry, I went a little deeper than I intended...\n\nHas anyone else noticed what I'm talking about?\n\nBtw, logic will not prevail with people in the middle of a phase like this. There are plenty of articles, blog posts,and videos on the internet to support these people's obsessions. The person in the phase is convinced and there is not much you can do except let them ride the wave until it hits the beach. Just try to softly guide them in and try not to let them do too much harm to themselves or others.\n\nI have to mention that I personally still believe in certain conspiracy theories... What I wrote may make it seem that I don't. I just handle the beliefs differently now. I have learned to mostly keep them to myself unless I think that saying or doing something about it will actually make a positive impact in the world somehow.", "created_utc": 1584631226.0, "distinguished": null, "id": "fkxmiq5", "is_submitter": false, "link_id": "t3_fl9od5", "parent_id": "t1_fkxffcp", "score": 28, "stickied": false, "subreddit_id": "t5_2qhn7", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkxmiq5", "collapsed": false, "permalink": "/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/fkxmiq5/"}