{"author": {"comment_karma": 8317, "created_utc": 1583524390.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "id": "5v52ejej", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 3, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_TrollopingTrubadeur", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_20_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/TrollopingTrubadeur", "key_color": "", "name": "t5_2h3vu5", "is_default_banner": true, "url": "/user/TrollopingTrubadeur/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "TrollopingTrubadeur"}, "body": "> Whatever he says on FB is the gospel and he thinks he’s the one that should be sharing bullshit news to people and they are all like OMG THANK YOU.\n\nHow receptive do you think he would be if you flat out told him that all of that shit is retarded, Facebook is toxic and no one should be on it period? Well, you know in more polite terms anyways \"hey pops about all those things you share.. you do realize that...\"\n\nEdit: my dad who is starting starting to get in to the 2nd half of his 60s generally dislikes FB for the same reasons, has next to 0 friends etc on there and rarely does anything on there. Now, something i have noticed in the past few years with old age creeping in is that he talks more and more to me about the more sensationalist articles than he used to before.. and he is getting more and more engaged by them from his news feed. Kind of worried he is developing some form of senility due to that and minor changes to behavior and say his driving habits.(course corrections that used to be smooth before are now jerky in nature, not paying complete attention to surroundings etc.)\n\n>a brown paper bag in the road,... Like come the fuck on, do you REALLY think this is a thing?\n\nOh you could mess with him on that one a bit. As an army retiree during my time in service we had tons of training on IEDs etc. and yes there are examples of those being filled with things that are well.. not very nice... literally just about any piece of rubbish on the side of the road of sufficient size could be one. On the bad side, someone might take that and push some racist propaganda with it, but on the good.. maybe get the old guys busy to push for improved roadside cleaning and maintenance policies. \n\n>The second part is that even now at family gatherings all of my boomer family members are just sitting on Facebook.\n\nLikely as they have nothing else to do and have conditioned themselves to feel compelled to interact through that venue. \n\n> I fucking despise Facebook and it’s a bunch of bullshit. I’m also the owner of a modest business in my state so I can’t do/say anything on FB these days, I worry some asshat would just come and sabotage the beautiful online reputation I’ve built so, I hold my peace, go on there to creep on past friends to see where there are now it’s really just a place for idiots to feel comfortable. The entire time I’m on I’m just like fuck man these people do not give a SHIT about their reputation these days.\n\nI hear ya, before i joined the army i had a small business too... all it takes is 1 idiot to have a huge impact on things. Though back then social media was still in its infancy. Thats about the only reason i would argue that one should bother \nwith official social media accounts in general is business, if one is a public figure of other sort, or as necessitated by career prospects. The rest of it.. not worth the time and effort to deal with the BS and can be done without the need for a\nFB, linkedin etc accounts. Many people will go on about how convenient it all is to stay in contact, or how they get news about local events through there etc... can do all that via phone, text email etc. and also be able find out about such events from a shitload of venues other than FB anyways. Plus many business pages can be browsed on there without needing a private account anyways.", "created_utc": 1587084613.0, "distinguished": null, "id": "fnn54iz", "is_submitter": false, "link_id": "t3_g2d5md", "parent_id": "t1_fnmu1tg", "score": 3, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587084981.0, "name": "t1_fnn54iz", "collapsed": false, "permalink": "/r/worldnews/comments/g2d5md/british_telecom_boss_reveals_39_engineers/fnn54iz/"}