{"author": {"comment_karma": 2911, "created_utc": 1521115752.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "id": "11n75jmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 65, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_remus213", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/remus213", "key_color": "", "name": "t5_gvsyd", "is_default_banner": true, "url": "/user/remus213/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "remus213"}, "body": "Im sorry I got angry but it's pretty insulting to say to me that basically a topic I have devoted many years of my life to research and develop is \"completely debunked\" by one crackpot guy - it's sort of the equivalent of saying oh btw the periodic table of elements doesn't exist.. elements don't exist it's a hoax to a chemist OR the earth is flat to a physicist.. it's just incredibly insulting tbh. Many of my colleagues are making groundbreaking new research in the field of virology and their work has already gone into saving many lives.. this isn't just theoretical stuff here that's the thing. the amazing thing is this understanding of stuff like virology can literally save so many lives - and actually there has been some try ground breaking research that viruses could be used as treatments for something like cancer. A virus is simply a string of genetic code surrounded by some proteins you could ustulise the viral life cycle to our advantage for example you could.programme a virus to selectively infect cancer cells and integrate generic material which will trigger apoptosis (programmed cell death) in those cells - wouldn't that be amazing - the viruses would basically be like microscopic missiles that would selectively infect cancer cells ONLY and cause programmed cell death in those cells. There are so many positive ways science can make a difference and I find it incredibly insulting to just dismiss everything on the words of some guy u worship - this is FAR more like ACTUAL indoctrination tbh actually GOOD science is the OPPOSITE of indoctrination in fact a good scientist should always ask questions and look past just accepting a fact - In my spare time I enjoy doing just this - ie carrying out famous classic experiments that prove all the things we are told about biology I find that fundamental understanding of things so much more rewarding than simply just accepting a fact as true without questioning WHY it's true. What YOU seem to be doing is accepting anything that's contrary to the mainstream no matter how crackpot or Looney - whilst I applaud a sense of healthy skepticism I wish conspiracy theorists would apply the same level of criticism to their own theories as they seem to do with \"mainstream\" science - something being mainstream certainly shouldn't be an indicator of how true it is in most cases - however the fact that scientists tend to be so skeptical is exactly what makes generally accepted scientific fact more likely to be true than false at least based on current understanding - the fact scientists are trained to be so skeptical means that for something to have reached consensus among all scientists it has REALLY been put through it's paces in terms of incredibly rigourous testing by a vast number of incredibly skeptical ppl - so while mainstream beliefs in most cases do not correlate between truth - the specific example of mainstream / accepted truths in scientific community generally means that to reach the level of acceptance it will have had to have gone through that incredibly rigourous phase of repeat testing ect by multiple incredibly skeptical ppl ONLY things that pass all these skeptics incredibly rigourously following laws of statistics and probability and trying to be as impartial as possible however if anything err on the side of skepticism - also as scientists it's important to constantly challenge the status quo .. this again adds to the fact that science is CONSTANTLY trying to disprove itself and this means the accepted truths that do manage to filter through have really been put through their paces in terms of everyone trying to disprove it as hard as they can before it gets accepted - only the cream of the crop make it to the generally accepted facts level. - I hope this explains to u what science is and helps u understand a bit better - because u seem to think science is indoctrination whereas science is in fact the opposite of that in fact the scientific method is Literally the opposite of indoctrination.. indoctrination is believing something simply because u have been told. Science is being told something - then immediately saying ok let's test it but we must assume first that it is NOT TRUE and even if one paper comes out that suggests it might we must do a lot more research to try and disprove it .. only after something has been through millions of repeats and experiments trying to disprove it - if it still holds up after it's been through all this. Then it is eventually accepted - but even accepted scientific facts should regularly be put through their paces to make sure advances in understanding don't suddenly now disprove it - can't u see how this process is the polar Opposite of indoctrination which is something like a religion where u are told from a young age this thing is true and are told to never doubt or be skeptical or try to disprove it just accept it with no evidence. Science is the opposite of this.", "created_utc": 1586465834.0, "distinguished": null, "id": "fmxiwkf", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t1_fmvn5yj", "score": 2, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmxiwkf", "collapsed": false, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmxiwkf/"}