{"author": {"comment_karma": 41048, "created_utc": 1425214680.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_19_46D160.png", "id": "lqwi6", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1807, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_Shibowen", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_19_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Shibowen", "key_color": "", "name": "t5_d92zb", "is_default_banner": true, "url": "/user/Shibowen/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Shibowen"}, "body": "I don't really find this article convincing, and I don't really see Mr. Rapoza as providing very valuable insight. He included a lot of sources and quotes, but it just didn't add up to what the title claims.\n\nAt least at this point, the Chinese government has convinced its people that they are currently living in the safest country in the world, and while other countries are struggling and coming off the rails, they are proud to know that all those countries who were not so long ago looking down on them (as they saw it) are now asking for help. I seriously doubt these reports about defective face masks or ventilators get widely shared on WeiBo – but correct me if I'm wrong.\n\nWhen it comes to other countries, it's hard to say. People will basically recognize the virus began in China, but I fail to see how that's more important to an Italian, German, or American than what their governments are doing to contain the outbreaks here and now. Though I have to say, here, that I would be more upset if I were a German and heard how America tried to acquire the rights to a german company's vaccine behind closed doors. Can you imagine what people (people in this subreddit in particular) would have said if it had been China caught trying to do that?\n\nMaybe there will be some people in countries like the UK, France, or Germany that would use this crisis as an opportunity to hurt Huawei (America's State Department seems to be doing that), but I would be willing to bet those were already China-skeptics. \n\nHas there been any research by Pew or some other institution to gauge national sentiments towards China? Have any countries that accepted One Belt One Road projects considering repudiating them now? Are any countries considering recognizing Taiwan? \n\nThose are the kind of truly significant changes that I would be curious to see.", "created_utc": 1585630040.0, "distinguished": null, "id": "flzpxiy", "is_submitter": false, "link_id": "t3_fs11kb", "parent_id": "t3_fs11kb", "score": 1, "stickied": false, "subreddit_id": "t5_2qh2v", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_flzpxiy", "collapsed": false, "permalink": "/r/China/comments/fs11kb/the_coronavirus_is_becoming_a_public_relations/flzpxiy/"}