{"author": {"comment_karma": 143623, "created_utc": 1516586445.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_A06A42.png", "id": "t4asleb", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 2463, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_NoPossibility", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/NoPossibility", "key_color": "", "name": "t5_e06t3", "is_default_banner": true, "url": "/user/NoPossibility/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "NoPossibility"}, "body": "Here’s a couple of “can’t do that easily today” theories. These have been talked about elsewhere, I’m sure, but here’s my versions:\n\n1st Idea:\nA state-of-the-art convention center that monitors large crowd movements (100,000+ people at once) using 5G-enabled wrist bands. The AI-powered system in the building utilizes MEC cloud-computing to track the crowds as they move around building throughout the event. Depending on movements, the system alters the environment and building pathways to encourage people to take alternate routes to avoid congestion points, closes/opens gates and doorways to ease congestion during peak entrance/exit times, and keeps track of which booths within the event itself are generating the most intense traffic/congestion so that organizers can make adjustments to the layout of the space during slower periods, ensuring fire safety and helping ensure attendees can smoothly make their way around the event.\n\n2nd Idea:\nA small 5G-enabled Bodega type warehouse running thousands robots to pick commonly ordered items from shelves, pack those items into delivery boxes, and coordinate the flying paths of drones to deliver items within a 20 mile radius. These warehouses don’t have to support humans, so have tightly packed shelves, and therefore can fit in a much smaller footprint. This would allow companies like Amazon, Walgreens, or Whole Foods to have several of these cheaper automated warehouses in major cities, serving heavily populated districts/Burroughs where traditional large warehouses would be impossible to setup, and where land is at a premium. This system could provide 1hr delivery times to most major metro areas without the use of a fleet of trucks, and all the staffing needs and land required to set them up.\n\nAlternatively, these warehouses could be located like traditional warehouses, and send out special freight-sized trucks equipped with a few dozen automated drones to deliver packages within a 1-2 mile radius. The drones are automatically stocked out of the deliveries loaded aboard, and they use 5G to plan / execute their routes to deliver small everyday items to households.", "created_utc": 1586916044.0, "distinguished": null, "id": "fnfv0bv", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fnfk14v", "score": 7, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnfv0bv", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fnfv0bv/"}