{"author": {"comment_karma": 23077, "created_utc": 1470582895.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_0DD3BB.png", "id": "107eut", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 3, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#0DD3BB", "user_is_muted": null, "display_name": "u_kusuriurikun", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_0DD3BB.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/kusuriurikun", "key_color": "", "name": "t5_1bz5r9", "is_default_banner": true, "url": "/user/kusuriurikun/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "kusuriurikun"}, "body": "I'd say they arguably benefit from the \"bucket of crabs\" effect--that is, a bunch of crabs pulling a crab that's climbed out of the pot back in.\n\nSpecifically, as Russia is...behind much of the rest of Europe with 5G transition (largely because about the only ones they can deal with are Huawei thanks to multiple international sanctions programs, and there's a Professional Rivalry between Russia and the PRC on multiple levels so it's entirely likely they're looking at homegrown solutions)...it's to the advantage of the Russians to pretty much trip up everyone ELSE so that nobody can get ahead.  ([This article goes into rather more detail](https://www.nytimes.com/2019/05/12/science/5g-phone-safety-health-russia.html); it should be noted the anti-5G FUD is explicitly targeted at *countries outside Russia*, whilst *within Russia* the news is all about how Russia is Leaping Into The Future by modernizing its infrastructure so it CAN roll out 5G sometime in future.)\n\nReally and truly, this is pretty much Russian official international policy at this point; [one of the literal textbooks on international geopolitics used in the Russian military and government as a Manual of Operations effectively describes Weaponised Trolling for purposes of socially monkeywrenching any potential competition](https://en.wikipedia.org/wiki/Foundations_of_Geopolitics).  As a part of this, there's also some real evidence that the Russians have certainly *encouraged* a lot of similar woo (including antivax woo, notably; again, this is to make the Russians look good in comparison, especially as rates for vaccination against childhood diseases like measles, diphtheria and especially pertussis vaccination rates are lower in Russia versus the rest of Europe).  They've also been documented as encouraging secessionist groups in the US--both on the left-wing/progressive end (such as the proposal for California to secede in the #calexit campaign) AND on the far-right (with neo-Confederate groups like League of the South).  \n\nThe main point being...whatever causes chaos for the Other Guys is seen as beneficial to Russia in this case.  Making 5G effectively a Third Rail to implement helps Russia because it lets them play \"catch-up\" while rollout is delayed elsewhere due to FUD.  Antivax stuff helps Russia in making its own vaccination totals look good and letting them play some whataboutism when Karen is the source of a pandemic.  Keeping politics an omnishambles in the US (on both the left and right) helps Russia, partly because they can't get enough organization together to pass something like Magnitsky Act sanctions, and partly so the US is seen as Unreliable (especially for stuff like, oh, selling oil or engaging in defense treaties or whatnot)--and when they DO decide to recapture another piece of the former Soviet Union in the name of making another Potemkin Breakaway Republic That Just Coincidentally Is Founded By Russian-Ethnic-Origin Folks In That Breakaway Lozengestan, pretty much everyone's at everyone else's throats too much to actually agree to do sanctions or lend military or other assistance to the country having its Russian-Ethnic Population Embraced And Russia's De Facto Territory Extended.", "created_utc": 1586924875.0, "distinguished": null, "id": "fng8dpi", "is_submitter": false, "link_id": "t3_g1g8q8", "parent_id": "t1_fng35jd", "score": 33, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586925251.0, "name": "t1_fng8dpi", "collapsed": false, "permalink": "/r/worldnews/comments/g1g8q8/people_are_burning_down_5g_cell_phone_towers_over/fng8dpi/"}