{"author": {"comment_karma": 75639, "created_utc": 1476035417.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_15_A06A42.png", "id": "1200me", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 32315, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_Ochib", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_15_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Ochib", "key_color": "", "name": "t5_b1ya4", "is_default_banner": true, "url": "/user/Ochib/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Ochib"}, "body": "But Cisco have backdoors in their hardware,  Cisco would not use their equipment for hacking or DDos. But a government organisation that new about the backdoors could.  \n\n\nIn 2013, revelations made by German paper Der Spiegel showed that the NSA was taking advantage of certain backdoors in Cisco’s routers. Cisco denied accusations that it was working with the NSA to implement these backdoors.\n\nIn 2014, a new undocumented backdoor was found in Cisco’s routers for small businesses, which could allow attackers to access user credentials and issue arbitrary commands with escalated privileges.\n\nIn 2015, a group of state-sponsored attackers started installing a malicious backdoor in Cisco’s routers by taking advantage of many of the routers that kept the default administrative credentials, instead of changing them to something else.\n\nIn 2017, Cisco, with help from a Wikileaks data leak, discovered a vulnerability in its own routers that allowed the CIA to remotely command over 300 of Cisco’s switch models via a hardware vulnerability.\n\n\n2018 brought five undocumented backdoors in Cisco’s routers. In March, a hardcoded account with the username “cisco” was revealed. The backdoor would have allowed attackers to access over 8.5 million Cisco routers and switches remotely.\n\nThat same month, another hardcoded password was found for Cisco's Prime Collaboration Provisioning (PCP) software, which is used for remote installation of Cisco’s video and voice products.\n\nLater in May, Cisco found another undocumented backdoor account in Cisco’s Digital Network Architecture (DNA) Center, used by enterprises for the provisioning of devices across a network.\n\nIn June, yet another backdoor account was found in Cisco’s Cisco’s Wide Area Application Services (WAAS), a software tool for Wide Area Network (WAN) traffic optimization.", "created_utc": 1587196362.0, "distinguished": null, "id": "fnrp3ua", "is_submitter": false, "link_id": "t3_g3iiuz", "parent_id": "t1_fnroc28", "score": 6, "stickied": false, "subreddit_id": "t5_2qhcv", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnrp3ua", "collapsed": false, "permalink": "/r/ukpolitics/comments/g3iiuz/uk_moves_to_drop_huawei_as_5g_vendor_citing_china/fnrp3ua/"}