{"author": {"comment_karma": -14, "created_utc": 1508774134.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_46D160.png", "id": "idc4fmp", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": false, "link_karma": 32, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_swuadion", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_10_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/swuadion", "key_color": "", "name": "t5_5p4lr", "is_default_banner": true, "url": "/user/swuadion/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "swuadion"}, "body": "There are certain people called \"targeted individuals\" who are involuntary test subjects to psycho-electronic weapons which can affect the mind and body remotely. Enough reports from people have resulted in a Wikipedia page on \"Electronic Harassment\" discrediting them as being mentally ill, suffering from hallucinations. This is a cover-up for the public to simply believe that all these people are mentally ill when in fact there are not and really being harassed/tortured with unbelievably advanced weaponry. \n\nSomething that strengthened legitimacy towards targeted individuals was the 2018 U.S. government leak of three documents on remote mind control and remote brain mapping. You can find these documents by searching \"Remote Mind Control\". One document titled “Psycho-Electronic Weapon Effects” had a diagram of the human body with lines pointing to various parts of the body with text such as “Reading and broadcasting thoughts”, “Controlled dreams”, “Forced memory blanking and induced erroneous actions”, “Remotely induced violent no-rash itching...”, “Forced nudging of arm”, as well as various other effects. Another document listed bioelectric resonance frequencies which corresponded to different brain areas, one being the “thought center”, having the ability to “impose subconscious thoughts”. This document also contains text reading “mass and individual remote mind control via the mobile phone network and mobile phones\", showing illustrations of cell towers. The third document leaked is about frequencies of different human brain waves and reads “bio-electromagnetic field which is unique for every human body”. These documents were in the hands of the U.S. government, and when looked at in conjunction with reports of various targeted individuals it is clear that all these functionalities are active today. \nThese covert crimes have continued for many years without the media or public having any awareness because these people are discredited. Personally, I am a TI who has gone through a lot (gangstalking, electronic harassment, mind control of those around me) so I am dedicated to inform the public.", "created_utc": 1586142295.0, "distinguished": null, "id": "fmk1hcy", "is_submitter": false, "link_id": "t3_fvlm8b", "parent_id": "t1_fmk0hvf", "score": -15, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586143407.0, "name": "t1_fmk1hcy", "collapsed": true, "permalink": "/r/worldnews/comments/fvlm8b/youtube_will_suppress_content_promoting_false_5g/fmk1hcy/"}