{"author": {"comment_karma": 2911, "created_utc": 1521115752.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "id": "11n75jmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 65, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_remus213", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/remus213", "key_color": "", "name": "t5_gvsyd", "is_default_banner": true, "url": "/user/remus213/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "remus213"}, "body": "It's not indoctrination.. it's just science mate. Everything I have said can be proved with repeatable experiments - and most importantly it actually works if science was so wrong about everything how is it that planes fly, cars work, medicine cures ppl - I have even been involved in the research and production of new antiviral medications and the fact they work isn't just down to magic .. it works because u design them based on scientific understanding ie things like the lifecycle of viruses / DNA transcription / translation- its just for someone as involved in the field as me it's so easy to see why it is true - it may be harder for u as u clearly don't have a knowledge of these things. A huge amount of modern biology and medicine is based on the fundamental aspects of biochemistry - How DNA works is well understood and this is how we do things like genetic engineering ect I have done loads of genetic experiments myself I have altered the genome of bacteria so they produce green florescent protein - this is useful as a marker - ie if u want to clearly see where a specific species of bacteria are on a petri dish u just shine uv light and bacteria that are engineered to produce GFP (green florescent protein) clearly show.. this is all works because of our understanding of biology - if we were wrong about this stuff literally none of it would work .. at all.\n\n  yeh sorry for loosing my temper it's just very frustrating how low scientific literacy is in general nowadays and I get it... Ppl have a fear of the unknown - often the unknown is much more scary to someone than even simething that is a potential theat but KNOWN. It's quite interesting the psychology behind conspiracy theories that tend to erupt around scientific and medical fields because ppl have such a poor understanding of how this stuff works - in a way it is sort of comforting  for a lot of ppl to create some crazy theory and have that theory laid out in terms that bring it down to your level of understanding .. ppl feel like at least they know what's going on. Whereas to someone with no understanding of how vaccines work can be pretty frightened by this mysterious unknown solution being injected into them - when u understand things clearly it's not scary at all and u feel very safe and certain. It is a fact of psychology that ppl fear the unknown above almost everything else and therefore in a way it is not suprising there are so many conspiracies around medicine/science it's an attempt to try and rationalise something that is completely not understandable to y and is therefore frightening.", "created_utc": 1586462930.0, "distinguished": null, "id": "fmxdg7v", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t1_fmwpkbj", "score": 2, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmxdg7v", "collapsed": false, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmxdg7v/"}