{"author": {"comment_karma": 70606, "created_utc": 1480261348.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_24A0ED.png", "id": "134ifv", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 9551, "subreddit": {"default_set": false, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#24A0ED", "user_is_muted": null, "display_name": "u_MrSoapbox", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_08_24A0ED.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/MrSoapbox", "key_color": "", "name": "t5_d9b9t", "is_default_banner": true, "url": "/user/MrSoapbox/", "banner_size": null, "user_is_moderator": null, "public_description": "Messages switched OFF, so don't waste your time. Also, happy to dismiss shills and won't waste time reading their predictable wall of text whatabouting, deflecting", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "MrSoapbox"}, "body": "You should see david ickes son on FB, what an absolute farce and joke. Anti vaxx, 5g conspiracy, climate denier, russia good UK evil...he is the full works, and has a ton of followers all repeating the same utter shit. The sad truth is, they think they are some enlightened group that's intelligent and anyone else is \"sheeple who need to wake up\" and manipulated. \n\nDon't get me wrong, I am highly, _highly_ sceptical of the main stream media, I see the BBC's bias and stuff but generally this is more political...I say generally because sometimes they do some weird stuff, but when the BBC et all is the enemy but Russia today, sputnik and weird ass facebook groups are \"the only truth\" it's an issue. You can guess he was absolutely against the EU and posted a lot of bullshit with that too. \n\nAt the moment he is posting about hospitals being empty and 5g being linked to coronavirus and a government ploy to get us to have vaccines for...I don't know what reason anymore, to implant some tracker chip in us or something...and it's the world order doing it all to take away our rights and freedoms. Also today he posted some identical image of the 13 year old boy who died where daily mail reported a 14 year old in Portugal and some facebook group posting the same picture of the 13 year old here, basically implying it's \"fake\" because the MSM have an agenda and this is somehow proof of that. His excuse when called out on it \"Well, I didn't say anything, I just posted a picture\"\n\nYeah...right...He damn well knows how idiotic and low IQ his followers are (or maybe not, for someone so enlightened it's amusing to see the type of base he generalises with), basically instigating it. Of course, if youtube or FB remove his misinformation, it's an assault on his freedom of speech. The whole rallying a group for antivax and trying to create division by saying the government needs to fuck off because he's going out after 3 weeks of the lockdown, is a problem. I am never one to side with the government, always call them out etc but there are times, like this, when people need to put away the conspiracy bullshit because it's selfish, dangerous, petty and costing lives. \n\nThe sad fact is, it isn't one or two people acting like this, I know there's a lot of thick as pig shit idiots in this country and usually you can just laugh at their utter lack of intelligence, but at this time, their lack of intelligence is causing real harm.", "created_utc": 1585997618.0, "distinguished": null, "id": "fmebjbe", "is_submitter": false, "link_id": "t3_fuetsu", "parent_id": "t1_fmcbfww", "score": 5, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmebjbe", "collapsed": false, "permalink": "/r/unitedkingdom/comments/fuetsu/broadband_engineers_threatened_due_to_5g/fmebjbe/"}