{"author": {"comment_karma": 20226, "created_utc": 1325745465.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_C18D42.png", "id": "6l5ko", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 491, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#C18D42", "user_is_muted": null, "display_name": "u_Ch3mee", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_17_C18D42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Ch3mee", "key_color": "", "name": "t5_1yz7pk", "is_default_banner": true, "url": "/user/Ch3mee/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Ch3mee"}, "body": "Do you even know what the wavelength is on 5G. Lol.  And you think it’s ionizing?  Cause it’s going to “penetrate”. Lol.  Wavelength is 1-10mm.  Which is very wide when looking at things from an ionizing standpoint.  You’re not going to hit cells, let alone molecules with a 1mm wavelength?\n\nYeah, you posted sources comparing non-ionizing radiation vs ionizing radiation, and you don’t even know the difference between the two. We are done.  You were done when you posted those links because they back me up.\n\nEdit: if you’re following along, he is trying to claim 5G is ionizing radiation (it isn’t). Ionizing radiation would be things with very small wavelengths.  Sub-microwave (X-rays, Gamma waves, etc..).  Generally, the smaller the wavelength the more damage it can do.  You can do damage with higher wavelengths, but you need a LOT of power.  5G waves are pretty wide.  Like, a little bit smaller wavelength than WiFi, but wider than infrared, or visible light.  Yes, visible light has a narrower wavelength than 5G.  Visible light isn’t harmful and the sun puts out all spectrums of light from radio wave to UV.   UV is where the spectrum becomes ionizing.  Even worse is X-ray (smaller wavelength) and even worse is gamma ray (smallest wavelengths). Gamma rays are very, very dangerous.  \n\nYou can increase danger and make some rays that arent usually harmful, harmful by increasing the power.  Airfield radar and some Doppler station use megawatts of power.  Standing right against the transmission is harmful.  \n\n5G is just a wave.  It’s light.  That’s all it is.  Just a wider spectrum than eyes can process.  \n\nThis guy doesn’t understand this.  This is why he started talking abut fields.  EM fields are generated via and entirely different process.   The light (wave, 5G) is what’s given for from this process.  Again, it’s all about the power level.  Standing next to an electric motor is orders of magnitude more powerful in inductive fields than a cellphone.  EM fields can be bad if, for example, you live under high voltage lines where inductive fields can be wide and powerful.  Cellphones, though, generate very tiny fields in comparison.   The cell towers have bigger fields coming off this, but the fields drop off exponentially with distance.  Again, high power lines generate more powerful fields than cell towers, so, in theory, it’s safer to be closer to a cell tower than transmission lines.  \n\nBut, yeah, this whole thing is silly.  Dude doesn’t know what links he is posting.  He obviously has no real, qualifiable, education in EM theory or application.\n\nReally, the EM waves that heat give off (infrared) is more ionizing than 5G.  Visible light is more ionizing than 5G.  There is no more risk with 5G than you are already experiencing putting your cellphone to your head (inductive fields) which has already been proven to be hokum\n\n[Link](https://www.howtogeek.com/423720/how-worried-should-you-be-about-the-health-risks-of-5g/)\n\n> Dr. Steve Novella, an assistant professor of neurology at Yale and the editor of Science-Based Medicine, understands that people generally get concerned about radiation. “Using the term radiation is misleading because people think of nuclear weapons—they think of ionizing radiation that absolutely can cause damage. It can kill cells. It can cause DNA mutations.” But since non-ionizing radiation doesn’t cause DNA damage or tissue damage, Novella says that most concern about cell phone RFR is misplaced. “There’s no known mechanism for most forms of non-ionizing radiation to even have a biological effect,” he says.", "created_utc": 1587258250.0, "distinguished": null, "id": "fnub1sv", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnua6kg", "score": 4, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587301180.0, "name": "t1_fnub1sv", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnub1sv/"}