{"author": {"comment_karma": 60970, "created_utc": 1304907787.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A5A4A4.png", "id": "57jwg", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 10343, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_erythro", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/erythro", "key_color": "", "name": "t5_20420t", "is_default_banner": true, "url": "/user/erythro/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "erythro"}, "body": ">Of course it is insane. It is utterly insane. I generally assume that all images on the internet are utterly faked.\n\nIt's not something you even need to assume, you can look at the image and see\n\n>The Law is actually quite pedantic about things such as libel and contempt of Court and Judges, unlike me, do treat images in this way\n\nMy layman's understanding is that there's the \"man on the Clapham bus\"/\"reasonable man\" test for this sort of thing.  If a reasonable man would think that this was an attempt at framing the edit as a historical reality rather than an obvious parody, then it would be libellous.  This is the line I'm arguing down; it is plainly obvious to reasonable people that Rachel's image is an edit and is not a deception.\n\n>As if it were their first day on the Internet. Now I am never going to be in a position to hand down Judgements but they are.\n\nWhat's your point here?  Do you agree it's unreasonable to interpret Riley's image as deceptive or not?\n\n>You say it is insane to suggest that people with genuine power might want standards that they approve of.\n\nNo, I'm saying it's insane to say that Rachel's image is deceptive because she didn't source the original.  The image is clearly an edit without that source.\n\n>But, from your response, it seems you are aware that there *is* a *big battle* going on.\n\nMy clue was I say \"the image is an obvious edit\" and you think a normal response was \"well I've gotcha then because Riley is suing someone for libel\" as if they were related.\n\n>So you have already defaulted to taking sides. You have sided with Rachel Riley\n\nNo lol, it's possible to hold any combination of views on the Corbyn image being deceptive and Riley's suit being justified.\n\n>There are people who have been deceived by the image but they do not matter to you.\n\nWell sort of.  They matter as people, but I think it would be unreasonable to **expect** someone to account for them when they publish things.  Some people are always going to misunderstand you, the issue is whether that's a reasonable interpretation of what you're saying.\n\n>Because you are happy to defend the idea that the image is not deceptive. Which is fine. But you do have to say that you have taken sides. failure to do so is, in itself, deceptive.\n\nI've taken a side on whether the Corbyn edit is deceptive, I'm not taking a side on whether her lawsuit is justified.  These things aren't related to me.  To you, apparently, they are, in some wider pro-/anti- Rachel Riley war that I'm not involved in.\n\n>It really is not about attacking you but about highlighting just how easy it is to change what people are allowed to think. Which is highly relevant to the 5G Coronavirus conspiracy theories: they all contribute to the most facile, idiotic way of thinking. They actively dumb down society so that people do not make critical, reasoned, judgements about the behaviour of people like Riley - and it is nothing personal against the woman, it could be anybody who rocks up to an idiot box near you and spouts their own opinions with all the authority that an Afternoon Quiz Show Contract now vests in people.\n\nThis is just waffle sorry.  Riley's edit is just making a point, you might not like the point but image edits are a fine way of making points.  It's not opening the door to a dumbed down society or anything like that.\n\n>For the record: nor am I.\n\nThen why did you present the lawsuit as a gotcha response to me saying \"it's an obvious edit\"?  I don't understand why you thought it was relevant?", "created_utc": 1585991948.0, "distinguished": null, "id": "fme6xis", "is_submitter": false, "link_id": "t3_fuetsu", "parent_id": "t1_fme40ta", "score": -1, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": 1585992227.0, "name": "t1_fme6xis", "collapsed": false, "permalink": "/r/unitedkingdom/comments/fuetsu/broadband_engineers_threatened_due_to_5g/fme6xis/"}