{"author": {"comment_karma": 282, "created_utc": 1563026072.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_DDBD37.png", "id": "2841xuut", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DDBD37", "user_is_muted": null, "display_name": "u_Basteir", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_18_DDBD37.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Basteir", "key_color": "", "name": "t5_1sc77y", "is_default_banner": true, "url": "/user/Basteir/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Basteir"}, "body": ">A microwave excites hydrogen, heats up your food.\n\nNo it doesn't, it excites polar molecules, such as water and fats, or nitric acid. Would work with ammonium too probably.\n\nA microwave usually uses 2.45 GHz so as not to interfere with other signals, but it could use a very wide range, there isn't some specific resonance frequency. It doesn't excite hydrogen atoms. Water is a polar molecule (because oxygen is a little more electronegative than hydrogen, it pulls the electrons in the bond closer to it, making the oxygen a bit more negative than the two hydrogens)\n\nLike this:\n\nH+     H+  \n   \\\\    /  \nO -\n\nSo because water and other molecules are slightly polar charged, they rotate to align with the alternating electric field of the microwaves. Bare in mind they are rotating and flying about incredibly fast anyway, because that's what temperature is unless you are at absolutely zero, it just speeds them up, heating the food.\n\nSo, a couple of points against your ... hypothesis, which blows it out of the water.\n\n1) Oxygen, O2,  O - O, is not a polar molecule, it wouldn't be affected by any non-ionising radiation. End of story...\n\n2) To get the above phenomenon to work, a commercial microwave is 1000 W of power trapped in a small box.\n\nFrom 5 minutes of research:  \n5G will use the band 600 MHz to 86 GHz.\n\nThat includes the range of frequencies commercial microwaves operate at. \n\nBut a mobile phone tower, a walkie-talkie, your phone etc. are sending out a SIGNAL that loses power cubic-exponentially (distance\\^1/3) as they propagate outwards in 3 dimensions. Signals aren't requiring a lot of power, you aren't trying to transfer lots of energy, it's just a signal.\n\nA mobile phone tower outputs a signal with a strength of 10 W at source.\n\nYour phone outputs a signal with a strength of 0.3-3 W at source.\n\nIt'll be getting absorbed by water in the air or \n\nIf you directly wrapped your hand around a tower aerial, it might warm your hand up a bit maybe? That's about it. Someone said they got burned by putting their hand right in front of a 600 W radar beam, that's a focused beam, which is 60 times stronger than a tower aerial that is not focused. or 200 times stronger than a phone, also not focused, i.e. virtually no heating effect.\n\nSo O2 being a bit hotter, rotating a bit faster (which it WOUDN'T, because it's not a polar molecule),  when it's already rotating and flying around at hundreds of metres per second (what gas molecules are doing at room temperature) having a detrimental effect on your breathing even 1 metre away from a tower, is ludicrous.\n\nPlease educate yourself.", "created_utc": 1586913098.0, "distinguished": null, "id": "fnfq2ma", "is_submitter": false, "link_id": "t3_g193vt", "parent_id": "t1_fnepapn", "score": 12, "stickied": false, "subreddit_id": "t5_2qkli", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fnfq2ma", "collapsed": false, "permalink": "/r/Scotland/comments/g193vt/south_ayrshire_phone_mast_set_on_fire_after/fnfq2ma/"}