{"author": {"comment_karma": 16397, "created_utc": 1437751087.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FF585B.png", "id": "p1ma0", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 4048, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_OrphanSaturn", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/OrphanSaturn", "key_color": "", "name": "t5_d9jio", "is_default_banner": true, "url": "/user/OrphanSaturn/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "OrphanSaturn"}, "body": "I just don't think it's massively useful to push pretty one-dimensional ideas of the 'dark ages', when it's pretty Victorian scholarship. \n\nWhat exactly was lost or suppressed? Yes, certainly, the Catholic church did proscribe certain scholarship, but for the most part, it was the largest patron of scholarship as its material power was maintained during a prolonged era of disruption and decentralisation of secular power.\n\nMoreover, the massive cultural gravity of the Byzantine Empire (particularly in the 10th and 11th century) is completely missed by your POV. Yes it remained 'eastern' to many European polities, but it was no less influential for that, and the renaissance and reclamation of ancient texts owed a great deal to the Byzantine empire as well. \n\nIt's essentially *just* a shitpost, and unless you're going to go into detail that warrants more comprehensive response, then it's hardly scummy to be pretty dismissive. What exactly have I ignored?\n\nA lot of your concerns, as far as I can tell, are regarding developments that took place long before the Roman Empire actually fell. Architecture and sculpture became more simplistic in many cases following the crisis of the third century, and the transition to payment in kind, plagues, and breakdown of imperial control led to far more localism and differentiation from the classical Roman world than, in many cases, the fall of the Roman Empire did to what followed. There was ample continuity in all the Romanised regions, and even outside these in the West, Rome retained its gravitas for legitimacy.\n\nHell, look at the opulence, grandeur and massive size of the Merovingian and Carolingian empires, both of which in many aspects drew substantially from the late Roman world. But fundamentally, this was from the late Roman world, not the classical Roman world directly.\n\nAnd finally, if you're insistent on Arab sources being the saviour of Roman knowledge - most of these were obtained from the Byzantine Emperor Theophilos. Owing to the Byzantine position in Italy and the Aegean, and the development of Italian city states, these were also available here, prior to their separate reintroduction from Arab sources later on.\n\nEdit: and finally finally - I've stated that Western Europe was a comparative backwater. This, however, is worlds apart from the dark age cesspool whose link to the ancients needed rescuing by Arab scholarship that you portrayed.", "created_utc": 1586036402.0, "distinguished": null, "id": "fmfwnqu", "is_submitter": false, "link_id": "t3_furdeu", "parent_id": "t1_fmfv8ni", "score": 1, "stickied": false, "subreddit_id": "t5_2qhcv", "downs": 0, "total_awards_received": 0, "edited": 1586036713.0, "name": "t1_fmfwnqu", "collapsed": false, "permalink": "/r/ukpolitics/comments/furdeu/masts_set_on_fire_over_false_5g_coronavirus_claims/fmfwnqu/"}