{"author": {"comment_karma": 40, "created_utc": 1513698819.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_46A508.png", "id": "ovs7781", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 92, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46A508", "user_is_muted": null, "display_name": "u_Jklarbaless", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_46A508.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Jklarbaless", "key_color": "", "name": "t5_9kw62", "is_default_banner": true, "url": "/user/Jklarbaless/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Jklarbaless"}, "body": "This article lacks any real substance. \n\nPaul Heroux, one of the authors does hold a position at McGill although he honestly does not seem competent. Just looking into his name briefly, I found a reddit AMA in which several credible PHDs dispute the conclusions he found in a few of the papers. He didn't bother to respond to anything except a couple of loosely relevant comments. I found a testimony he gave at a court hearing regarding something to do with 5g implementation and he again gave a substance less explanation and blatantly used rhetorical strategies over science.\n\nHe even claimed that the existence of Electromagnetic hypersensitivity disorder showed proof of his claims that this radiation is harmful to biological life as these people can feel pain when they are in the presence of radiation. \n\nLooking into a study he cited claiming it shows the harm radio waves can have on cells, the study again loosely tacks science to propaganda claiming that the modulation of polarized radio waves prevents cells from adapting to the radiation level, leaving the possibility for cell regulatory systems to be disrupted on the basis that these radio waves interact with the electrical charge gradients that many of these systems rely on. \n\nLike the paper that you linked, this one did not contain any meaningful information until the last 3 paragraphs, only one of which was dedicated to explaining the above mechanism. I also thought that it was ridiculous that this study claimed to have different results from similar studies because this one used radiation from commercial cell phone equipment while also claiming that this study tested the effects of radiation with a much higher intensity than in other studies without specifying what the equipment was or the radio wave intensity. \n\nLooking into the effect of EM radiation on electric charge, there is something called the photoelectric effect allowing for EM waves to induce charge in materials that absorb it. An important caveat being that this effect is only observable with waves on the completely other end of the light spectrum, radio waves simply don't have enough energy. \n\nWhat gets me is does anyone stand to benefit from this conspiracy? How the fuck did anyone ever believe that 5g causes Corona? Why are people attacking 5g towers?\n\nPlease drop some shit on me if you think I am being short sighted, Im definitely no expert. \n\nIf anyone wants to get to the bottom of this shit with me I can add links", "created_utc": 1586678727.0, "distinguished": null, "id": "fn5wuei", "is_submitter": false, "link_id": "t3_fwvf0s", "parent_id": "t1_fmroyp3", "score": 6, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fn5wuei", "collapsed": false, "permalink": "/r/conspiracy/comments/fwvf0s/if_184_countries_have_coronavirus_and_only_five/fn5wuei/"}