{"author": {"comment_karma": 2911, "created_utc": 1521115752.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "id": "11n75jmm", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 65, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_remus213", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/remus213", "key_color": "", "name": "t5_gvsyd", "is_default_banner": true, "url": "/user/remus213/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "remus213"}, "body": "What are u talking about..\"debunks everyrhing I said\" this is literally just simple facts about basic biology u retard.. it really frustrates me that scientific literacy is so low.among the general population.. if it wasn't so low ppl would have an actual understanding of some of the most basic scientific concepts.. come on this is literally ENTRY LEVEL stuff mate. I\nThis isnt some out there crackpot theory this kind of knowledge about biology is like as certain as the fact the sun goes round the moon. - basic stuff about how DNA codes for proteins ect... \n\nI have literally done so basic repeatble genetic experiments in the University I study in (Imperial College London) that prove consistency with this knowledge. This isn't like some kind of debatable thing here like it's literally just as solid a fact as evolutionary theory.\n\nI knew ppl were dumb.. but I didn't realise ppl were so dumb as to think the words of David Icke disprove Literally some of the most basic fundamentals of biology.. also btw if you hadn't noticed MEDICINE WORKS 😅 - this kind of KNOWLEDGE about how viruses work has lead to the creation of a whole.host of different antiviral drugs that actually work btw if the knowledge was wrong none of these drugs would actually work u idiot... - one example of this is HIV - this used to be a disease with a 100% mortality rate it would slowly kill ppl as they died in agony. The devolpment of anti-HIV drugs obviously uses the knowledge about how retroviruses actually WORK to target key stages in the viral lifecycle in order to inhibit the virus from making any kind of progress. One group of drugs that treat HIV are called \"Reverse Transcriptase inhibitors\" - these drugs inhibit a viral enzyme which reverse transcribes viral mRNA into DNA this is the DNA that would then be integrated into the host cells genome by an enzyme called INTEGRASE - guess what another group of HIV drugs are called .. you got it INTEGRASE inhibitors - enzyme inhibitors basically are chemicals that bind to enzymes and turn off their function basically so if reverse Transcriptase and INTEGRASE enzymes are inhibited the virus cannot integrate it's genome into the host cell and therefore cannot hijack that host crlls cellular machinery and create more viruses. These are just two tiny examples of how having an in-depth knowledge of how viruses work actually contributes to medicine in a way that is massively visible to society .. NO ONE dies because of HIV now it is completely treatable - and this is a DIRECT resukt if the knowledge I was just talking about up there .. this isn't just all hypothetical stuff u have to just accept.. there are real life consequences to actual knowing things like how the virus lifecycle works in INCREDIBLY specific ways - right down to the exact chemical structure of individual enzymes in the viral lifecycle - allows us to create medicines that will save lives. MEDICINE WORKS lol and this doesn't just happen by magic by the way ... It requires in depth knowledge of Biochemistry and biochemical pathways ect there are many thousands of effective medicines that have been created using the knowledge about the viral lifecycle .. it's not some crackpot idea it's verifiable and you don't have to take my word for it either there are plenty of repeatable verifyable experiments that prove things like this.\n\nI do agree however that The American pharmceutical industry in particular is a VERY nasty piece of work for example the person who recently gained the patent to many lifesaving HIV drugs increased the price by something like 9000% this is truly evil and deplorable behavior in my opinion.", "created_utc": 1586439306.0, "distinguished": null, "id": "fmw4fwm", "is_submitter": false, "link_id": "t3_fxaxsf", "parent_id": "t1_fmvn5yj", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmw4fwm", "collapsed": false, "permalink": "/r/conspiracy/comments/fxaxsf/for_anyone_who_didnt_get_to_see_david_ickes_talk/fmw4fwm/"}