{"author": {"comment_karma": 4231, "created_utc": 1569167487.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_FF8717.png", "id": "4n5vy2ug", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 34, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF8717", "user_is_muted": null, "display_name": "u_SirBoBo7", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_FF8717.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/SirBoBo7", "key_color": "", "name": "t5_25an07", "is_default_banner": true, "url": "/user/SirBoBo7/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "SirBoBo7"}, "body": "You really are a delusional idiot aren’t you, don’t you read what you write before you post it? \n\nYou just said scientists like Issac Newton and Charles Darwin didn’t have the ability to think rationally along something like 75% of the population of earth. \n\nThe definition of a straw man I gave doesn’t match the exact description but it’s still a type of straw man, but even so I didn’t give a straw man argument there, you said religions wouldn’t want people to think rationally and listen to science I gave examples of religions being rational and listening to science as well as excepting scientific theories and telling their followers to do the same, thus proving religions don’t oppose rational thinking. I didn’t diverge from your argument I opposed it and in response you’ve acted irrationally and instead of trying to counter anything I said with a actual example, you’ve now doubled down on your own beliefs without showing me facts or examples of why your original statement was factual and wasn’t anything more than your own opinion. \n\nReligions haven’t said they know every answer they state what they believe their god told them, these facts have always been up for interpretation regardless of what science has said, since you used the Christian creation story I’ll do the same, you can take it factual that god made the world in 6 days and created Eve from Adams rib or you can say those 6 days were ages of creation or a different amount of time for us than god, you can say Eve being created from Adams rib is DNA being reused or you can all say it’s simply symbolism, furthermore religions haven’t retreated, the Koran, Torah or Bible haven’t had their texted reworded or deleted, they may have been translated into other languages and lost some meaning and others may have published their own version but the original bible is still available, the only thing that’s changed have various churches have reinterpreted them based on scientific studies but that’s not giving in to science that’s listening to it. \n\nYour reinforcement of the point that religions can’t be rational and reinterpret their texts based on science makes you hypocritical and your overall point that religions don’t want people to be rational invalid. \n\nYou clearly haven’t learnt that religions and science can coexist and still believes that religions somehow a bad thing and your holyer than thou attitude is grating. If you’re not going to respond with a actual counter point which isn’t your opinion please don’t respond at all.", "created_utc": 1586170396.0, "distinguished": null, "id": "fmkvn4p", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmkoo85", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmkvn4p", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmkvn4p/"}