{"author": {"comment_karma": 4278, "created_utc": 1526423286.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_19_008985.png", "id": "1dlaz8uu", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 24143, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_zimbaboo", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_19_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/zimbaboo", "key_color": "", "name": "t5_j8b73", "is_default_banner": true, "url": "/user/zimbaboo/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "zimbaboo"}, "body": "Let me pull out select statements from each one:\n\n&#x200B;\n\n1. \"Several methodologic limitations prevent our results from providing clear evidence on the hypothesized association.\"\n2. \"We did not observe higher risk with increased exposure duration or latency. Although this study is limited by the use of a qualitative exposure matrix and the relatively young age of the cohort, our findings do not support an association between occupational RF exposure and brain cancers or lymphoma/leukemia.\"\n3. \"Our data suggest that use of handheld cellular telephones is not associated with risk of brain cancer, but further studies are needed to account for longer induction periods, especially for slow-growing tumors with neuronal features.\"\n4. \"Our results suggest that long-term mobile phone use may be associated with an increased risk of glioma... However, current evidence is of poor quality and limited quantity. It is therefore necessary to conduct large sample, high quality research or better characterization of any potential association between long-term ipsilateral mobile phone use and glioma risk.\"\n5. \"Twenty-two case control studies were included for systematic review. Meta-analysis of 14 case-control studies showed practically no increase in risk of brain tumour \\[OR 1.03 (95% CI 0.92-1.14)\\]. However, for mobile phone use of 10 years or longer (or >1640 h), the overall result of the meta-analysis showed a significant 1.33 times increase in risk. The summary estimate of government funded as well as phone industry funded studies showed 1.07 times increase in odds which was not significant ... We found evidence linking mobile phone use and risk of brain tumours especially in long-term users (≥10 years). Studies with higher quality showed a trend towards high risk of brain tumour, while lower quality showed a trend towards lower risk/protection.\"\n6. \"RF radiation should be regarded as a human carcinogen causing glioma.\"\n7. \"There was little evidence of an increase in the risk of meningioma, acoustic neuroma, or parotid gland tumors in relation to mobile phone use.\"\n8. \"The results support the hypothesis that long-term use of mobile phone increases risk of intracranial tumors, especially in the case of ipsilateral exposure. Further studies are needed to confirm this relationship.\"\n\n&#x200B;\n\nI'm not saying that there are no risks, but with such varied data and inconsistencies, and the majority of studies showing little to no risk, it cannot be determined that low frequency EMR is a cause of illness. There may be correlation, but that rarely provides answers of causality. For example, I live in a state with an above average youth sucide rate. Scientists have done studies that show a much stronger correlation of suicide with things from higher altitudes, air pollution, religiously homogenous cultures and so forth. However, they do not have the statistical data or clear evidence that any one of these are actually the reason for the suicides.\n\n&#x200B;\n\nAs the link I shared above reported, there are just too many variables and lifestyles and external influences to determine a risk of prolonged low-frequency EMF usage. By all means, you may personally attribute illness to 5G, but avoid spreading disinformation as there is no conclusive evidence.\n\n&#x200B;\n\nAlso, and I am by no means intending this as an attack or insult, but a genuine question.  If you believe that there is a greater risk of illness with low-frequency EMF radiation, do you actively try to remove radiation emitters and receivers from your home to reduce EMF radiation in your life? I know that I consciously avoid interacting with known carcinogens or pathogens. Would you say your lifestyle and technology interaction has changed with this belief? If so, how do you avoid or take preventative measures against EMF radiation?\n\n&#x200B;\n\nEDIT: I should say that should future results and analysis prove that there is an enhanced risk of cancer, I would definitely change my mind and advocate safer EMF practices.", "created_utc": 1587271274.0, "distinguished": null, "id": "fnuub4a", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnuo1lu", "score": 4, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587271500.0, "name": "t1_fnuub4a", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnuub4a/"}