{"author": {"comment_karma": 4719, "created_utc": 1560367396.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_A5A4A4.png", "id": "3xmnhu0e", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 63, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_angelohatesjello", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/angelohatesjello", "key_color": "", "name": "t5_135obn", "is_default_banner": true, "url": "/user/angelohatesjello/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "angelohatesjello"}, "body": "You love calling me stupid but I assure you I am not. Nothing of what you wrote disputes any of my points. I am always very happy to change my point of view should someone make a good point that I had not thought of. You failed to do that once. Let me clearly point out another few ocasions where your comprehension faulters.\n\n\\>That's just how it works maintaining basic health will not stop you from getting it if you're exposed to it.\n\nI am fully aware of this. Being healthy means that you won't have to be hospitalised. Which as you quite rightly pointed out, is the problem here.\n\n\\>You can't just a make a bunch of shit that you're not going to use bc someone has to pay for that. This why we want to keep the hospitals from being overwhelmed. And it doesn't matter if you build more ICUs if there isn't enough Drs. to work them. You're an idiot.\n\nI can't believe the lack of awareness in what you wrote. Someone has to pay for shutting down the world economy for an indefinite amount of time PRECISELY because we don't have enough ICU capacity during this outbreak which scientist have been trying to warn governments about for decades but goverments decide to invest in other shit rather that public health and training doctors. Who do you think will be that someone who pays for this economic downturn? Let me give you a hint: it won't be rich and powerfull people.\n\n\\>Bc if you get it and are asymptomatic you can bring it to them without knowing. And even with no risk factors still get.\n\nHow are you going to bring it to them if they are isolating?\n\nCan you disput my points without calling me stupid or swearing? It doesn't bother me I'm just letting you know that it only makes yourself look dumb.\n\nPlease, tell me what else the news told you that you haven't bothered to critically scrutinise yourself?\n\nEdit: I have no idea how to format in Reddit.", "created_utc": 1586435875.0, "distinguished": null, "id": "fmvzkut", "is_submitter": false, "link_id": "t3_fwvf0s", "parent_id": "t1_fmsr836", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmvzkut", "collapsed": false, "permalink": "/r/conspiracy/comments/fwvf0s/if_184_countries_have_coronavirus_and_only_five/fmvzkut/"}