{"author": {"comment_karma": 4477, "created_utc": 1567669405.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_008985.png", "id": "4ivay96l", "is_employee": false, "is_mod": false, "is_gold": true, "has_subscribed": true, "link_karma": 315, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_AeroBuilder", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/AeroBuilder", "key_color": "", "name": "t5_24bgsg", "is_default_banner": true, "url": "/user/AeroBuilder/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "AeroBuilder"}, "body": "China's importance in the global economy is their ability to mass produce low-level consumer products cheaply, because of their economies of scale and cheap labor.\n\nThey do not have the world by the balls in terms of expertise, technological prowess, or scientific acumen. Most of that comes from outside of China. They can be replaced, if the world has the will to move manufacturing back to western countries in part, and move other forms of manufacturing to alternative countries like India, Mexico, Brazil, Vietnam, Philippines etc...\n\nThe reason China is as powerful as they are is because they've been gaming the international system, leveraging their biggest strength, which is their complete lack of honor and integrity in business. They steal, imitate, cut corners etc... as the basis of their economy. It's government-supported, nationally mobilized grifting and China has mastered it.\n\nOnce developed countries accept that by temporarily increasing the cost of consumer items, we can prevent China from slithering its way into superpower status, it won't be a hard sell if people have the balls to come out and confront China publicly. This is a bigger issue than short term economic pain. China is the biggest threat to human freedom in our species' history and we can't let them siphon our wealth and technology anymore in exchange for short term profits, because by doing so we're enabling our own future subjugation to an Orwellian nightmare government whose entire purpose is self-preservation via complete control over people.\n\nSay what you will about Trump, but he's the only global leader who is really confronting China in any meaningful capacity. People need to get on board no matter how much it irks them to admit Trump is right about something. China is a menace.", "created_utc": 1586508815.0, "distinguished": null, "id": "fmz6xqx", "is_submitter": false, "link_id": "t3_fyaf2j", "parent_id": "t1_fmz1ntc", "score": 27, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmz6xqx", "collapsed": false, "permalink": "/r/worldnews/comments/fyaf2j/canada_and_france_say_donations_of_coronavirus/fmz6xqx/"}