{"author": {"comment_karma": 60970, "created_utc": 1304907787.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A5A4A4.png", "id": "57jwg", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 10343, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_erythro", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/erythro", "key_color": "", "name": "t5_20420t", "is_default_banner": true, "url": "/user/erythro/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "erythro"}, "body": ">No. It is not a \"gotcha\". It is simply the way it is.\n\nNo, you presented it as a gotcha.  Here's what you said for reference:\n\n>Are you prepared to defend that in a court of law and take the consequences if it turns out that it is libellous? \n\n>I ask the question because, unless you are prepared to do so, it might be construed that you support this kind of aggressive litigation to prevent someone from \"making their own point\". I am not saying that you are wrong but asking if you extend that same assumption to other people. Say, critics of Rachel Riley?\n\nWhat relevance would this point have to what I said?  You just massively diverted the conversation away from whether the Corbyn edit was misleading, towards this subject of libel, all to land on this question: \"Say, critics of Rachel Riley?\"  It's an attempt at a gotcha, but it didn't land, because I think critics of Rachel Riley are allowed to make image edits to make points.\n\n>It is relevant because Rachel Riley has taken legal action against people for behaviour that is similar to the behaviour of \"an obvious edit\".\n\nIf so, she's a hypocrite.  **_Why does that change anything for me?_**  It would only matter to me if I were taking a pro-Riley position, but I'm not, I'm taking a \"the Corbyn edit was not misleading\" position.  Riley being a hypocrite wouldn't make the Corbyn edit misleading.\n\n>Why is one person (whomsoever they are) entitled to make \"an obvious edit\" and another person gets sued for libel?\n\nSounds like a good question for Rachel and people interested in relentlessly defending her in every controversy - not for me, who is clearly only taking a side on one issue: the Corbyn edit.\n\n>You might think I am avoiding saying something. I am. You have to read about the trial to discover what and why that thing is also \"an obvious edit\".\n\nI'm not interested in the trial, and I'm deliberately avoiding reading about or commenting about it because it is not relevant.  Even if the journalist is being sued for some functionally identical obvious image edit or something, I'm free to agree with Riley about the Corbyn edit and disagree with her about her lawsuit, because they aren't related sides, other than through Rachel herself.\n\n>Oh - are you absolutely sure it is an obvious edit?\n\nYes, I am absolutely sure.\n\n>I am saying it *enforces* a dumbed down society\n\nImage edits don't enforce a dumbed down society.  They are a reasonable way of making points.  Maybe libel lawsuits do, but I'm deliberately not commenting on Riley's libel lawsuit, the only thing I'm arguing is about the Corbyn edit.\n\n>Why engage with critical thinking or drawing conclusions if you get sued for libel?\n\nWhat is your point here?  Why would my view that \"the Corbyn edit was not misleading\" be challenged in any way by frivolous libel suits being a bad thing?", "created_utc": 1585994626.0, "distinguished": null, "id": "fme936m", "is_submitter": false, "link_id": "t3_fuetsu", "parent_id": "t1_fme7i73", "score": 0, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fme936m", "collapsed": false, "permalink": "/r/unitedkingdom/comments/fuetsu/broadband_engineers_threatened_due_to_5g/fme936m/"}