{"author": {"comment_karma": 12009, "created_utc": 1423783812.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_46D160.png", "id": "lbpt6", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 274, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#46D160", "user_is_muted": null, "display_name": "u_humbleElitist_", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_03_46D160.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/humbleElitist_", "key_color": "", "name": "t5_1mu24p", "is_default_banner": true, "url": "/user/humbleElitist_/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "humbleElitist_"}, "body": "I thought you were going to start talking about the raven paradox.  \n\nI assume you mean \"how many ravens must we observe to be black in order to say that they are all black?\" when you say \"how many black ravens must we observe\"?  \n\nAlso, comparing the standard of evidence required to show that something is \"absolutely true\" in one case, vs.  uh, not doing that, when talking about falsifying theories (I guess that would count as proving it \"absolutely false\", but that's different),\nseems like kind of an unfair comparison? Like, pure \"have we falsified this theory?\" doesn't give us absolute certainty in any particular theory either, so why should the fact that no evidence we can obtain will show us with absolute certainty that all ravens are black? Cromwell's rule says that we shouldn't assign probabilities (or, probability densities) of 0 or 1 to any event (except for tautologies). \"We do not encounter any non-black raven\" is one such event.\n\nIf you take a uniform random sample of all ravens on earth, and all of the ones in the sample are black, if you update your bayesian priors as to the proportion of all ravens on earth which are black towards \"all of them\" (as in, your probability density for the lower proportions should decrease, while for higher proportions it should increase.)\n\n*Perhaps* one might say that updating one's subjective probability distribution over \"what proportion of ravens on earth are black\" based on new evidence of \"seeing more black ravens\" wouldn't be \"scientific\", but if one said it would be incorrect to do so, one would be quite wrong.\n\nBut if what we want to call \"science\" is limited to purely \"can we refute it?\" as its sole means of evaluating the evidence for and against a hypothesis, then it is sorely lacking, compared to how we can understand things.\n\nTherefore, I don't think we should use the word \"science\" to mean something such that \"has this hypothesis been refuted yet\" is the only judgement that we can say is \"scientific\".", "created_utc": 1588913826.0, "distinguished": null, "id": "fpuik9z", "is_submitter": false, "link_id": "t3_gfbygc", "parent_id": "t1_fpucint", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fpuik9z", "collapsed": false, "permalink": "/r/worldnews/comments/gfbygc/a_broadband_engineer_was_spat_on_by_a_5g/fpuik9z/"}