{"author": {"comment_karma": 462, "created_utc": 1301785927.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_545452.png", "id": "51t4t", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 715, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_ewade", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_14_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/ewade", "key_color": "", "name": "t5_btaas", "is_default_banner": true, "url": "/user/ewade/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "ewade"}, "body": "I will give them a read over in a while and respond, I am assuming this will be similar to 3G, 4G, radio waves etc that will also have a bunch of papers claiming they are dangerous and a bunch that claim they really aren't etc. You are behaving like there is a scientific consensus they are harmful and that is not true. Here are a bunch of links \nhttps://www.techradar.com/uk/news/5g-is-safe-new-scientific-guidelines-say\nhttps://www.theguardian.com/technology/2020/mar/12/5g-safe-radiation-watchdog-health\nhttps://www.forbes.com/sites/startswithabang/2019/11/01/the-science-of-why-5g-is-almost-certainly-safe-for-humans/\n\nNow the problem here is that you keep moving the goalposts of this particular argument. Here is a section of your original post in this comment chain: ''Aside from what you've written this obscene theory of RMF causing a virus also trivilizes the fact 5G isn't actually safe at all. It uses almost the same wavelengths as a US military weapon that makes you feel on fire just under your skin, its just much less powerful. But that illustrates how potent these particular wavelengths can be.''\nSo you made the point that because these waves CAN be used as a weapon, it shows how potent they CAN be. We responded by showing that just because something CAN be dangerous in a high dose, it doesn't mean it WILL be in a lower dose. So saying 'this thing is dangerous in a high dose, therefore low doses are bad for you' is incorrect, it's not necessarily true.\n\nYou seem to struggle with some concepts of developing an argument. I don't think i'm doing anything groundbreaking by giving you the food and water examples, what I am doing is applying your reasoning to other situations to show that it falls short\n\nSame with the SUN example. Your original point was ''If you focus the sunlight with a magnifying glass it heats up that area quickly and burns it - just like the aforementioned weapon does. The idea is that non-concentrated but constant dose of these same wavelengths does nothing, since non-concentrated sunlight doesn't burn like the \"concentrated\" sunlight did.\n\nYet if you have too much exposure of sunlight it causes mutations over-time and you get skin cancer.'' when I successfully pointed out that there are groups of people who can live in various places and be outside in the sun all the time with no risk, you have started to talk about sunlight and RMF, you're moving the goalposts again.\n\nTo recap, you said that because they could be used as weapons it shows how dangerous they can be at lower intensity, that was shown to be not necessarily true by giving you a bunch of examples of things that are dangerous at a high intensity but perfectly fine at a lower intensity. Then in an attempt to attack one of those examples you said that 'actually sunlight does still damage at low levels' and so I linked you to some stuff showing that, again, that is not necessarily true, there are certain people who can live in certain places all year round in the sun with no damage. Now you've come back with ''well that doesn't even matter because of this other stuff'', now that could well be a valid point, but that isn't what you started off with, you started off with 'high concentrations can be a weapons therefore low concentrations must also be bad' , that's what we have been arguing about and that's what you are wrong about, now you are introducing other claims and behaving like this is what you were claiming originally right off the bat.\n\n\n\nIt would be like if you said 'Acid burns you because it is a liquid like boiling water' and someone else replied 'but here is a list of liquid things that don't burn you, so it can't just be because it is a liquid as not all liquids burn you' and then you replied 'ha you idiot, you didn't even think of the PH scale did you?' ... well yeah, you weren't making claims about the PH scale, your claim was acid burns because it is a liquid and that is wrong, you are still correct that acid burns, but it's not because it is a liquid. What you were trying to say here was because something at a high concentration is damaging a low concentration must be as well, that is not true, the conclusion doesn't follow from the premise. Now it may still well be that a lower concentration of something that is damaging at a higher concentration  could still be damaging at a lower concentration, but it isn't JUST BECAUSE it is damaging at a high concentration as I have shown with a number of examples of things that are damaging at a High concentration and not damaging at a low concentration.\n\nThere is a difference between: The sun is damaging at a high concentration and the sun is damaging at lower concentrations vs the sun is damaging at a lower concentration BECAUSE it is damaging at a higher concentration. You were trying to claim a rule that doesn't hold true for all situations\n\nYou need to take a few Philosophy lessons on premises/conclusions and the concepts of Sound/Valid arguments\n\nEDIT: oh and also, we haven't even addressed the fact yet that, if i'm reading your first comment in this chain correctly you are agreeing that 5G causing corona virus is a conspiracy but the real truth is that 5G is going to be used by the new world order to ID chip us etc? You're a fucking idiot mate", "created_utc": 1586165447.0, "distinguished": null, "id": "fmkr7bw", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmkpjai", "score": 1, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1586165737.0, "name": "t1_fmkr7bw", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmkr7bw/"}