{"author": {"comment_karma": 19441, "created_utc": 1405082679.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_cn7e7/styles/profileIcon_75u6zsnkflt41.png?width=256&height=256&crop=256:256,smart&s=b5768b3c3e395b6c80b48c8c61be78f7050706cb", "id": "hcs02", "is_employee": false, "is_mod": true, "is_gold": true, "has_subscribed": true, "link_karma": 216646, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "https://styles.redditmedia.com/t5_cn7e7/styles/profileBanner_sews3bqhedo41.jpg?width=1280&height=384&crop=1280:384,smart&s=14632587feb8f121b1a0b5e44227171be44739eb", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_johnruby", "header_img": null, "title": "johnruby", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_cn7e7/styles/profileIcon_75u6zsnkflt41.png?width=256&height=256&crop=256:256,smart&s=b5768b3c3e395b6c80b48c8c61be78f7050706cb", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/johnruby", "key_color": "", "name": "t5_cn7e7", "is_default_banner": false, "url": "/user/johnruby/", "banner_size": [1280, 384], "user_is_moderator": null, "public_description": "If you have any question about me, please PM me and I'll be glad to answer. \n\nStay healthy and stay safe.", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "johnruby"}, "body": "For those blocked by paywall:\n\n**Alan Crawford and Peter Martin**\n\nWith a series of high-level summits culminating in a visit to Germany in the fall by President Xi Jinping, this was supposed to be the year of Europe-China diplomacy. Instead, Europeans are warning of a damaging rift.\n\nDiplomats talk of mounting anger over China’s behavior during the coronavirus pandemic including claims of price gouging by Chinese suppliers of medical equipment and a blindness to how its actions are perceived. The upshot is that Beijing’s handling of the crisis has eroded trust just when it had a chance to demonstrate global leadership.\n\n“Over these months China has lost Europe,” said Reinhard Buetikofer, a German Green party lawmaker who chairs the European Parliament’s delegation for relations with China. He cited concerns from China’s “truth management” in the early stages of the virus to an “extremely aggressive” stance by the Ministry of Foreign Affairs in Beijing and “hard line propaganda” that champions the superiority of Communist Party rule over democracy.\n\nRather than any single act responsible for the breakdown, he said, “it’s the pervasiveness of an attitude that does not purvey the will to create partnerships, but the will to tell people what to do.”\n\nWhile the Trump administration has resumed its swipes at China, European officials are traditionally less willing to be openly critical, in part for fear of retribution. The fact that politicians in Berlin, Paris, London and Brussels are expressing concern over Beijing’s narrative on Covid-19 hints at a deeper resentment with wide-ranging consequences. Already some European Union members are pursuing policies to reduce their dependence on China and keep potential predatory investments in check, defensive measures that risk hurting China-EU trade worth almost $750 billion last year.\n\nIt’s a turnaround from just a few weeks ago, when China emerged from the worst of its own outbreak to offer web seminars on best practice gained from tackling the virus where it first emerged. It also airlifted medical supplies including protective equipment, testing kits and ventilators to the worst-hit countries in Europe and elsewhere, in a [show of aid-giving](https://www.bloomberg.com/news/articles/2020-03-19/china-showers-europe-with-virus-aid-while-sparring-with-trump) that contrasted with America’s international absence.\n\nThe pandemic offered a chance for mutual solidarity. But it didn’t last.\n\n“Now the atmosphere in Europe is rather toxic when it comes to China,” said Joerg Wuttke, president of the EU Chamber of Commerce in China.\n\n## Belt and Road\n\nConcerns were aired during a March 25 call of Group of Seven foreign ministers about how China would proceed during the crisis and once it subsided. Ministers were told that Europe and the G-7 must be on guard as Beijing was likely to move “more self confidently, more powerfully” and in a way that exploits its leverage when other nations were still in lockdown, according to a European official familiar with the call.\n\nIn public, Chinese officials have struck a conciliatory tone. “When people’s lives are at stake, nothing matters more than saving lives. It is useless to argue over the merits of different social systems or models,” Foreign Ministry Spokesman Zhao Lijian [said at a regular press conference](https://www.fmprc.gov.cn/mfa_eng/xwfw_665399/s2510_665401/2511_665403/t1770948.shtml) on April 17. China, he said, is ready to work with the international community, including European countries, to “jointly safeguard the health and safety of all mankind.”\n\nYet China’s means of going about it has backfired in much of Europe. An anonymously authored text posted on the website of the Chinese embassy in France this month falsely accused French retirement home staff of leaving old people to die. It was “an incredible accusation on one of the most sensitive and tragic aspects” of the crisis in France, [Mathieu Duchatel of the Institut Montaigne](https://www.institutmontaigne.org/en/experts/mathieu-duchatel) wrote on Twitter.\n\nThe embassy website comments rang alarm bells for the needless offense caused. China underestimated the reaction to its conspiracy theories amplified by propaganda outlets, according to two European officials in Beijing. What’s more, China’s insistence that aid be accompanied by public thanks and praise has undercut the goodwill it might otherwise have gained, they said.\n\n##", "created_utc": 1587517528.0, "distinguished": null, "id": "fo54tzr", "is_submitter": true, "link_id": "t3_g5rr17", "parent_id": "t3_g5rr17", "score": 34, "stickied": false, "subreddit_id": "t5_2qh4j", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fo54tzr", "collapsed": false, "permalink": "/r/europe/comments/g5rr17/chinas_coronavirus_diplomacy_has_finally_pushed/fo54tzr/"}