{"author": {"comment_karma": 31024, "created_utc": 1347901629.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FFD635.png", "id": "91dz0", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 12104, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FFD635", "user_is_muted": null, "display_name": "u_IronBatman", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_FFD635.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/IronBatman", "key_color": "", "name": "t5_c2zhz", "is_default_banner": true, "url": "/user/IronBatman/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "IronBatman"}, "body": "Being smart in history does not always mean to being smart in everything. In fact, it's people who know a bit about a topic that are able to be convinced of conspiracies, but they don't know enough to weed out the misinformation. I consider myself good at medicine, and I know a bit about history. If someone wanted to trick me about historic events, they very well might be able to if they include enough of what I \"know\" with misinformation. If I am in a stressful situation, someone providing (mis)information can even be comforting because it allows me to feel like I understand a scary world I am currently in. \n\nThe conspiracy theories alone does not constitute psychiatric disorder. But if he has auditory hallucinations or starts accusing people of poisoning him (only eats prepackaged food to avoid tampering for example), or it is really affecting his life then you might consider seeing a doctor.\n\nI get a lot of conspiracy theories when it comes to those on the far right (vaccines are poison) and the far left (nature is better, big pharma is just trying to make money). They are adults and I can't force them to think correctly or make correct decisions. But what I do is ask questions, ask them why they believe what they believe, warn about misinformation that is often spread on the internet, and let them know that I am concerned that this kind of misinformation could lead people to make decisions that will negatively affect thier health outcomes. This is the Socrates method of arguing (look it up, it's very handy) and the goal is not to win an argument but to understand WHY they think the way they do and maybe correct done misinformation along the way. \n\nIf I scream at the top of my lungs they are wrong, LALALALALA. The natural instinct for most people is to dig thier heels in and entrench deeper into thier conspiracy theories. Otherwise, why does this doctor seem so determined to put that vaccine in my body? Navigating a discussion should be surgical, calculated, and coming from a place of genuine concern. Don't just take a hammer to it.", "created_utc": 1587505576.0, "distinguished": null, "id": "fo4jjga", "is_submitter": false, "link_id": "t3_g5fyvm", "parent_id": "t3_g5fyvm", "score": 11, "stickied": false, "subreddit_id": "t5_2xtuc", "downs": 0, "total_awards_received": 0, "edited": 1587505984.0, "name": "t1_fo4jjga", "collapsed": false, "permalink": "/r/AskDocs/comments/g5fyvm/my_very_smart_dad_has_recently_started_reading/fo4jjga/"}