{"author": {"comment_karma": 3048, "created_utc": 1385957419.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "id": "e5q9b", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 953, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF585B", "user_is_muted": null, "display_name": "u_drumbum424", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_FF585B.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/drumbum424", "key_color": "", "name": "t5_bsehs", "is_default_banner": true, "url": "/user/drumbum424/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "drumbum424"}, "body": "I want to contribute to this because I know something about how 5G/wavelengths work, I took many EM fields classes in undergrad.\n\nWe are already being exposed to the same exact higher frequencies/smaller wavelengths that 5G transmits on, and we have been for basically as long as radios have existed, even with older technology. There are higher frequency harmonics of lower frequency carrier signals for other radio systems that happen to line up perfectly with these higher frequencies that idiots are concerned over. This is an artifact of how radios work. There is no such thing as a perfect transmission, there will always be higher frequency noise content added. Even if you're nowhere near a 5G tower your body is still being blasted with the same exact frequencies they're concerned about. The FCC's job (besides fucking up net neutrality) is to ensure that all transmitter equipment that's used is safe, there is an entire industry dedicated to this.\n\nNot saying you believe the conspiracies, I just wanted to add this to the list of why these people don't know anything.\n\nEdit: it turns out these same millimeter ranges of wavelengths are used for police radar guns as well. No one is concerned about police radar, besides for getting speeding tickets.\n\nEdit edit: another thing I just thought about is that signal intensity matters. No one disputes that high levels of EMF can hurt you. The fact though is that cell towers are designed to limit their transmitted power, with multiple fail-safes. We have a good understanding of what levels of EMF will hurt you at which frequencies. Signal energy level decays with a 1/r^(2) relationship, cell towers are high in the air. Even if these microwaves could hurt you if you were hugging the transmitter, which is hundreds of feet in the air, if you're on the ground away from them you'll be fine, since the energy level decays so quickly as you move away from the tower. This frequency range dissipates rather quickly in air as it is, which is why the signal towers/repeaters need to be closer to eachother. AM radio has a much longer reach, since it's at such a lower frequency and higher wavelength.\n\nFinal edit: Yeah, this whole \"we've never used these frequencies before\" argument is absolute nonsense. [Here](https://www.ntia.doc.gov/files/ntia/publications/january_2016_spectrum_wall_chart.pdf) is a chart showing currently allocated radio frequencies in the United States. We utilize radios in everyday applications up to 300GHz. 5G shortwave, which is what people are shitting their pants about, is a tiny gray square between 84GHz and 86GHz if I have my facts straight. Obviously this chart doesn't show any health impacts, but unless the human body will react at exactly 84 to 86GHz, I don't buy it, since we've been exposed to frequencies way above and way below this since the days we were born.", "created_utc": 1587232370.0, "distinguished": null, "id": "fnt0nrv", "is_submitter": false, "link_id": "t3_g3mgns", "parent_id": "t1_fnszc9g", "score": 77, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587255804.0, "name": "t1_fnt0nrv", "collapsed": false, "permalink": "/r/worldnews/comments/g3mgns/arsonists_who_believe_5g_caused_coronavirus_have/fnt0nrv/"}