{"author": {"comment_karma": 31533, "created_utc": 1432574252.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_EA0027.png", "id": "npdek", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 536, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#EA0027", "user_is_muted": null, "display_name": "u_Oilers93", "header_img": null, "title": "Seveneighty", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_EA0027.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Oilers93", "key_color": "", "name": "t5_3kia9", "is_default_banner": true, "url": "/user/Oilers93/", "banner_size": null, "user_is_moderator": null, "public_description": "Just a dude playing a dude disguised as another dude", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Oilers93"}, "body": "> For B, I don't know, there doesn't seem to be such an overwhelming scientific concensus about the effects:\n> \n> https://blogs.scientificamerican.com/observations/we-have-no-reason-to-believe-5g-is-safe/\n\n\nLet me explain something to you. There are a ton of bad scientists out there doing bad science that end in people extrapolating results into equally bad theories. Let me give you an example.  \n\nOne of the \"leading\" researchers on the dangers of 5G (and other topics, like WiFi) is Dr Magda Havas. The leading research body against 5G is the [EMF appeal](https://www.jrseco.com/wp-content/uploads/2017-09-13-Scientist-Appeal-5G-Moratorium.pdf), where Magda Havas is listed as one of hundreds of signatories.    \n\nThis is the same Magda Havas that [conducted an experiment](http://www.emfandhealth.com/EMF&Health%20EHS%20Poor%20Studies%206.html) which led her to conclude that cordless phones cause heart problems. She set up a experiment where someone wore a chest-secured heart rate monitor and whenever the phone rang beside the test subject she recorded irregularities with the heart rate. Funny enough she didn’t account for the fact that the heart rate monitor she used included an instruction manual that explicitly said it can be disrupted by other electromagnetic sources.\n\nSome more background on Magda Havas? “Dr. Magda Havas, Professor, Trent University”, gives us three strong indicators that turn off our safeguards against unconditionally accepting someone’s opinion: she has a Ph. D., she is a professor and she works at a university. For most people that is enough to accept her credibility, especially when she talks about radiation, a subject we instinctively fear and concerns something highly abstract. However, upon further research, her Ph. D. is in **botany**, giving her no qualifications in the field of medicine or physics. In fact, [this article](https://evilcyber.com/the-rest/havas-wifi-research/) delves in this more, citing a critical response to her theory that WiFi causes adverse health effects from her own colleagues in the Department of Physics at her very own Trent University. \n\nThen, back in 2012, the Office of Science and Society from McGill University found serious inconsistencies with her study on WiFi signals causing heart irregularities. Lorne Trottier, MSc in Electrical Engineering at McGill University, teamed up with Dr. Joe Schwarcz the Director of McGill's Office of Science and Society, and Dr. David Langleben the head of cardiology at the esteemed Montreal Jewish General Hospital attempted to challenge the study published by Havas, and went as far as [Challenging Dr. Havas to replicate her findings by conducting an independent double blind experiment](http://www.emfandhealth.com/Havas%20Challenge.html). Dr. Havas declined the invitation and even doubled down on her theory by claiming that Trottier had ulterior motives due to the personal company he owns which manufactures video cards. She wrongly accuses him of having stake in WiFi devices, which he points out his company [doesn't even make](https://matrox.com/en/). Even so, this experiment would be double blind, which would ensure the findings prove nothing but truth.  \n\n**These are the kinds of people who are backing this type of thinking.**", "created_utc": 1587071916.0, "distinguished": null, "id": "fnmi9v8", "is_submitter": false, "link_id": "t3_g2d5md", "parent_id": "t1_fnl7amt", "score": 6, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": 1587075698.0, "name": "t1_fnmi9v8", "collapsed": false, "permalink": "/r/worldnews/comments/g2d5md/british_telecom_boss_reveals_39_engineers/fnmi9v8/"}