{"author": {"comment_karma": 15795, "created_utc": 1451415756.0, "has_verified_email": false, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_DB0064.png", "id": "tbirk", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1713, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#DB0064", "user_is_muted": null, "display_name": "u_Socksmaster", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_01_DB0064.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Socksmaster", "key_color": "", "name": "t5_cd8uz", "is_default_banner": true, "url": "/user/Socksmaster/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Socksmaster"}, "body": ">many conspiracies proven true were being looked into using real science or investigative/journalistic work. \n\nBut even when people put out \"real science\" or research to back up their theory, it is still disregarded. Evidence is disregarded. They say stuff like in 2016 the democratic party was colluding against bernie...people thought it was fake and then the emails came out. People originally called russia interfering in the elections ridiculous and a conspiracy but slowly but surely people started to believe it. It was a conspiracy theory that the CIA was involved in trying to assassinate Martin Luther King and then when the evidence came out that it was true...silence from the doubters. \n\n> Reality can be incredibly boring and one that has you as a person “in the know” where you can see what others can’t gives a sense of superiority and confirmation bias fuels the fire. \n\nBut at a certain point some critiquers have got to ask themselves what do they need to see to believe something? They have to ask themselves when looking at the past whether with their logic they would have been one of the ones to identify coverups that happened in the past. This Epstein event...is it a conspiracy theory right now that he did not kill himself? \n\n> that being said those same ideas can lead to truly baseless claims like in this case 5g causes illness, which anyone who studies either physics or disease will tell you is incorrect. \n\nIts not baseless. Just look at the scholarly articles. An inconclusive test does not mean it doesnt affect something. Honestly the problem is that it seems to be peoples nature to just disregard. I myself am accredited in the sciences and I can assure you it is not baseless. Those research articles were written by scientists as well and they will not just simply say \"you are incorrect\". Like I said earlier even when there is real science to possibly back up something, people disregard it.", "created_utc": 1586151468.0, "distinguished": null, "id": "fmkdkzd", "is_submitter": false, "link_id": "t3_fvbuuk", "parent_id": "t1_fmjzbka", "score": 0, "stickied": false, "subreddit_id": "t5_2qh13", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmkdkzd", "collapsed": false, "permalink": "/r/worldnews/comments/fvbuuk/people_across_the_uk_are_apparently_burning/fmkdkzd/"}