{"author": {"comment_karma": 24145, "created_utc": 1222870413.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_4856A3.png", "id": "39acq", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 21171, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#4856A3", "user_is_muted": null, "display_name": "u_stalematedizzy", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_11_4856A3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/stalematedizzy", "key_color": "", "name": "t5_bho8n", "is_default_banner": true, "url": "/user/stalematedizzy/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "stalematedizzy"}, "body": "Bare så det er sagt så har jeg like lite peilling på dette som folk flest og støtter på ingen måte uttalelsen over, men flere høyt respekterte journaler har i de siste publisert artikler der det slås alarm om hvor lite vi egentlig vet om hvordan vi påvirkes av den stadig økende elektromagnetiske strålingen vi omgis av.\n\nHer er en fra [The Lancet](https://en.wikipedia.org/wiki/The_Lancet):\n\n> The Lancet is a weekly peer-reviewed general medical journal. It is among the world's oldest, most prestigious, and best known general medical journals.\n\nhttps://www.thelancet.com/action/showPdf?pii=S2542-5196(18)30221-3\n\n> At   the   Oceania   Radiofrequency   Scientific   Advisory   Association,   an   independent   scientific   organisation,   volunteering   scientists   have   constructed   the   world’s   largest  categorised  online  database  of  peer-reviewed  studies   on   radiofrequency   electromagnetic   radiation   and  other  man-made  electromagnetic  fields  of  lower  frequencies.    A    recent    evaluation    of    2266    studies    (including    in-vitro    and    in-vivo    studies    in    human,    animal, and plant experimental systems and population studies)   found   that   most   studies   (n=1546,   68∙2%)   have   demonstrated   significant   biological   or   health   effects   associated   with   exposure   to   anthropogenic   electromagnetic     fields.     We     have     published     our     preliminary   data   on   radiofrequency   electromagnetic   radiation,   which   shows   that   89%   (216   of   242)   of   experimental  studies  that  investigated  oxidative  stress  endpoints  showed  significant  effects.7  This  weight  of  scientific   evidence   refutes   the   prominent   claim   that   the   deployment   of   wireless   technologies   poses   no   health   risks   at   the   currently   permitted   non-thermal   radiofrequency  exposure  levels.  Instead,  the  evidence  supports   the   International   EMF   Scientist   Appealby 244 scientists from 41 countries who have published on the  subject  in  peer-reviewed  literature  and  collectively  petitioned    the    WHO    and    the    UN    for    immediate    measures    to    reduce    public    exposure    to    artificial    electromagnetic fields and radiation.\n\nOg her er en fra [The Institute of Electrical and Electronics Engineers](https://en.wikipedia.org/wiki/Institute_of_Electrical_and_Electronics_Engineers):\n\n>  As of 2018, it is the world's largest association of technical professionals with more than 423,000 members in over 160 countries around the world. Its objectives are the educational and technical advancement of electrical and electronic engineering, telecommunications, computer engineering and allied disciplines.\n\n\n\nhttps://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9016183\n\n> In conclusion \n\n> People should be made aware that the EMR from using day to day cellular, Wi-Fi and Bluetooth devices are harmful to human health. The levels of radiation observed in most cases such as phone calls, internet browsing on laptops and smart-phones, using wireless routers and hotspots, Bluetooth smart-watches and smartphones are unsafe when compared with radiations limits determined by medical bodies. According to the current medical literature, various adverse health effects from exposure to RF EMR have been well documented.For now, wireless technologies must be avoided as much as possible. New and innovative wired solutions which provide the same level of user-friendliness should be encouraged.Intervention of government and medical bodies with the main purpose of protecting human health is of utmost necessity to ensure good economic development without compromising the health of the population. Countries must adopt the guide-lines suggested by medical bodies which take into account both thermal and non-thermal effects of EMR. At present, all individuals must take preventive and protective measures to protect themselves from harmful EMR exposure.\n\nSom sagt så vet jeg ingenting om dette og har ingen sterke meninger, men med tanke på hvordan vi er bygd ville det vært merkelig om dette ikke påvirker oss i nevneverdig grad:\n\nhttps://www.forbes.com/sites/quora/2017/11/03/how-the-human-body-creates-electromagnetic-fields/\n\n> Not only is it possible that the human body creates EM fields — it is the only way you can possibly exist as a coherent entity!\n\n> You are an electric field — a giant electric field which holds your atoms together, and which uses other electric fields to talk to other bits of yourself.\n\nEdit: å stemme dette ned, gjør desverre ikke at problemet forsvinner. Blir like lite rasjonelt som å være klimafornekter det. Å stikke hodet i sanda har aldri løst noen verdens ting.\n\nEdit II: Jøss, ser ut til å bli ny pers i nedstemmer dette og det etter å ha delt artikler fra Lancet og IEEE.\n\n Har r/norge blitt overtatt  av vitenskapsfornektere?", "created_utc": 1584542646.0, "distinguished": null, "id": "fku5fm4", "is_submitter": false, "link_id": "t3_fkq06l", "parent_id": "t3_fkq06l", "score": -57, "stickied": false, "subreddit_id": "t5_2qh94", "downs": 0, "total_awards_received": 1, "edited": 1584553077.0, "name": "t1_fku5fm4", "collapsed": true, "permalink": "/r/norge/comments/fkq06l/coronavirus_vaksiner_5g_folkemord_av_etniske/fku5fm4/"}