{"author": {"comment_karma": 60970, "created_utc": 1304907787.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A5A4A4.png", "id": "57jwg", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 10343, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#A5A4A4", "user_is_muted": null, "display_name": "u_erythro", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A5A4A4.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/erythro", "key_color": "", "name": "t5_20420t", "is_default_banner": true, "url": "/user/erythro/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "erythro"}, "body": "> Because the editor of the image is also the plaintiff in a libel case \n\nSo what?  Why would that affect whether she was reasonable to edit the image?\n\n> Clearly everything is discrete and unconnected. I apologise for any  misunderstanding by proposing that things could, in fact, be connected. \n\nvery funny.  my point is that Rachel being a hypocrite, or Rachel being litigious, or Rachel being a big meany doesn't change whether she was being misleading with the Corbyn image edit.  They aren't logically connected in that way.  There's a circumstantial connection, in that  the who Rachel edited the image, is the Rachel who is the plaintiff, but that doesn't change whether editing the image is deceptive or not.\n\n> I actually do not need you to repeat what I wrote \n\nI was showing you what you said, because you are now claiming that you said something that I felt was plainly inconsistent with the bit I quoted.  If you think you weren't giving a gotcha in the way I explained, then either explain yourself better, or respond with something other than waffling lecturing about how I \"missed your point\".\n\n> It was merely an example that someone can be both accuse of, and be accused of, libel \n\nWhy waste our time pointing that out?  It's a trivial and obvious thing, is that really what this whole wild goose chase has been about?  Yes you can accuse Riley of libel and she can accuse others of libel.  I don't see why that should change my mind about whether she was being reasonable or not with the Corbyn image edit.  That is the only thing I have said, it's the thing you initially challenged me on, and I still don't know why!\n\nTo me, still, this looks like you assumed I was some kind of Rachel Riley fan, sprung a \"gotcha\" trap of her being a hypocrite in some way, and then when that didn't land have retreated to more and more waffling about just about anything else that might stick.  Is that wrong?  If so, please explain what you've actually been driving at.", "created_utc": 1586015212.0, "distinguished": null, "id": "fmewrxo", "is_submitter": false, "link_id": "t3_fuetsu", "parent_id": "t1_fmeu5vw", "score": 1, "stickied": false, "subreddit_id": "t5_2qhqb", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmewrxo", "collapsed": false, "permalink": "/r/unitedkingdom/comments/fuetsu/broadband_engineers_threatened_due_to_5g/fmewrxo/"}