{"author": {"comment_karma": 5924, "created_utc": 1318982456.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_008985.png", "id": "62jhb", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 364, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#008985", "user_is_muted": null, "display_name": "u_Im_That_Guy21", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_16_008985.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Im_That_Guy21", "key_color": "", "name": "t5_atx88", "is_default_banner": true, "url": "/user/Im_That_Guy21/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Im_That_Guy21"}, "body": "> It’s called “position taking,” and is a well research psychological phenomenon.\n\nReally? In the academic database I'm using, a search for the very general \"position taking\" only returns 194 results, with the vast majority only since 2011, and not in psychology-related fields. Relative to actual well-researched topics (which number in the thousands to tens of thousands, over a period of decades), this is very small/recent. It seems like a new-ish idea with only introductory development of the discussion. However, this is not my field, so if this is in error, could you link me a review article that discusses the larger history/development of this idea in more detail?\n\n> ...really basic stuff about how false beliefs are created and move around\n\nI hope by \"basic\" you mean \"fundamental/foundational\", rather than \"obviously true\", as these types of questions aren't the ones that are ever objectively answered once and for all, but rather characterized and updated. For example, the paper you linked, describes an experiment in which participants are asked to judge what someone will do in a very contrived, unnatural experimental situation (if you've ever participated in these types of studies for school, you'll know what I mean). Results from experiments can only be applied to systems that are well-modelled by the experimental design. To extrapolate these to complex human thought/behaviour in larger society is unwise if you are expecting a reasonably realistic representation. I understand that asking these questions about people and society with scientific methods are limiting, but that does not mean we can reasonably extrapolate what we *can* measure to a much more complex situation that the experiment was not designed for. Not to say that the authors of the paper do that though.\n\nSo for those reasons, I do not believe the article you linked supports your key statement (that I'm happy to see you are walking back a little) that indulging/enabling misinformation is effective. To convince me, I would ideally see a study that analyzed behaviour of humans in a realistic situation. Potentially something utilizing social media networks may work. Are you aware of any studies that (say) analyze data from user responses to different types confrontation? Even then, people behave much differently online than they do with their family in real life, so results would still be limiting. Tough question!", "created_utc": 1584633921.0, "distinguished": null, "id": "fkxrc63", "is_submitter": false, "link_id": "t3_fl9od5", "parent_id": "t1_fkxo8d6", "score": 4, "stickied": false, "subreddit_id": "t5_2qhn7", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkxrc63", "collapsed": false, "permalink": "/r/biology/comments/fl9od5/whats_the_best_way_to_shut_down_people_who_say/fkxrc63/"}