{"author": {"comment_karma": 131042, "created_utc": 1143150273.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_46A508.png", "id": "3gsg", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1771, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#46A508", "user_is_muted": null, "display_name": "u_radiantwave", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_09_46A508.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/radiantwave", "key_color": "", "name": "t5_d820o", "is_default_banner": true, "url": "/user/radiantwave/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "radiantwave"}, "body": "from the comments on the paper so you can all calm down:\n\n[Link to the original study.](https://www.biorxiv.org/content/10.1101/2020.01.30.927871v1)\n\n\nAlex Crits-Christoph • 2 hours ago\n\nAll four of the identified amino acid insertions are extremely short and are found in the genomes of many other organisms, not just HIV. In other words, the primary finding of this work are entirely a highly expected coincidence.\n\nAll organisms contain a DNA code that has the genetic instructions for development, functioning, and growth - this is known as the \"genome\". You can imagine each genome as a book of instructions. What these authors did is look in the genome book of the 2019 novel coronavirus and identified 4 sets of letters that aren't found in the genome book of SARs, a related coronavirus. They then compared these letters to the genome book of HIV, and found some places where they looked somewhat similar - but not even identical. However, because these sets of letters were so short, they are often found in many genome books by chance - they way you might search for the phrase \"can be there\" in Google Books and find that thousands of books contain those words - but this is not an example of plagarism.\n\nNote here: We call these sets of letters \"insertions\" because they are in one genome, but not in a close relative - \"insertion\" does not imply human interference or engineering - it is an evolutionary term and refers to a natural evolutionary mutation.\n\nHere are the four insertions:\n\nTNGTKR\n\nHKNNKS\n\nRSYLTPGDSSSG\n\nQTNSPRRA\n\nThese four insertions are protein sequences, that are encoded by a DNA sequence (which you may know uses molecular \"letters\" of A, G, C, and T to encode for proteins, which uses 20 molecular amino acid \"letters\").\n\nYou, dear reader, do not have to take anybody's word for it that these letters are a concidence - you can do the bioinformatics yourself!\n\nIf you would go to:\nhttps://blast.ncbi.nlm.nih.gov/Blast.cgi\n\nYou will arrive at a search engine for these genome books, kind of like the Google of biology. Click on \"Protein Blast\", because are going to search for these protein sequences.\n\nUnder where it says \"Enter accession number\", you can paste any one of the four sequences above.\n\nAnd then you can hit the \"BLAST\" button at the bottom of the screen. In a few minutes you will get a set of results.\n\nLet's go through the results for the longest sequence, \"RSYLTPGDSSSG\", together.\n\nUnder the \"Description\" field you can see resulting hits. The first hit you see is to \"spike glycoprotein [Wuhan seafood market pneumonia virus]\" - this is good, because we know that this sequence came from this genome. Under \"Per. Id\" you can see the similarity of this sequence to other hits - in this case, you can start by seeing that this sequence is also found in Bat coronavirus, so isn't actually novel at all! And there are many comparative hits that as equally as good, or often better, than the HIV comparison.\n\nLet's then take a look at the second sequence, \"HKNNKS\", together.\n\nIf you go through the same search process for this sequence and look again at the results, you can see hundreds of perfectly identical matches. Maybe you see Sipha flava - that's an Aphid, or Tetrahymena - that's an Amoeba. Drosophila is a fruit fly. Clearly this sequence is found in thousands of genomes.\n\nFortunately, the search has a built in way of answering the question \"How likely was this result to have occurred by chance?\". It is called the E-value, or Expect Value - the number of times we'd expect to see this result purely by chance. As you can see here, many of the E-values listed on this page are greater than 7829 - so we'd have expected to see 7829 instances of matches like these completely by chance! This is not evidence for gene transfer or gene similarity - it's simply a coincidence. As you now search for the other insertions described by this paper, you'll see that all of them hit hundreds of other genomes simply by chance. It is no surprise at all that they could have matches with some similarity in the HIV genome.\n\nCongratulations! You are now a more careful and proficient bioinformatician than the authors of this paper.", "created_utc": 1580515017.0, "distinguished": null, "id": "fg502lh", "is_submitter": false, "link_id": "t3_ewtkt4", "parent_id": "t3_ewtkt4", "score": 2, "stickied": false, "subreddit_id": "t5_2dqnia", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fg502lh", "collapsed": false, "permalink": "/r/cvnews/comments/ewtkt4/hiv_genes_in_the_coronavirus/fg502lh/"}