{"author": {"comment_karma": 567, "created_utc": 1410247101.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_bbpsv/styles/profileIcon_bjwb6a2ct7931.jpg?width=256&height=256&crop=256:256,smart&s=db811d9b4a36d9b5cf1ba9b641dd2313ad5a232c", "id": "ibe6f", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 4945, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_chiamalogio", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_bbpsv/styles/profileIcon_bjwb6a2ct7931.jpg?width=256&height=256&crop=256:256,smart&s=db811d9b4a36d9b5cf1ba9b641dd2313ad5a232c", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/chiamalogio", "key_color": "", "name": "t5_bbpsv", "is_default_banner": true, "url": "/user/chiamalogio/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "chiamalogio"}, "body": " China just essentially declared military martial law and activated a full military response against the coronavirus pandemic  \nMaking things even more interesting, China’s CDC just issued a series of military orders that essentially place the entire nation under military martial law.  \nDetailed in this executive order released by the Chinese government, China’s new “wartime” declaration calls on biological weapons laboratories in China to “put an end to pathogenic samples being stolen, leaked or lost.”  \nMuch of China’s declaration centers around wartime commands that demand absolute loyalty and zero errors in logistics and control of local regions. Here’s a rough translation from one of the directives (directive five):  \nThe current situation of epidemic prevention and control is extremely serious, the responsibility of prevention and control is heavier than that of Mount Tai. With the coming battle, all Party branches should think and launch, unite the masses and commit fully to the role of battle fortress; cadres at all levels should lead by example, dare to take on the role and give full commitment to the leading role; and each Party member should rush forward, shoulder the heavy burden, and give full commitment to the role of pioneer and model. All Party branches, branches and cadres at all levels should earnestly fulfill their main responsibilities, and the disciplinary committee shall fulfill its supervisory responsibilities to ensure the smooth flow of decrees and the prohibition of the operation.  \nIf you can make any sense of that, you might fit in well with a communist society, which at its core is rooted in total insanity and delusion. In fact, the very structure of communism makes society highly vulnerable to pandemics, since no truth tellers are allowed to warn anyone about the outbreak. Censorship gets people killed, both in communist China and in the USA where the evil tech giants are also complicit in covering up truth about pandemic.", "created_utc": 1581663649.0, "distinguished": null, "id": "fhk27pb", "is_submitter": true, "link_id": "t3_f3oida", "parent_id": "t3_f3oida", "score": 1, "stickied": false, "subreddit_id": "t5_2qh4r", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fhk27pb", "collapsed": false, "permalink": "/r/conspiracy/comments/f3oida/department_of_defense_confirms_coronavirus_is_a/fhk27pb/"}