{"author": {"comment_karma": 0, "created_utc": 1583577841.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_0079D3.png", "id": "5vbue54o", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#0079D3", "user_is_muted": null, "display_name": "u_vibeswriter", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_0079D3.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/vibeswriter", "key_color": "", "name": "t5_2h5fkj", "is_default_banner": true, "url": "/user/vibeswriter/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "vibeswriter"}, "clicked": false, "created_utc": 1583578718.0, "distinguished": null, "edited": false, "id": "fetp8t", "is_original_content": false, "is_self": true, "locked": false, "name": "t3_fetp8t", "num_comments": 0, "over_18": false, "score": 1, "downs": 0, "title": "The Coronavirus Would Be A Bad Bioweapon: Covid-19 The Wuhan lab", "view_count": null, "media": null, "url": "https://www.reddit.com/r/u_vibeswriter/comments/fetp8t/the_coronavirus_would_be_a_bad_bioweapon_covid19/", "permalink": "/r/u_vibeswriter/comments/fetp8t/the_coronavirus_would_be_a_bad_bioweapon_covid19/", "selftext": "&#x200B;\n\n[The Coronavirus Would Be A Bad Bioweapon: Covid-19 The Wuhan lab](https://preview.redd.it/wn8q9vowe8l41.png?width=1183&format=png&auto=webp&s=d3b8cf77147fe68ce246948446e8c4fa4408e0fe)\n\n**Coronavirus Would Be A Bad Bioweapon**\n\nContinue Reading Here: [https://www.tobivibes.ng/the-coronavirus-would-be-a-bad-bioweapon-covid-19-the-wuhan-lab/](https://www.tobivibes.ng/the-coronavirus-would-be-a-bad-bioweapon-covid-19-the-wuhan-lab/)\n\nSeveral experts told me the theory that the virus was meant to be a bioweapon doesn’t make sense, either. One big reason: [Covid-19](https://www.tobivibes.ng/wuhan-china-debunks-theories-of-corona-virus-coming-from-their-lab/) isn’t all that deadly or transmissible, compared to other potential pathogens out there.  \n“To make it as a bioweapon, if that’s what you wanted to do, there are scarier and more virulent pathogens to work with,” said Keusch of Boston University.\n\nFor instance, Ebola and the West African Lassa virus are deadly threats that can only be studied in biosafety level 4 labs, like Wuhan. Crimean-Congo hemorrhagic fever is a tick-borne disease that has a death rate of 30 to 50 percent. The global death rate for Covid-19, meanwhile, is around 3 percent at the moment, but it’s expected to come down dramatically as more cases are discovered in the coming weeks. And even now, it varies widely by country and region.  \nCoronavirus Would Be A Bad Bioweapon to kill a lot of people, there are much deadlier pathogens you could use.\n\nThe Wuhan lab has the same safety protocols as top biosafety labs in the US and Europe  \nIn his article in the New York Post, Mosher suggests that we shouldn’t trust the officials who ran the Wuhan lab. “It sure sounds like China has a problem keeping dangerous pathogens in test tubes where they belong, doesn’t it?” he says.\n\nI asked LeDuc, who runs the Galveston biocontainment lab if he has any experience with the Wuhan lab. It turns out he has a lot. He and his colleagues have worked for six years with the Chinese team there, both in advising them on building their lab and keeping it safe and on scientific collaboration. “I can tell you that lab in Wuhan is equivalent to any lab here in the US and Europe,” he said.\n\nFor instance, many labs now use radio waves to track and inventory vials containing dangerous pathogens.\n\nKeusch agrees. “I don’t think there’s any likelihood that the lab is less prepared in terms of protocol and capability than any lab in the US. It’s perfect, though nothing is perfect,” he said.\n\nThe rumors have also reportedly hurt the lab’s ability to do its work.\n\n“The rumors… have caused severe damage to our researchers who have been dedicated to working on the front line, and seriously interrupted the emergency research we are doing during the epidemic,” the lab said in a statement, according to the South China Morning Post.\n\nWhy we need to figure out all the details of where the virus came from  \nAccording to Bruce Aylward, an epidemiologist who led the World Health Organization’s recent mission to China to assess its Covid-19 response, the investigation into where and how the virus jumped to people is ongoing. The focus remains on the (now closed) Huanan Wholesale Seafood Market, the wildlife market inside it, and other area markets.\n\n“Ever since SARS, the market authorities now have to record which animals are sold by whom and where they come from in these markets. So now there’s a list of 10 vendors from seven provinces,” he told my colleague Julia Belluz in a recent interview. “Then China’s CDC can do a case-control study based on where in the market these animals were.”\n\nThe focus in the past month has been on saving lives, he said, but as new cases and deaths decline, the investigators will eventually be able to turn back to getting animal info from the market vendors and testing the animals.\n\nRacaniello says the source must be identified to eliminate the chance that the virus is introduced into people again.\n\nFor LeDuc, China’s experience with the coronavirus should be a clear message of the significant public health threat live animal markets post.\n\n“The reason we see \\[coronaviruses like SARS and SARS-CoV-2 emerge\\] in China is they have these live animal markets, where they bring in animals alive and co-house them, one cage on top of another, where there’s an opportunity for transmission between atypical hosts,” says LeDuc.\n\nWe’ll need to be patient for Chinese investigators to get to the bottom of how the virus made the jump from animals to humans. In the meantime, remember that in a public health crisis, conspiracy theories are a distraction. Instead, it’s our collective responsibility to stay focused on keeping each other safe.\n\nCorrection: An earlier version of this story misidentified Tom Cotton’s position in Congress. He is a US senator.\n\nContinue Reading Here: [https://www.tobivibes.ng/the-coronavirus-would-be-a-bad-bioweapon-covid-19-the-wuhan-lab/](https://www.tobivibes.ng/the-coronavirus-would-be-a-bad-bioweapon-covid-19-the-wuhan-lab/)\n\nCoronavirus Would Be A Bad Bioweapon — **Eliza Barclay**", "stickied": false}