{"author": {"comment_karma": 13, "created_utc": 1565186319.0, "has_verified_email": true, "icon_img": "https://styles.redditmedia.com/t5_22puym/styles/profileIcon_6jt1hhujrum41.jpg?width=256&height=256&crop=256:256,smart&s=a25dcdcef94be0a1aec9d97a1284e5ab2575da45", "id": "2fv9qzmx", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 1, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "", "user_is_muted": null, "display_name": "u_oerrado", "header_img": null, "title": "Errado", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://styles.redditmedia.com/t5_22puym/styles/profileIcon_6jt1hhujrum41.jpg?width=256&height=256&crop=256:256,smart&s=a25dcdcef94be0a1aec9d97a1284e5ab2575da45", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": false, "link_flair_position": "", "display_name_prefixed": "u/oerrado", "key_color": "", "name": "t5_22puym", "is_default_banner": true, "url": "/user/oerrado/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "oerrado"}, "body": "The book is called, \"End of Days: Predictions and Prophecies About the end of the World by Sylvia Browne, Lindsay Harrison\". I just torrented the book and here are some 2020 predictions (in the order I found them):\n\n**Supposed Covid-19, another disease and more**\n\nThe really dire bad news for health won’t make its appearance until late in the second half of the century, which we’ll discuss several pages from now. The only really alarming developments in the first half will be far outweighed by the advancements I’ve just described, but they’re worth mentioning:\n\n* A bacterial infection resembling the “flesh-eating disease” of several years ago will arrive in 2010, transmitted to humans by almost microscopic mites undetectably imported on exotic birds. Known medications and antibiotics will be completely ineffective against this funguslike, extremely contagious disease, and its victims will be quarantined until it’s discovered that the bacteria can be destroyed through some combination of electrical currents and extreme heat.\n* In around 2020 a severe pneumonia-like illness will spread throughout the globe, attacking the lungs and the bronchial tubes and resisting all known treatments. Almost more baffling than the illness itself will be the fact that it will suddenly vanish as quickly as it arrived, attack again ten years later, and then disappear completely.\n\n&#x200B;\n\n**End of the Executive Power in the US**\n\nThe year 2020 will mark the end of the U.S. presidency and the executive branch of the government. Let’s just say the American public will finally be fed up by then and leave it at that.\n\nThe legislative branch will essentially absorb the responsibilities of the executive branch, with a streamlined body of elected representatives, an equal number from each state, forming the new legislature, which will be known simply as the Senate. The “party” system of Democrats, Republicans, Independents, et al., will un-complicate itself into Liberals and Conservatives, who will debate and vote on each proposed bill and law in nationally televised sessions.\n\nShe goes on explaining the details but I think you got it\n\n&#x200B;\n\n**Now some wishful thinking.**\n\nBy 2020 we’ll see the end of IRAs, mutual funds, pension, and retirement plans, and yes, it’s true, the stock market.\n\nAnd hard as it may be to believe at this moment, by the mid- 2020s the global image of the United States will be significantly rehabilitated. What’s fascinating is that we’ll accomplish this by shifting the vast majority of our humanitarian focus back on our own problems and their solutions. We’ll evolve into a nation that inspires rather than invades and be admired all the more for it.\n\n&#x200B;\n\n**Cool, volcanos again.**\n\n\\[...\\]a polar tilt is a shift in the angle at which the earth tilts on its axis, toward or away from the sun, causing all sorts of changes in ocean currents and weather in general.”\n\nThat having been said, the polar tilt will reach its peak by 2020, in addition to which: In around 2018 worldwide seismic activity will result in a rash of volcanoes and earthquakes.\n\nThe resulting atmospheric dust will create enough pollution to cause disastrous crop failures in the early 2020s.", "created_utc": 1584288683.0, "distinguished": null, "id": "fkkonoa", "is_submitter": false, "link_id": "t3_fiiobf", "parent_id": "t3_fiiobf", "score": 3, "stickied": false, "subreddit_id": "t5_2qjxn", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fkkonoa", "collapsed": false, "permalink": "/r/Paranormal/comments/fiiobf/sylvia_browne_predicted_the_coronavirus/fkkonoa/"}