{"author": {"comment_karma": 1856, "created_utc": 1433388972.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_545452.png", "id": "nwao2", "is_employee": false, "is_mod": false, "is_gold": false, "has_subscribed": true, "link_karma": 123, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#545452", "user_is_muted": null, "display_name": "u_thewallris", "header_img": null, "title": "", "previous_names": [], "over_18": true, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_07_545452.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/thewallris", "key_color": "", "name": "t5_e3s7z", "is_default_banner": true, "url": "/user/thewallris/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "thewallris"}, "body": "How did it come to this? I can still remember how it all began. I was a grad student at the time, working on my PhD thesis in astrophysics, when I got an email from my professor about the strange solar observations his team had been making. The best hypothesis anyone could come up with was that somehow, the sun was dying, trillions of years before it was expected to die. I was looking over solar flare reports when I got a call from my mother. Turn on the TV, any channel. \n\nI remember sitting in the lab and watching in horror as a massive humanoid creature descended from the sky and landed in the middle of Mexico City. He began to speak, and the news stations scrambled to find someone to translate it. His name was Huitzilopochtli, God of the sun, war, and human sacrifice. He recounted the ancient Aztec myth (or what we had assumed to be myth) of how he had become the fifth sun, how the stars and the moon assaulted him every night, and how he continued to beat them back. He had long relied on the people of earth for human sacrifices to nourish him in his fight, but as there hadn’t been any sacrifices in hundreds of years, he had grown weak. He said unless human sacrifices resumed that day, he would be too weak to fend off their attack. He would die and the world and all of humanity would die with him. With that, he rose into the air and flew back towards the sun.\n\nMass panic set in. Riots in the streets. Politicians meeting behind closed doors. Religious leaders making frantic statements to their followers. Normal people pushing little children to the ground for an extra crate of bottled water. Nobody knew what to do. The world’s leaders decided that the best course of action was to appease the creature. And so the first wave of sacrifices began. \n\nOnly those who were terminally ill, older than 90, or had less than 24 hours to live were allowed to be sacrificed. It worked at first, but soon the list of volunteers began to dwindle. The age requirement was dropped to 80, then 70, and people were allowed to volunteer even if they had no pre-existing conditions. The volunteer list began to dwindle again, but the lack of the highest resource-consuming people meant that many governments were flush with cash. To spur volunteers, they began to offer sacrifice payments, wherein the family of a person who volunteered for sacrifice would receive a cash settlement. That's when the real trouble began.", "created_utc": 1462564674.0, "distinguished": null, "id": "d2vk2y1", "is_submitter": false, "link_id": "t3_4i5w1r", "parent_id": "t3_4i5w1r", "score": 1, "stickied": false, "subreddit_id": "t5_2s3nb", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_d2vk2y1", "collapsed": false, "permalink": "/r/WritingPrompts/comments/4i5w1r/wp_it_has_been_500_years_since_the_last_human/d2vk2y1/"}