{"author": {"comment_karma": 3679, "created_utc": 1202348794.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A06A42.png", "id": "331uc", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 1795, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": null, "show_media": true, "icon_color": "#A06A42", "user_is_muted": null, "display_name": "u_Catch-22", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_05_A06A42.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/Catch-22", "key_color": "", "name": "t5_21llct", "is_default_banner": true, "url": "/user/Catch-22/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "Catch-22"}, "body": "TLDR: I was almost one of the people holding these signs.  \n\n&#x200B;\n\nI was driving through downtown a few days ago and came across a demonstration in the city, with cars honking their horns, flying \"Don't tread on me\" flags, and crowds on the streets.\n\nWhile stuck in this traffic, and after realizing I was in the middle of an anti-quarantine demonstration in the middle of a pandemic, I mused that I would put up my own signs in counter, something silly and offensive like \"**I'm Young and Healthy, So Why Bother!?**\" , or \"**Virus Kill People, Get Over It!\"** to hopefully inspire a few people to reconsider.\n\nAs I drove, I continued to read demonstrator signs,  and began to get a sinking feeling in my stomach. As I read more and more, I realized that my obviously sarcastic and morbid counter-demonstration would actually be right at home in the middle of this, and that many people in the crowd would actually *agree!*\n\nI saw dazzling displays of ignorance about \"My Body, My Choice!\", and feats of mental gymnastics like \"COVID is a LIE!\", and conceded that the moral and ethical divide, not to mention the level of critical thinking needed, was too great to overcome, no matter how blatantly sarcastic the sign.\n\nBut why be surprised? When politicians and big business have spent generations convincing the population that the only value of life is producing for their company; and creating a system that reinforces these bonds by tying basic rights like healthcare to full-time employment, then it is no wonder that the people, deprived of their only sense of self worth, would protest. \n\nThey are left at home with their thoughts, with no job for validation, no sports for distractions, and no means or capability to imagine the worth in their own lives, let alone the life of an unknown in a hospital or nursing home.\n\nWith that thought, I just shook my head, turned into a parallel street, and left the protest in my rear-view mirror.\n\nMy only comfort was in imagining that someone among the crowd was staging their own, silent, counter-protest.", "created_utc": 1588619136.0, "distinguished": null, "id": "fphd3p8", "is_submitter": false, "link_id": "t3_gdc61w", "parent_id": "t3_gdc61w", "score": 19, "stickied": false, "subreddit_id": "t5_2qh96", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fphd3p8", "collapsed": false, "permalink": "/r/self/comments/gdc61w/nothing_pisses_me_off_like_the_protestor_with_the/fphd3p8/"}