{"author": {"comment_karma": 92508, "created_utc": 1347741697.0, "has_verified_email": true, "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_FF4500.png", "id": "90ptd", "is_employee": false, "is_mod": true, "is_gold": false, "has_subscribed": true, "link_karma": 118, "subreddit": {"default_set": true, "user_is_contributor": null, "banner_img": "", "restrict_posting": true, "user_is_banned": null, "free_form_reports": true, "community_icon": "", "show_media": true, "icon_color": "#FF4500", "user_is_muted": null, "display_name": "u_asdaaaaaaaa", "header_img": null, "title": "", "previous_names": [], "over_18": false, "icon_size": [256, 256], "primary_color": "", "icon_img": "https://www.redditstatic.com/avatars/avatar_default_02_FF4500.png", "description": "", "submit_link_label": "", "header_size": null, "restrict_commenting": false, "subscribers": 0, "submit_text_label": "", "is_default_icon": true, "link_flair_position": "", "display_name_prefixed": "u/asdaaaaaaaa", "key_color": "", "name": "t5_duvmk", "is_default_banner": true, "url": "/user/asdaaaaaaaa/", "banner_size": null, "user_is_moderator": null, "public_description": "", "link_flair_enabled": false, "disable_contributor_requests": false, "subreddit_type": "user", "user_is_subscriber": null}, "name": "asdaaaaaaaa"}, "body": "I disagree. We all know that at any point, any governor, or even federal level person in an authoritative position has access to much more, easier information than you or I. No matter what excuses people make for the incompetancy and dishonesty in the face of a tragedy, the fact remains the correct information is available to them. They can consult with a number of people, read studies, learn about the virus itself if they so desire. Any one of them could call Dr. Fauci (who has made it clear he will help anyone who has questions for the states, and is basically a living, breathing, shining example of what to do and how to handle this), and say \"Hey man, so I actually don't know what I'm doing, would you recommend any specific action, or should be leaning more towards careful, be more lax, etc\".\n\n They certainly could ask for help at any time, there is no shortage of professionals who would be able to give correct advice, information and direction. So far, I haven't seen this. What the people currently in charge are doing is not based on science, or how the professionals see the situation (with exceptions to a few, of course, like Cuomo). I see nothing other than gross negligence, or incompetence, as being a politician is mainly about having a general idea of the system, and the people, and making decisions on things you might not specifically have experience or education in, thus, you consult professionals who know what they're doing.\n\nOn top of that, just because you aren't able to meet every standard doesn't mean you have to outright lie about it. How many politicians in charge have actually warned/advised that numbers are much, much higher than reported, because they're not able to test enough? Not many from what I've seen. We know what works, complete (as much as possible, obviously) shutdown. Currently, I don't see enough aggression from our leaders, including this one. Yes, he says cool things, but I think he needs to be much harder on people and businesses. Too many people are taking advantage of certain rules that are in place to save lives, for something as trivial as money, or a business, two things which can be replaced. Human lives cannot be replaced and should remain top priority. I'm not saying shutter everything, but until the number flattens and starts receding, we should be doing more and more, everything we can. If we sit on our ass and wait for the numbers to magically fix themselves, we'll be too late no matter what we do. \n\nTake action -> Wait too weeks -> Revise, take more action if necessary\n\nThat's I guess the current plan, as we can see, it did not work in other countries. As Fauci said, if you think you're overreacting, you're probably near where you want to be.", "created_utc": 1586220991.0, "distinguished": null, "id": "fmn9e4o", "is_submitter": false, "link_id": "t3_fw1o73", "parent_id": "t1_fmm7px1", "score": 0, "stickied": false, "subreddit_id": "t5_2gu8oq", "downs": 0, "total_awards_received": 0, "edited": false, "name": "t1_fmn9e4o", "collapsed": false, "permalink": "/r/CoronavirusMD/comments/fw1o73/official_counts_understate_the_us_coronavirus/fmn9e4o/"}